zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62132-pinctrl.h
#define PA7_TSTBUS4_OUT        MCHP_PINMUX(a, 7, 0x260, 33, periph)
/* pa7_tstbus5_out */
#define PA7_TSTBUS5_OUT        MCHP_PINMUX(a, 7, 0x264, 38, periph)
/* pa7_tstbus8_out */
#define PA7_TSTBUS8_OUT        MCHP_PINMUX(a, 7, 0x260, 34, periph)
/* pa7_tstbus9_out */
#define PA7_TSTBUS9_OUT        MCHP_PINMUX(a, 7, 0x264, 39, periph)
/* pa8_ac_cmp0_out */
#define PA8_AC_CMP0_OUT        MCHP_PINMUX(a, 8, 0x270, 40, periph)
/* pa8_ac_cmp1_out */
#define PA8_AC_CMP1_OUT        MCHP_PINMUX(a, 8, 0x274, 36, periph)
/* pa8_ac_cmptout_out */
#define PA8_AC_CMPTOUT_OUT     MCHP_PINMUX(a, 8, 0x274, 37, periph)
/* pa8_ac_cmptrdy_out */
#define PA8_AC_CMPTRDY_OUT     MCHP_PINMUX(a, 8, 0x270, 41, periph)
/* pa8_can0_tx_out */
#define PA8_CAN0_TX_OUT        MCHP_PINMUX(a, 8, NA, NA, gpio)
/* pa8_can1rx_in */
#define PA8_CAN1RX_IN          MCHP_PINMUX(a, 8, 0x190, 2, periph)
/* pa8_can1_tx_out */
#define PA8_CAN1_TX_OUT        MCHP_PINMUX(a, 8, 0x274, 38, periph)
/* pa8_cclin1_in */
#define PA8_CCLIN1_IN          MCHP_PINMUX(a, 8, 0xb8, 16, periph)
/* pa8_cclin2_in */
#define PA8_CCLIN2_IN          MCHP_PINMUX(a, 8, 0xbc, 2, periph)
/* pa8_cclin4_in */
#define PA8_CCLIN4_IN          MCHP_PINMUX(a, 8, 0xc4, 16, periph)
/* pa8_cclin5_in */
#define PA8_CCLIN5_IN          MCHP_PINMUX(a, 8, 0xc8, 2, periph)
/* pa8_cclo0_out */
#define PA8_CCLO0_OUT          MCHP_PINMUX(a, 8, 0x270, 1, periph)
/* pa8_cclo1_out */
#define PA8_CCLO1_OUT          MCHP_PINMUX(a, 8, 0x26c, 1, periph)
/* pa8_coexwlanact_in */
#define PA8_COEXWLANACT_IN     MCHP_PINMUX(a, 8, 0x194, 23, periph)
/* pa8_coex_rf_act_out */
#define PA8_COEX_RF_ACT_OUT    MCHP_PINMUX(a, 8, 0x26c, 41, periph)
/* pa8_extint1_in */
#define PA8_EXTINT1_IN         MCHP_PINMUX(a, 8, 0x4, 16, periph)
/* pa8_extint2_in */
#define PA8_EXTINT2_IN         MCHP_PINMUX(a, 8, 0x8, 2, periph)
/* pa8_extint3_in */
#define PA8_EXTINT3_IN         MCHP_PINMUX(a, 8, 0xc, 23, periph)
/* pa8_fectrl0_out */
#define PA8_FECTRL0_OUT        MCHP_PINMUX(a, 8, 0x26c, 40, periph)
/* pa8_fectrl3_out */
#define PA8_FECTRL3_OUT        MCHP_PINMUX(a, 8, 0x274, 39, periph)
/* pa8_fectrl4_out */
#define PA8_FECTRL4_OUT        MCHP_PINMUX(a, 8, 0x270, 42, periph)
/* pa8_fectrl5_out */
#define PA8_FECTRL5_OUT        MCHP_PINMUX(a, 8, 0x274, 40, periph)
/* pa8_nmi_in */
#define PA8_NMI_IN             MCHP_PINMUX(a, 8, 0x3c, 23, periph)
/* pa8_qd0_in */
#define PA8_QD0_IN             MCHP_PINMUX(a, 8, 0xa0, 23, periph)
/* pa8_qd0_out */
#define PA8_QD0_OUT            MCHP_PINMUX(a, 8, 0x26c, 35, periph)
/* pa8_qd1_out */
#define PA8_QD1_OUT            MCHP_PINMUX(a, 8, 0x270, 35, periph)
/* pa8_qd2_in */
#define PA8_QD2_IN             MCHP_PINMUX(a, 8, 0xa8, 16, periph)
/* pa8_qd2_out */
#define PA8_QD2_OUT            MCHP_PINMUX(a, 8, 0x26c, 37, periph)
/* pa8_qd3_in */
#define PA8_QD3_IN             MCHP_PINMUX(a, 8, 0xac, 2, periph)
/* pa8_qd3_out */
#define PA8_QD3_OUT            MCHP_PINMUX(a, 8, 0x26c, 36, periph)
/* pa8_qeihome0g2_in */
#define PA8_QEIHOME0G2_IN      MCHP_PINMUX(a, 8, 0x170, 16, periph)
/* pa8_qeiindx0g2_in */
#define PA8_QEIINDX0G2_IN      MCHP_PINMUX(a, 8, 0x174, 16, periph)
/* pa8_qeiindx0g3_in */
#define PA8_QEIINDX0G3_IN      MCHP_PINMUX(a, 8, 0x178, 2, periph)
/* pa8_qeiqea0g3_in */
#define PA8_QEIQEA0G3_IN       MCHP_PINMUX(a, 8, 0x17c, 2, periph)
/* pa8_qeiqea0g4_in */
#define PA8_QEIQEA0G4_IN       MCHP_PINMUX(a, 8, 0x180, 23, periph)
/* pa8_qeiqeb0g4_in */
#define PA8_QEIQEB0G4_IN       MCHP_PINMUX(a, 8, 0x184, 23, periph)
/* pa8_qspics_out */
#define PA8_QSPICS_OUT         MCHP_PINMUX(a, 8, 0x26c, 34, periph)
/* pa8_scom0p0_in */
#define PA8_SCOM0P0_IN         MCHP_PINMUX(a, 8, 0x40, 16, periph)
/* pa8_scom0p0_out */
#define PA8_SCOM0P0_OUT        MCHP_PINMUX(a, 8, 0x26c, 2, periph)
/* pa8_scom0p2_in */
#define PA8_SCOM0P2_IN         MCHP_PINMUX(a, 8, 0x48, 23, periph)
/* pa8_scom0p2_out */
#define PA8_SCOM0P2_OUT        MCHP_PINMUX(a, 8, 0x26c, 4, periph)
/* pa8_scom0p3_out */
#define PA8_SCOM0P3_OUT        MCHP_PINMUX(a, 8, 0x26c, 3, periph)
/* pa8_scom1p0_in */
#define PA8_SCOM1P0_IN         MCHP_PINMUX(a, 8, 0x50, 2, periph)
/* pa8_scom1p0_out */
#define PA8_SCOM1P0_OUT        MCHP_PINMUX(a, 8, 0x270, 5, periph)
/* pa8_scom1p2_out */
#define PA8_SCOM1P2_OUT        MCHP_PINMUX(a, 8, 0x26c, 6, periph)
/* pa8_scom1p3_in */
#define PA8_SCOM1P3_IN         MCHP_PINMUX(a, 8, 0x5c, 16, periph)
/* pa8_scom1p3_out */
#define PA8_SCOM1P3_OUT        MCHP_PINMUX(a, 8, 0x26c, 5, periph)
/* pa8_scom2p0_in */
#define PA8_SCOM2P0_IN         MCHP_PINMUX(a, 8, 0x60, 16, periph)
/* pa8_scom2p0_out */
#define PA8_SCOM2P0_OUT        MCHP_PINMUX(a, 8, 0x26c, 7, periph)
/* pa8_scom2p2_in */
#define PA8_SCOM2P2_IN         MCHP_PINMUX(a, 8, 0x68, 23, periph)
/* pa8_scom2p2_out */
#define PA8_SCOM2P2_OUT        MCHP_PINMUX(a, 8, 0x26c, 9, periph)
/* pa8_scom2p3_out */
#define PA8_SCOM2P3_OUT        MCHP_PINMUX(a, 8, 0x26c, 8, periph)
/* pa8_scom3p0_in */
#define PA8_SCOM3P0_IN         MCHP_PINMUX(a, 8, 0x70, 2, periph)
/* pa8_scom3p0_out */
#define PA8_SCOM3P0_OUT        MCHP_PINMUX(a, 8, 0x270, 10, periph)
/* pa8_scom3p2_out */
#define PA8_SCOM3P2_OUT        MCHP_PINMUX(a, 8, 0x26c, 11, periph)
/* pa8_scom3p3_in */
#define PA8_SCOM3P3_IN         MCHP_PINMUX(a, 8, 0x7c, 16, periph)
/* pa8_scom3p3_out */
#define PA8_SCOM3P3_OUT        MCHP_PINMUX(a, 8, 0x26c, 10, periph)
/* pa8_scom4p0_in */
#define PA8_SCOM4P0_IN         MCHP_PINMUX(a, 8, 0x80, 16, periph)
/* pa8_scom4p0_out */
#define PA8_SCOM4P0_OUT        MCHP_PINMUX(a, 8, 0x26c, 12, periph)
/* pa8_scom4p2_in */
#define PA8_SCOM4P2_IN         MCHP_PINMUX(a, 8, 0x88, 23, periph)
/* pa8_scom4p2_out */
#define PA8_SCOM4P2_OUT        MCHP_PINMUX(a, 8, 0x26c, 14, periph)
/* pa8_scom4p3_out */
#define PA8_SCOM4P3_OUT        MCHP_PINMUX(a, 8, 0x26c, 13, periph)
/* pa8_scom5p0_in */
#define PA8_SCOM5P0_IN         MCHP_PINMUX(a, 8, 0x90, 2, periph)
/* pa8_scom5p0_out */
#define PA8_SCOM5P0_OUT        MCHP_PINMUX(a, 8, 0x270, 15, periph)
/* pa8_scom5p2_out */
#define PA8_SCOM5P2_OUT        MCHP_PINMUX(a, 8, 0x26c, 16, periph)
/* pa8_scom5p3_in */
#define PA8_SCOM5P3_IN         MCHP_PINMUX(a, 8, 0x9c, 16, periph)
/* pa8_scom5p3_out */
#define PA8_SCOM5P3_OUT        MCHP_PINMUX(a, 8, 0x26c, 15, periph)
/* pa8_tc0wo0g2_in */
#define PA8_TC0WO0G2_IN        MCHP_PINMUX(a, 8, 0xd0, 16, periph)
/* pa8_tc0wo0_out */
#define PA8_TC0WO0_OUT         MCHP_PINMUX(a, 8, 0x270, 24, periph)
/* pa8_tc0wo1g3_in */
#define PA8_TC0WO1G3_IN        MCHP_PINMUX(a, 8, 0xd4, 2, periph)
/* pa8_tc0wo1g4_in */
#define PA8_TC0WO1G4_IN        MCHP_PINMUX(a, 8, 0xd8, 23, periph)
/* pa8_tc0wo1_out */
#define PA8_TC0WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 24, periph)
/* pa8_tc1wo0_out */
#define PA8_TC1WO0_OUT         MCHP_PINMUX(a, 8, 0x270, 25, periph)
/* pa8_tc1wo1g2_in */
#define PA8_TC1WO1G2_IN        MCHP_PINMUX(a, 8, 0xe4, 16, periph)
/* pa8_tc1wo1_out */
#define PA8_TC1WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 25, periph)
/* pa8_tc2wo0g3_in */
#define PA8_TC2WO0G3_IN        MCHP_PINMUX(a, 8, 0xf0, 2, periph)
/* pa8_tc2wo0_out */
#define PA8_TC2WO0_OUT         MCHP_PINMUX(a, 8, 0x270, 26, periph)
/* pa8_tc2wo1g2_in */
#define PA8_TC2WO1G2_IN        MCHP_PINMUX(a, 8, 0xf4, 16, periph)
/* pa8_tc2wo1g4_in */
#define PA8_TC2WO1G4_IN        MCHP_PINMUX(a, 8, 0xf8, 23, periph)
/* pa8_tc2wo1_out */
#define PA8_TC2WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 26, periph)
/* pa8_tc3wo0g3_in */
#define PA8_TC3WO0G3_IN        MCHP_PINMUX(a, 8, 0x100, 2, periph)
/* pa8_tc3wo0_out */
#define PA8_TC3WO0_OUT         MCHP_PINMUX(a, 8, 0x270, 27, periph)
/* pa8_tc3wo1g2_in */
#define PA8_TC3WO1G2_IN        MCHP_PINMUX(a, 8, 0x104, 16, periph)
/* pa8_tc3wo1g4_in */
#define PA8_TC3WO1G4_IN        MCHP_PINMUX(a, 8, 0x108, 23, periph)
/* pa8_tc3wo1_out */
#define PA8_TC3WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 27, periph)
/* pa8_tc4wo0g3_in */
#define PA8_TC4WO0G3_IN        MCHP_PINMUX(a, 8, 0x110, 2, periph)
/* pa8_tc4wo0_out */
#define PA8_TC4WO0_OUT         MCHP_PINMUX(a, 8, 0x270, 28, periph)
/* pa8_tc4wo1g2_in */
#define PA8_TC4WO1G2_IN        MCHP_PINMUX(a, 8, 0x114, 16, periph)
/* pa8_tc4wo1g4_in */
#define PA8_TC4WO1G4_IN        MCHP_PINMUX(a, 8, 0x118, 23, periph)
/* pa8_tc4wo1_out */
#define PA8_TC4WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 28, periph)
/* pa8_tc5wo0g3_in */
#define PA8_TC5WO0G3_IN        MCHP_PINMUX(a, 8, 0x120, 2, periph)
/* pa8_tc5wo0_out */
#define PA8_TC5WO0_OUT         MCHP_PINMUX(a, 8, 0x270, 29, periph)
/* pa8_tc5wo1g2_in */
#define PA8_TC5WO1G2_IN        MCHP_PINMUX(a, 8, 0x124, 16, periph)
/* pa8_tc5wo1g4_in */
#define PA8_TC5WO1G4_IN        MCHP_PINMUX(a, 8, 0x128, 23, periph)
/* pa8_tc5wo1_out */
#define PA8_TC5WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 29, periph)
/* pa8_tc6wo0g3_in */
#define PA8_TC6WO0G3_IN        MCHP_PINMUX(a, 8, 0x130, 2, periph)
/* pa8_tc6wo0_out */
#define PA8_TC6WO0_OUT         MCHP_PINMUX(a, 8, 0x270, 30, periph)
/* pa8_tc6wo1g2_in */
#define PA8_TC6WO1G2_IN        MCHP_PINMUX(a, 8, 0x134, 16, periph)
/* pa8_tc6wo1g4_in */
#define PA8_TC6WO1G4_IN        MCHP_PINMUX(a, 8, 0x138, 23, periph)
/* pa8_tc6wo1_out */
#define PA8_TC6WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 30, periph)
/* pa8_tc7wo0g3_in */
#define PA8_TC7WO0G3_IN        MCHP_PINMUX(a, 8, 0x140, 2, periph)
/* pa8_tc7wo0_out */
#define PA8_TC7WO0_OUT         MCHP_PINMUX(a, 8, 0x270, 31, periph)
/* pa8_tc7wo1g2_in */
#define PA8_TC7WO1G2_IN        MCHP_PINMUX(a, 8, 0x144, 16, periph)
/* pa8_tc7wo1g4_in */
#define PA8_TC7WO1G4_IN        MCHP_PINMUX(a, 8, 0x148, 23, periph)
/* pa8_tc7wo1_out */
#define PA8_TC7WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 31, periph)
/* pa8_tc8wo0g3_in */
#define PA8_TC8WO0G3_IN        MCHP_PINMUX(a, 8, 0x150, 2, periph)
/* pa8_tc8wo0_out */
#define PA8_TC8WO0_OUT         MCHP_PINMUX(a, 8, 0x270, 32, periph)
/* pa8_tc8wo1g2_in */
#define PA8_TC8WO1G2_IN        MCHP_PINMUX(a, 8, 0x154, 16, periph)
/* pa8_tc8wo1_out */
#define PA8_TC8WO1_OUT         MCHP_PINMUX(a, 8, 0x26c, 32, periph)
/* pa8_tc9wo0g2_in */
#define PA8_TC9WO0G2_IN        MCHP_PINMUX(a, 8, 0x15c, 16, periph)
/* pa8_tc9wo0g4_in */
#define PA8_TC9WO0G4_IN        MCHP_PINMUX(a, 8, 0x160, 23, periph)
/* pa8_tc9wo0_out */
#define PA8_TC9WO0_OUT         MCHP_PINMUX(a, 8, 0x26c, 33, periph)
/* pa8_tc9wo1g3_in */
#define PA8_TC9WO1G3_IN        MCHP_PINMUX(a, 8, 0x164, 2, periph)
/* pa8_tc9wo1_out */
#define PA8_TC9WO1_OUT         MCHP_PINMUX(a, 8, 0x270, 33, periph)
/* pa8_tcc0wo0_out */
#define PA8_TCC0WO0_OUT        MCHP_PINMUX(a, 8, 0x270, 18, periph)
/* pa8_tcc0wo1_out */
#define PA8_TCC0WO1_OUT        MCHP_PINMUX(a, 8, 0x26c, 17, periph)
/* pa8_tcc0wo2_out */
#define PA8_TCC0WO2_OUT        MCHP_PINMUX(a, 8, 0x270, 17, periph)
/* pa8_tcc0wo3_out */
#define PA8_TCC0WO3_OUT        MCHP_PINMUX(a, 8, 0x26c, 19, periph)
/* pa8_tcc0wo4_out */
#define PA8_TCC0WO4_OUT        MCHP_PINMUX(a, 8, 0x270, 19, periph)
/* pa8_tcc0wo5_out */
#define PA8_TCC0WO5_OUT        MCHP_PINMUX(a, 8, 0x26c, 18, periph)
/* pa8_tcc1wo0_out */
#define PA8_TCC1WO0_OUT        MCHP_PINMUX(a, 8, 0x270, 21, periph)
/* pa8_tcc1wo1_out */
#define PA8_TCC1WO1_OUT        MCHP_PINMUX(a, 8, 0x26c, 20, periph)
/* pa8_tcc1wo2_out */
#define PA8_TCC1WO2_OUT        MCHP_PINMUX(a, 8, 0x270, 20, periph)
/* pa8_tcc1wo3_out */
#define PA8_TCC1WO3_OUT        MCHP_PINMUX(a, 8, 0x26c, 22, periph)
/* pa8_tcc1wo4_out */
#define PA8_TCC1WO4_OUT        MCHP_PINMUX(a, 8, 0x270, 22, periph)
/* pa8_tcc1wo5_out */
#define PA8_TCC1WO5_OUT        MCHP_PINMUX(a, 8, 0x26c, 21, periph)
/* pa8_tcc2wo0_out */
#define PA8_TCC2WO0_OUT        MCHP_PINMUX(a, 8, 0x270, 23, periph)
/* pa8_tcc2wo1_out */
#define PA8_TCC2WO1_OUT        MCHP_PINMUX(a, 8, 0x26c, 23, periph)
/* pa8_tstbus1_out */
#define PA8_TSTBUS1_OUT        MCHP_PINMUX(a, 8, 0x270, 38, periph)
/* pa8_tstbus2_out */
#define PA8_TSTBUS2_OUT        MCHP_PINMUX(a, 8, 0x274, 34, periph)
/* pa8_tstbus5_out */
#define PA8_TSTBUS5_OUT        MCHP_PINMUX(a, 8, 0x26c, 38, periph)
/* pa8_tstbus6_out */
#define PA8_TSTBUS6_OUT        MCHP_PINMUX(a, 8, 0x274, 35, periph)
/* pa8_tstbus9_out */
#define PA8_TSTBUS9_OUT        MCHP_PINMUX(a, 8, 0x26c, 39, periph)
/* pa8_tstbus10_out */
#define PA8_TSTBUS10_OUT       MCHP_PINMUX(a, 8, 0x270, 39, periph)
/* pa9_accmpten_in */
#define PA9_ACCMPTEN_IN        MCHP_PINMUX(a, 9, 0x18c, 25, periph)
/* pa9_ac_cmp0_out */
#define PA9_AC_CMP0_OUT        MCHP_PINMUX(a, 9, 0x27c, 40, periph)
/* pa9_ac_cmp1_out */
#define PA9_AC_CMP1_OUT        MCHP_PINMUX(a, 9, 0x280, 36, periph)
/* pa9_ac_cmptout_out */
#define PA9_AC_CMPTOUT_OUT     MCHP_PINMUX(a, 9, 0x280, 37, periph)
/* pa9_ac_cmptrdy_out */
#define PA9_AC_CMPTRDY_OUT     MCHP_PINMUX(a, 9, 0x27c, 41, periph)
/* pa9_can0rx_in */
#define PA9_CAN0RX_IN          MCHP_PINMUX(a, 9, NA, NA, gpio)
/* pa9_can1rx_in */
#define PA9_CAN1RX_IN          MCHP_PINMUX(a, 9, 0x190, 16, periph)
/* pa9_can1_tx_out */
#define PA9_CAN1_TX_OUT        MCHP_PINMUX(a, 9, 0x280, 38, periph)
/* pa9_cclin0_in */
#define PA9_CCLIN0_IN          MCHP_PINMUX(a, 9, 0xb4, 25, periph)
/* pa9_cclin2_in */
#define PA9_CCLIN2_IN          MCHP_PINMUX(a, 9, 0xbc, 16, periph)
/* pa9_cclin3_in */
#define PA9_CCLIN3_IN          MCHP_PINMUX(a, 9, 0xc0, 25, periph)
/* pa9_cclin5_in */
#define PA9_CCLIN5_IN          MCHP_PINMUX(a, 9, 0xc8, 16, periph)
/* pa9_cclo0_out */
#define PA9_CCLO0_OUT          MCHP_PINMUX(a, 9, 0x27c, 1, periph)
/* pa9_cclo1_out */
#define PA9_CCLO1_OUT          MCHP_PINMUX(a, 9, 0x280, 1, periph)
/* pa9_coexwlanact_in */
#define PA9_COEXWLANACT_IN     MCHP_PINMUX(a, 9, 0x194, 2, periph)
/* pa9_coex_bt_state_out */
#define PA9_COEX_BT_STATE_OUT  MCHP_PINMUX(a, 9, 0x278, 37, periph)
/* pa9_extint0_in */
#define PA9_EXTINT0_IN         MCHP_PINMUX(a, 9, 0x0, 25, periph)
/* pa9_extint2_in */
#define PA9_EXTINT2_IN         MCHP_PINMUX(a, 9, 0x8, 16, periph)
/* pa9_extint3_in */
#define PA9_EXTINT3_IN         MCHP_PINMUX(a, 9, 0xc, 2, periph)
/* pa9_fectrl1_out */
#define PA9_FECTRL1_OUT        MCHP_PINMUX(a, 9, 0x278, 35, periph)
/* pa9_fectrl2_out */
#define PA9_FECTRL2_OUT        MCHP_PINMUX(a, 9, 0x278, 36, periph)
/* pa9_fectrl3_out */
#define PA9_FECTRL3_OUT        MCHP_PINMUX(a, 9, 0x280, 39, periph)
/* pa9_fectrl4_out */
#define PA9_FECTRL4_OUT        MCHP_PINMUX(a, 9, 0x27c, 42, periph)
/* pa9_fectrl5_out */
#define PA9_FECTRL5_OUT        MCHP_PINMUX(a, 9, 0x280, 40, periph)
/* pa9_nmi_in */
#define PA9_NMI_IN             MCHP_PINMUX(a, 9, 0x3c, 2, periph)
/* pa9_qd0_in */
#define PA9_QD0_IN             MCHP_PINMUX(a, 9, 0xa0, 2, periph)
/* pa9_qd0_out */
#define PA9_QD0_OUT            MCHP_PINMUX(a, 9, 0x27c, 36, periph)
/* pa9_qd1_in */
#define PA9_QD1_IN             MCHP_PINMUX(a, 9, 0xa4, 25, periph)
/* pa9_qd1_out */
#define PA9_QD1_OUT            MCHP_PINMUX(a, 9, 0x278, 30, periph)
/* pa9_qd2_out */
#define PA9_QD2_OUT            MCHP_PINMUX(a, 9, 0x278, 29, periph)
/* pa9_qd3_in */
#define PA9_QD3_IN             MCHP_PINMUX(a, 9, 0xac, 16, periph)
/* pa9_qd3_out */
#define PA9_QD3_OUT            MCHP_PINMUX(a, 9, 0x278, 28, periph)
/* pa9_qeiccmp0_out */
#define PA9_QEICCMP0_OUT       MCHP_PINMUX(a, 9, 0x278, 31, periph)
/* pa9_qeihome0g1_in */
#define PA9_QEIHOME0G1_IN      MCHP_PINMUX(a, 9, 0x16c, 25, periph)
/* pa9_qeiindx0g3_in */
#define PA9_QEIINDX0G3_IN      MCHP_PINMUX(a, 9, 0x178, 16, periph)
/* pa9_qeiqea0g3_in */
#define PA9_QEIQEA0G3_IN       MCHP_PINMUX(a, 9, 0x17c, 16, periph)
/* pa9_qeiqea0g4_in */
#define PA9_QEIQEA0G4_IN       MCHP_PINMUX(a, 9, 0x180, 2, periph)
/* pa9_qeiqeb0g4_in */
#define PA9_QEIQEB0G4_IN       MCHP_PINMUX(a, 9, 0x184, 2, periph)
/* pa9_qspics_out */
#define PA9_QSPICS_OUT         MCHP_PINMUX(a, 9, 0x278, 27, periph)
/* pa9_scom0p0_out */
#define PA9_SCOM0P0_OUT        MCHP_PINMUX(a, 9, 0x27c, 2, periph)
/* pa9_scom0p2_in */
#define PA9_SCOM0P2_IN         MCHP_PINMUX(a, 9, 0x48, 2, periph)
/* pa9_scom0p2_out */
#define PA9_SCOM0P2_OUT        MCHP_PINMUX(a, 9, 0x278, 2, periph)
/* pa9_scom0p3_in */
#define PA9_SCOM0P3_IN         MCHP_PINMUX(a, 9, 0x4c, 25, periph)
/* pa9_scom0p3_out */
#define PA9_SCOM0P3_OUT        MCHP_PINMUX(a, 9, 0x278, 1, periph)
/* pa9_scom1p0_in */
#define PA9_SCOM1P0_IN         MCHP_PINMUX(a, 9, 0x50, 16, periph)
/* pa9_scom1p0_out */
#define PA9_SCOM1P0_OUT        MCHP_PINMUX(a, 9, 0x278, 3, periph)
/* pa9_scom1p2_in */
#define PA9_SCOM1P2_IN         MCHP_PINMUX(a, 9, 0x58, 25, periph)
/* pa9_scom1p2_out */
#define PA9_SCOM1P2_OUT        MCHP_PINMUX(a, 9, 0x278, 4, periph)
/* pa9_scom1p3_out */
#define PA9_SCOM1P3_OUT        MCHP_PINMUX(a, 9, 0x27c, 6, periph)
/* pa9_scom2p0_out */
#define PA9_SCOM2P0_OUT        MCHP_PINMUX(a, 9, 0x27c, 7, periph)
/* pa9_scom2p2_in */
#define PA9_SCOM2P2_IN         MCHP_PINMUX(a, 9, 0x68, 2, periph)
/* pa9_scom2p2_out */
#define PA9_SCOM2P2_OUT        MCHP_PINMUX(a, 9, 0x278, 6, periph)
/* pa9_scom2p3_in */
#define PA9_SCOM2P3_IN         MCHP_PINMUX(a, 9, 0x6c, 25, periph)
/* pa9_scom2p3_out */
#define PA9_SCOM2P3_OUT        MCHP_PINMUX(a, 9, 0x278, 5, periph)
/* pa9_scom3p0_in */
#define PA9_SCOM3P0_IN         MCHP_PINMUX(a, 9, 0x70, 16, periph)
/* pa9_scom3p0_out */
#define PA9_SCOM3P0_OUT        MCHP_PINMUX(a, 9, 0x278, 7, periph)
/* pa9_scom3p2_in */
#define PA9_SCOM3P2_IN         MCHP_PINMUX(a, 9, 0x78, 25, periph)
/* pa9_scom3p2_out */
#define PA9_SCOM3P2_OUT        MCHP_PINMUX(a, 9, 0x278, 8, periph)
/* pa9_scom3p3_out */
#define PA9_SCOM3P3_OUT        MCHP_PINMUX(a, 9, 0x27c, 11, periph)
/* pa9_scom4p0_out */
#define PA9_SCOM4P0_OUT        MCHP_PINMUX(a, 9, 0x27c, 12, periph)
/* pa9_scom4p2_in */
#define PA9_SCOM4P2_IN         MCHP_PINMUX(a, 9, 0x88, 2, periph)
/* pa9_scom4p2_out */
#define PA9_SCOM4P2_OUT        MCHP_PINMUX(a, 9, 0x278, 10, periph)
/* pa9_scom4p3_in */
#define PA9_SCOM4P3_IN         MCHP_PINMUX(a, 9, 0x8c, 25, periph)
/* pa9_scom4p3_out */
#define PA9_SCOM4P3_OUT        MCHP_PINMUX(a, 9, 0x278, 9, periph)
/* pa9_scom5p0_in */
#define PA9_SCOM5P0_IN         MCHP_PINMUX(a, 9, 0x90, 16, periph)
/* pa9_scom5p0_out */
#define PA9_SCOM5P0_OUT        MCHP_PINMUX(a, 9, 0x278, 11, periph)
/* pa9_scom5p2_in */
#define PA9_SCOM5P2_IN         MCHP_PINMUX(a, 9, 0x98, 25, periph)
/* pa9_scom5p2_out */
#define PA9_SCOM5P2_OUT        MCHP_PINMUX(a, 9, 0x278, 12, periph)
/* pa9_scom5p3_out */
#define PA9_SCOM5P3_OUT        MCHP_PINMUX(a, 9, 0x27c, 16, periph)
/* pa9_tc0wo0g1_in */
#define PA9_TC0WO0G1_IN        MCHP_PINMUX(a, 9, 0xcc, 25, periph)
/* pa9_tc0wo0_out */
#define PA9_TC0WO0_OUT         MCHP_PINMUX(a, 9, 0x27c, 24, periph)
/* pa9_tc0wo1g3_in */
#define PA9_TC0WO1G3_IN        MCHP_PINMUX(a, 9, 0xd4, 16, periph)
/* pa9_tc0wo1g4_in */
#define PA9_TC0WO1G4_IN        MCHP_PINMUX(a, 9, 0xd8, 2, periph)
/* pa9_tc0wo1_out */
#define PA9_TC0WO1_OUT         MCHP_PINMUX(a, 9, 0x278, 18, periph)
/* pa9_tc1wo0g1_in */
#define PA9_TC1WO0G1_IN        MCHP_PINMUX(a, 9, 0xdc, 25, periph)
/* pa9_tc1wo0_out */
#define PA9_TC1WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 19, periph)
/* pa9_tc1wo1_out */
#define PA9_TC1WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 22, periph)
/* pa9_tc2wo0g1_in */
#define PA9_TC2WO0G1_IN        MCHP_PINMUX(a, 9, 0xec, 25, periph)
/* pa9_tc2wo0g3_in */
#define PA9_TC2WO0G3_IN        MCHP_PINMUX(a, 9, 0xf0, 16, periph)
/* pa9_tc2wo0_out */
#define PA9_TC2WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 20, periph)
/* pa9_tc2wo1g4_in */
#define PA9_TC2WO1G4_IN        MCHP_PINMUX(a, 9, 0xf8, 2, periph)
/* pa9_tc2wo1_out */
#define PA9_TC2WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 23, periph)
/* pa9_tc3wo0g1_in */
#define PA9_TC3WO0G1_IN        MCHP_PINMUX(a, 9, 0xfc, 25, periph)
/* pa9_tc3wo0g3_in */
#define PA9_TC3WO0G3_IN        MCHP_PINMUX(a, 9, 0x100, 16, periph)
/* pa9_tc3wo0_out */
#define PA9_TC3WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 21, periph)
/* pa9_tc3wo1g4_in */
#define PA9_TC3WO1G4_IN        MCHP_PINMUX(a, 9, 0x108, 2, periph)
/* pa9_tc3wo1_out */
#define PA9_TC3WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 24, periph)
/* pa9_tc4wo0g1_in */
#define PA9_TC4WO0G1_IN        MCHP_PINMUX(a, 9, 0x10c, 25, periph)
/* pa9_tc4wo0g3_in */
#define PA9_TC4WO0G3_IN        MCHP_PINMUX(a, 9, 0x110, 16, periph)
/* pa9_tc4wo0_out */
#define PA9_TC4WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 22, periph)
/* pa9_tc4wo1g4_in */
#define PA9_TC4WO1G4_IN        MCHP_PINMUX(a, 9, 0x118, 2, periph)
/* pa9_tc4wo1_out */
#define PA9_TC4WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 25, periph)
/* pa9_tc5wo0g1_in */
#define PA9_TC5WO0G1_IN        MCHP_PINMUX(a, 9, 0x11c, 25, periph)
/* pa9_tc5wo0g3_in */
#define PA9_TC5WO0G3_IN        MCHP_PINMUX(a, 9, 0x120, 16, periph)
/* pa9_tc5wo0_out */
#define PA9_TC5WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 23, periph)
/* pa9_tc5wo1g4_in */
#define PA9_TC5WO1G4_IN        MCHP_PINMUX(a, 9, 0x128, 2, periph)
/* pa9_tc5wo1_out */
#define PA9_TC5WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 26, periph)
/* pa9_tc6wo0g1_in */
#define PA9_TC6WO0G1_IN        MCHP_PINMUX(a, 9, 0x12c, 25, periph)
/* pa9_tc6wo0g3_in */
#define PA9_TC6WO0G3_IN        MCHP_PINMUX(a, 9, 0x130, 16, periph)
/* pa9_tc6wo0_out */
#define PA9_TC6WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 24, periph)
/* pa9_tc6wo1g4_in */
#define PA9_TC6WO1G4_IN        MCHP_PINMUX(a, 9, 0x138, 2, periph)
/* pa9_tc6wo1_out */
#define PA9_TC6WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 27, periph)
/* pa9_tc7wo0g1_in */
#define PA9_TC7WO0G1_IN        MCHP_PINMUX(a, 9, 0x13c, 25, periph)
/* pa9_tc7wo0g3_in */
#define PA9_TC7WO0G3_IN        MCHP_PINMUX(a, 9, 0x140, 16, periph)
/* pa9_tc7wo0_out */
#define PA9_TC7WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 25, periph)
/* pa9_tc7wo1g4_in */
#define PA9_TC7WO1G4_IN        MCHP_PINMUX(a, 9, 0x148, 2, periph)
/* pa9_tc7wo1_out */
#define PA9_TC7WO1_OUT         MCHP_PINMUX(a, 9, 0x280, 28, periph)
/* pa9_tc8wo0g1_in */
#define PA9_TC8WO0G1_IN        MCHP_PINMUX(a, 9, 0x14c, 25, periph)
/* pa9_tc8wo0g3_in */
#define PA9_TC8WO0G3_IN        MCHP_PINMUX(a, 9, 0x150, 16, periph)
/* pa9_tc8wo0_out */
#define PA9_TC8WO0_OUT         MCHP_PINMUX(a, 9, 0x278, 26, periph)
/* pa9_tc9wo0g4_in */
#define PA9_TC9WO0G4_IN        MCHP_PINMUX(a, 9, 0x160, 2, periph)
/* pa9_tc9wo0_out */
#define PA9_TC9WO0_OUT         MCHP_PINMUX(a, 9, 0x280, 29, periph)
/* pa9_tc9wo1g3_in */
#define PA9_TC9WO1G3_IN        MCHP_PINMUX(a, 9, 0x164, 16, periph)
/* pa9_tc9wo1_out */
#define PA9_TC9WO1_OUT         MCHP_PINMUX(a, 9, 0x27c, 33, periph)
/* pa9_tcc0wo0_out */
#define PA9_TCC0WO0_OUT        MCHP_PINMUX(a, 9, 0x278, 13, periph)
/* pa9_tcc0wo1_out */
#define PA9_TCC0WO1_OUT        MCHP_PINMUX(a, 9, 0x280, 15, periph)
/* pa9_tcc0wo2_out */
#define PA9_TCC0WO2_OUT        MCHP_PINMUX(a, 9, 0x27c, 17, periph)
/* pa9_tcc0wo3_out */
#define PA9_TCC0WO3_OUT        MCHP_PINMUX(a, 9, 0x280, 14, periph)
/* pa9_tcc0wo4_out */
#define PA9_TCC0WO4_OUT        MCHP_PINMUX(a, 9, 0x278, 14, periph)
/* pa9_tcc0wo5_out */
#define PA9_TCC0WO5_OUT        MCHP_PINMUX(a, 9, 0x280, 16, periph)
/* pa9_tcc1wo0_out */
#define PA9_TCC1WO0_OUT        MCHP_PINMUX(a, 9, 0x278, 15, periph)
/* pa9_tcc1wo1_out */
#define PA9_TCC1WO1_OUT        MCHP_PINMUX(a, 9, 0x280, 18, periph)
/* pa9_tcc1wo2_out */
#define PA9_TCC1WO2_OUT        MCHP_PINMUX(a, 9, 0x27c, 20, periph)
/* pa9_tcc1wo3_out */
#define PA9_TCC1WO3_OUT        MCHP_PINMUX(a, 9, 0x280, 17, periph)
/* pa9_tcc1wo4_out */
#define PA9_TCC1WO4_OUT        MCHP_PINMUX(a, 9, 0x278, 16, periph)
/* pa9_tcc1wo5_out */
#define PA9_TCC1WO5_OUT        MCHP_PINMUX(a, 9, 0x280, 19, periph)
/* pa9_tcc2wo0_out */
#define PA9_TCC2WO0_OUT        MCHP_PINMUX(a, 9, 0x278, 17, periph)
/* pa9_tcc2wo1_out */
#define PA9_TCC2WO1_OUT        MCHP_PINMUX(a, 9, 0x280, 20, periph)
/* pa9_tstbus0_out */
#define PA9_TSTBUS0_OUT        MCHP_PINMUX(a, 9, 0x278, 32, periph)
/* pa9_tstbus1_out */
#define PA9_TSTBUS1_OUT        MCHP_PINMUX(a, 9, 0x27c, 38, periph)
/* pa9_tstbus2_out */
#define PA9_TSTBUS2_OUT        MCHP_PINMUX(a, 9, 0x280, 34, periph)
/* pa9_tstbus4_out */
