zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62132-pinctrl.h
#define PA9_TSTBUS4_OUT        MCHP_PINMUX(a, 9, 0x278, 33, periph)
/* pa9_tstbus6_out */
#define PA9_TSTBUS6_OUT        MCHP_PINMUX(a, 9, 0x280, 35, periph)
/* pa9_tstbus8_out */
#define PA9_TSTBUS8_OUT        MCHP_PINMUX(a, 9, 0x278, 34, periph)
/* pa9_tstbus10_out */
#define PA9_TSTBUS10_OUT       MCHP_PINMUX(a, 9, 0x27c, 39, periph)
/* pa10_accmpten_in */
#define PA10_ACCMPTEN_IN       MCHP_PINMUX(a, 10, 0x18c, 21, periph)
/* pa10_ac_cmp1_out */
#define PA10_AC_CMP1_OUT       MCHP_PINMUX(a, 10, 0x288, 36, periph)
/* pa10_ac_cmptout_out */
#define PA10_AC_CMPTOUT_OUT    MCHP_PINMUX(a, 10, 0x288, 37, periph)
/* pa10_can1_tx_out */
#define PA10_CAN1_TX_OUT       MCHP_PINMUX(a, 10, 0x288, 38, periph)
/* pa10_cclin0_in */
#define PA10_CCLIN0_IN         MCHP_PINMUX(a, 10, 0xb4, 21, periph)
/* pa10_cclin3_in */
#define PA10_CCLIN3_IN         MCHP_PINMUX(a, 10, 0xc0, 21, periph)
/* pa10_cclo0_out */
#define PA10_CCLO0_OUT         MCHP_PINMUX(a, 10, 0x28c, 1, periph)
/* pa10_cclo1_out */
#define PA10_CCLO1_OUT         MCHP_PINMUX(a, 10, 0x288, 1, periph)
/* pa10_coexwlanact_in */
#define PA10_COEXWLANACT_IN    MCHP_PINMUX(a, 10, 0x194, 14, periph)
/* pa10_coex_bt_state_out */
#define PA10_COEX_BT_STATE_OUT MCHP_PINMUX(a, 10, 0x284, 37, periph)
/* pa10_extint0_in */
#define PA10_EXTINT0_IN        MCHP_PINMUX(a, 10, 0x0, 21, periph)
/* pa10_extint3_in */
#define PA10_EXTINT3_IN        MCHP_PINMUX(a, 10, 0xc, 14, periph)
/* pa10_fectrl1_out */
#define PA10_FECTRL1_OUT       MCHP_PINMUX(a, 10, 0x284, 35, periph)
/* pa10_fectrl2_out */
#define PA10_FECTRL2_OUT       MCHP_PINMUX(a, 10, 0x284, 36, periph)
/* pa10_fectrl3_out */
#define PA10_FECTRL3_OUT       MCHP_PINMUX(a, 10, 0x288, 39, periph)
/* pa10_fectrl5_out */
#define PA10_FECTRL5_OUT       MCHP_PINMUX(a, 10, 0x288, 40, periph)
/* pa10_gmac_tsucomp_out */
#define PA10_GMAC_TSUCOMP_OUT  MCHP_PINMUX(a, 10, 0x28c, 14, periph)
/* pa10_nmi_in */
#define PA10_NMI_IN            MCHP_PINMUX(a, 10, 0x3c, 14, periph)
/* pa10_qd0_in */
#define PA10_QD0_IN            MCHP_PINMUX(a, 10, 0xa0, 14, periph)
/* pa10_qd0_out */
#define PA10_QD0_OUT           MCHP_PINMUX(a, 10, 0x288, 33, periph)
/* pa10_qd1_in */
#define PA10_QD1_IN            MCHP_PINMUX(a, 10, 0xa4, 21, periph)
/* pa10_qd1_out */
#define PA10_QD1_OUT           MCHP_PINMUX(a, 10, 0x284, 30, periph)
/* pa10_qd2_out */
#define PA10_QD2_OUT           MCHP_PINMUX(a, 10, 0x284, 29, periph)
/* pa10_qd3_out */
#define PA10_QD3_OUT           MCHP_PINMUX(a, 10, 0x284, 28, periph)
/* pa10_qeiccmp0_out */
#define PA10_QEICCMP0_OUT      MCHP_PINMUX(a, 10, 0x284, 31, periph)
/* pa10_qeihome0g1_in */
#define PA10_QEIHOME0G1_IN     MCHP_PINMUX(a, 10, 0x16c, 21, periph)
/* pa10_qeiqea0g4_in */
#define PA10_QEIQEA0G4_IN      MCHP_PINMUX(a, 10, 0x180, 14, periph)
/* pa10_qeiqeb0g4_in */
#define PA10_QEIQEB0G4_IN      MCHP_PINMUX(a, 10, 0x184, 14, periph)
/* pa10_qeiqeb0g5_in */
#define PA10_QEIQEB0G5_IN      MCHP_PINMUX(a, 10, 0x188, 2, periph)
/* pa10_qspics_out */
#define PA10_QSPICS_OUT        MCHP_PINMUX(a, 10, 0x284, 27, periph)
/* pa10_scom0p0_out */
#define PA10_SCOM0P0_OUT       MCHP_PINMUX(a, 10, 0x288, 3, periph)
/* pa10_scom0p2_in */
#define PA10_SCOM0P2_IN        MCHP_PINMUX(a, 10, 0x48, 14, periph)
/* pa10_scom0p2_out */
#define PA10_SCOM0P2_OUT       MCHP_PINMUX(a, 10, 0x284, 2, periph)
/* pa10_scom0p3_in */
#define PA10_SCOM0P3_IN        MCHP_PINMUX(a, 10, 0x4c, 21, periph)
/* pa10_scom0p3_out */
#define PA10_SCOM0P3_OUT       MCHP_PINMUX(a, 10, 0x284, 1, periph)
/* pa10_scom1p0_out */
#define PA10_SCOM1P0_OUT       MCHP_PINMUX(a, 10, 0x284, 3, periph)
/* pa10_scom1p2_in */
#define PA10_SCOM1P2_IN        MCHP_PINMUX(a, 10, 0x58, 21, periph)
/* pa10_scom1p2_out */
#define PA10_SCOM1P2_OUT       MCHP_PINMUX(a, 10, 0x284, 4, periph)
/* pa10_scom1p3_out */
#define PA10_SCOM1P3_OUT       MCHP_PINMUX(a, 10, 0x288, 4, periph)
/* pa10_scom2p0_out */
#define PA10_SCOM2P0_OUT       MCHP_PINMUX(a, 10, 0x288, 7, periph)
/* pa10_scom2p2_in */
#define PA10_SCOM2P2_IN        MCHP_PINMUX(a, 10, 0x68, 14, periph)
/* pa10_scom2p2_out */
#define PA10_SCOM2P2_OUT       MCHP_PINMUX(a, 10, 0x284, 6, periph)
/* pa10_scom2p3_in */
#define PA10_SCOM2P3_IN        MCHP_PINMUX(a, 10, 0x6c, 21, periph)
/* pa10_scom2p3_out */
#define PA10_SCOM2P3_OUT       MCHP_PINMUX(a, 10, 0x284, 5, periph)
/* pa10_scom3p0_out */
#define PA10_SCOM3P0_OUT       MCHP_PINMUX(a, 10, 0x284, 7, periph)
/* pa10_scom3p2_in */
#define PA10_SCOM3P2_IN        MCHP_PINMUX(a, 10, 0x78, 21, periph)
/* pa10_scom3p2_out */
#define PA10_SCOM3P2_OUT       MCHP_PINMUX(a, 10, 0x284, 8, periph)
/* pa10_scom3p3_out */
#define PA10_SCOM3P3_OUT       MCHP_PINMUX(a, 10, 0x288, 8, periph)
/* pa10_scom4p0_out */
#define PA10_SCOM4P0_OUT       MCHP_PINMUX(a, 10, 0x288, 11, periph)
/* pa10_scom4p2_in */
#define PA10_SCOM4P2_IN        MCHP_PINMUX(a, 10, 0x88, 14, periph)
/* pa10_scom4p2_out */
#define PA10_SCOM4P2_OUT       MCHP_PINMUX(a, 10, 0x284, 10, periph)
/* pa10_scom4p3_in */
#define PA10_SCOM4P3_IN        MCHP_PINMUX(a, 10, 0x8c, 21, periph)
/* pa10_scom4p3_out */
#define PA10_SCOM4P3_OUT       MCHP_PINMUX(a, 10, 0x284, 9, periph)
/* pa10_scom5p0_out */
#define PA10_SCOM5P0_OUT       MCHP_PINMUX(a, 10, 0x284, 11, periph)
/* pa10_scom5p2_in */
#define PA10_SCOM5P2_IN        MCHP_PINMUX(a, 10, 0x98, 21, periph)
/* pa10_scom5p2_out */
#define PA10_SCOM5P2_OUT       MCHP_PINMUX(a, 10, 0x284, 12, periph)
/* pa10_scom5p3_out */
#define PA10_SCOM5P3_OUT       MCHP_PINMUX(a, 10, 0x288, 12, periph)
/* pa10_tc0wo0g1_in */
#define PA10_TC0WO0G1_IN       MCHP_PINMUX(a, 10, 0xcc, 21, periph)
/* pa10_tc0wo0_out */
#define PA10_TC0WO0_OUT        MCHP_PINMUX(a, 10, 0x288, 21, periph)
/* pa10_tc0wo1g4_in */
#define PA10_TC0WO1G4_IN       MCHP_PINMUX(a, 10, 0xd8, 14, periph)
/* pa10_tc0wo1_out */
#define PA10_TC0WO1_OUT        MCHP_PINMUX(a, 10, 0x284, 18, periph)
/* pa10_tc1wo0g1_in */
#define PA10_TC1WO0G1_IN       MCHP_PINMUX(a, 10, 0xdc, 21, periph)
/* pa10_tc1wo0_out */
#define PA10_TC1WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 19, periph)
/* pa10_tc1wo1_out */
#define PA10_TC1WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 22, periph)
/* pa10_tc2wo0g1_in */
#define PA10_TC2WO0G1_IN       MCHP_PINMUX(a, 10, 0xec, 21, periph)
/* pa10_tc2wo0_out */
#define PA10_TC2WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 20, periph)
/* pa10_tc2wo1g4_in */
#define PA10_TC2WO1G4_IN       MCHP_PINMUX(a, 10, 0xf8, 14, periph)
/* pa10_tc2wo1_out */
#define PA10_TC2WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 23, periph)
/* pa10_tc3wo0g1_in */
#define PA10_TC3WO0G1_IN       MCHP_PINMUX(a, 10, 0xfc, 21, periph)
/* pa10_tc3wo0_out */
#define PA10_TC3WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 21, periph)
/* pa10_tc3wo1g4_in */
#define PA10_TC3WO1G4_IN       MCHP_PINMUX(a, 10, 0x108, 14, periph)
/* pa10_tc3wo1_out */
#define PA10_TC3WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 24, periph)
/* pa10_tc4wo0g1_in */
#define PA10_TC4WO0G1_IN       MCHP_PINMUX(a, 10, 0x10c, 21, periph)
/* pa10_tc4wo0_out */
#define PA10_TC4WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 22, periph)
/* pa10_tc4wo1g4_in */
#define PA10_TC4WO1G4_IN       MCHP_PINMUX(a, 10, 0x118, 14, periph)
/* pa10_tc4wo1_out */
#define PA10_TC4WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 25, periph)
/* pa10_tc5wo0g1_in */
#define PA10_TC5WO0G1_IN       MCHP_PINMUX(a, 10, 0x11c, 21, periph)
/* pa10_tc5wo0_out */
#define PA10_TC5WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 23, periph)
/* pa10_tc5wo1g4_in */
#define PA10_TC5WO1G4_IN       MCHP_PINMUX(a, 10, 0x128, 14, periph)
/* pa10_tc5wo1_out */
#define PA10_TC5WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 26, periph)
/* pa10_tc6wo0g1_in */
#define PA10_TC6WO0G1_IN       MCHP_PINMUX(a, 10, 0x12c, 21, periph)
/* pa10_tc6wo0_out */
#define PA10_TC6WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 24, periph)
/* pa10_tc6wo1g4_in */
#define PA10_TC6WO1G4_IN       MCHP_PINMUX(a, 10, 0x138, 14, periph)
/* pa10_tc6wo1_out */
#define PA10_TC6WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 27, periph)
/* pa10_tc7wo0g1_in */
#define PA10_TC7WO0G1_IN       MCHP_PINMUX(a, 10, 0x13c, 21, periph)
/* pa10_tc7wo0_out */
#define PA10_TC7WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 25, periph)
/* pa10_tc7wo1g4_in */
#define PA10_TC7WO1G4_IN       MCHP_PINMUX(a, 10, 0x148, 14, periph)
/* pa10_tc7wo1_out */
#define PA10_TC7WO1_OUT        MCHP_PINMUX(a, 10, 0x288, 28, periph)
/* pa10_tc8wo0g1_in */
#define PA10_TC8WO0G1_IN       MCHP_PINMUX(a, 10, 0x14c, 21, periph)
/* pa10_tc8wo0_out */
#define PA10_TC8WO0_OUT        MCHP_PINMUX(a, 10, 0x284, 26, periph)
/* pa10_tc8wo1g5_in */
#define PA10_TC8WO1G5_IN       MCHP_PINMUX(a, 10, 0x158, 2, periph)
/* pa10_tc8wo1_out */
#define PA10_TC8WO1_OUT        MCHP_PINMUX(a, 10, 0x28c, 10, periph)
/* pa10_tc9wo0g4_in */
#define PA10_TC9WO0G4_IN       MCHP_PINMUX(a, 10, 0x160, 14, periph)
/* pa10_tc9wo0_out */
#define PA10_TC9WO0_OUT        MCHP_PINMUX(a, 10, 0x288, 29, periph)
/* pa10_tc9wo1g5_in */
#define PA10_TC9WO1G5_IN       MCHP_PINMUX(a, 10, 0x168, 2, periph)
/* pa10_tc9wo1_out */
#define PA10_TC9WO1_OUT        MCHP_PINMUX(a, 10, 0x28c, 11, periph)
/* pa10_tcc0wo0_out */
#define PA10_TCC0WO0_OUT       MCHP_PINMUX(a, 10, 0x284, 13, periph)
/* pa10_tcc0wo1_out */
#define PA10_TCC0WO1_OUT       MCHP_PINMUX(a, 10, 0x288, 15, periph)
/* pa10_tcc0wo2_out */
#define PA10_TCC0WO2_OUT       MCHP_PINMUX(a, 10, 0x28c, 5, periph)
/* pa10_tcc0wo3_out */
#define PA10_TCC0WO3_OUT       MCHP_PINMUX(a, 10, 0x288, 14, periph)
/* pa10_tcc0wo4_out */
#define PA10_TCC0WO4_OUT       MCHP_PINMUX(a, 10, 0x284, 14, periph)
/* pa10_tcc0wo5_out */
#define PA10_TCC0WO5_OUT       MCHP_PINMUX(a, 10, 0x288, 16, periph)
/* pa10_tcc1wo0_out */
#define PA10_TCC1WO0_OUT       MCHP_PINMUX(a, 10, 0x284, 15, periph)
/* pa10_tcc1wo1_out */
#define PA10_TCC1WO1_OUT       MCHP_PINMUX(a, 10, 0x288, 18, periph)
/* pa10_tcc1wo2_out */
#define PA10_TCC1WO2_OUT       MCHP_PINMUX(a, 10, 0x28c, 8, periph)
/* pa10_tcc1wo3_out */
#define PA10_TCC1WO3_OUT       MCHP_PINMUX(a, 10, 0x288, 17, periph)
/* pa10_tcc1wo4_out */
#define PA10_TCC1WO4_OUT       MCHP_PINMUX(a, 10, 0x284, 16, periph)
/* pa10_tcc1wo5_out */
#define PA10_TCC1WO5_OUT       MCHP_PINMUX(a, 10, 0x288, 19, periph)
/* pa10_tcc2wo0_out */
#define PA10_TCC2WO0_OUT       MCHP_PINMUX(a, 10, 0x284, 17, periph)
/* pa10_tcc2wo1_out */
#define PA10_TCC2WO1_OUT       MCHP_PINMUX(a, 10, 0x288, 20, periph)
/* pa10_tstbus0_out */
#define PA10_TSTBUS0_OUT       MCHP_PINMUX(a, 10, 0x284, 32, periph)
/* pa10_tstbus2_out */
#define PA10_TSTBUS2_OUT       MCHP_PINMUX(a, 10, 0x288, 34, periph)
/* pa10_tstbus3_out */
#define PA10_TSTBUS3_OUT       MCHP_PINMUX(a, 10, 0x28c, 15, periph)
/* pa10_tstbus4_out */
#define PA10_TSTBUS4_OUT       MCHP_PINMUX(a, 10, 0x284, 33, periph)
/* pa10_tstbus6_out */
#define PA10_TSTBUS6_OUT       MCHP_PINMUX(a, 10, 0x288, 35, periph)
/* pa10_tstbus7_out */
#define PA10_TSTBUS7_OUT       MCHP_PINMUX(a, 10, 0x28c, 16, periph)
/* pa10_tstbus8_out */
#define PA10_TSTBUS8_OUT       MCHP_PINMUX(a, 10, 0x284, 34, periph)
/* pa10_tstbus11_out */
#define PA10_TSTBUS11_OUT      MCHP_PINMUX(a, 10, 0x28c, 17, periph)
/* pa11_accmpten_in */
#define PA11_ACCMPTEN_IN       MCHP_PINMUX(a, 11, 0x18c, 3, periph)
/* pa11_cclin0_in */
#define PA11_CCLIN0_IN         MCHP_PINMUX(a, 11, 0xb4, 3, periph)
/* pa11_cclin1_in */
#define PA11_CCLIN1_IN         MCHP_PINMUX(a, 11, 0xb8, 25, periph)
/* pa11_cclin3_in */
#define PA11_CCLIN3_IN         MCHP_PINMUX(a, 11, 0xc0, 3, periph)
/* pa11_cclin4_in */
#define PA11_CCLIN4_IN         MCHP_PINMUX(a, 11, 0xc4, 25, periph)
/* pa11_extint0_in */
#define PA11_EXTINT0_IN        MCHP_PINMUX(a, 11, 0x0, 3, periph)
/* pa11_extint1_in */
#define PA11_EXTINT1_IN        MCHP_PINMUX(a, 11, 0x4, 25, periph)
/* pa11_qd1_in */
#define PA11_QD1_IN            MCHP_PINMUX(a, 11, 0xa4, 3, periph)
/* pa11_qd2_in */
#define PA11_QD2_IN            MCHP_PINMUX(a, 11, 0xa8, 25, periph)
/* pa11_qeihome0g1_in */
#define PA11_QEIHOME0G1_IN     MCHP_PINMUX(a, 11, 0x16c, 3, periph)
/* pa11_qeihome0g2_in */
#define PA11_QEIHOME0G2_IN     MCHP_PINMUX(a, 11, 0x170, 25, periph)
/* pa11_qeiindx0g2_in */
#define PA11_QEIINDX0G2_IN     MCHP_PINMUX(a, 11, 0x174, 25, periph)
/* pa11_scom0p0_in */
#define PA11_SCOM0P0_IN        MCHP_PINMUX(a, 11, 0x40, 25, periph)
/* pa11_scom0p3_in */
#define PA11_SCOM0P3_IN        MCHP_PINMUX(a, 11, 0x4c, 3, periph)
/* pa11_scom1p2_in */
#define PA11_SCOM1P2_IN        MCHP_PINMUX(a, 11, 0x58, 3, periph)
/* pa11_scom1p3_in */
#define PA11_SCOM1P3_IN        MCHP_PINMUX(a, 11, 0x5c, 25, periph)
/* pa11_scom2p0_in */
#define PA11_SCOM2P0_IN        MCHP_PINMUX(a, 11, 0x60, 25, periph)
/* pa11_scom2p3_in */
#define PA11_SCOM2P3_IN        MCHP_PINMUX(a, 11, 0x6c, 3, periph)
/* pa11_scom3p2_in */
#define PA11_SCOM3P2_IN        MCHP_PINMUX(a, 11, 0x78, 3, periph)
/* pa11_scom3p3_in */
#define PA11_SCOM3P3_IN        MCHP_PINMUX(a, 11, 0x7c, 25, periph)
/* pa11_scom4p0_in */
#define PA11_SCOM4P0_IN        MCHP_PINMUX(a, 11, 0x80, 25, periph)
/* pa11_scom4p3_in */
#define PA11_SCOM4P3_IN        MCHP_PINMUX(a, 11, 0x8c, 3, periph)
/* pa11_scom5p2_in */
#define PA11_SCOM5P2_IN        MCHP_PINMUX(a, 11, 0x98, 3, periph)
/* pa11_scom5p3_in */
#define PA11_SCOM5P3_IN        MCHP_PINMUX(a, 11, 0x9c, 25, periph)
/* pa11_tc0wo0g1_in */
#define PA11_TC0WO0G1_IN       MCHP_PINMUX(a, 11, 0xcc, 3, periph)
/* pa11_tc0wo0g2_in */
#define PA11_TC0WO0G2_IN       MCHP_PINMUX(a, 11, 0xd0, 25, periph)
/* pa11_tc1wo0g1_in */
#define PA11_TC1WO0G1_IN       MCHP_PINMUX(a, 11, 0xdc, 3, periph)
/* pa11_tc1wo1g2_in */
#define PA11_TC1WO1G2_IN       MCHP_PINMUX(a, 11, 0xe4, 25, periph)
/* pa11_tc2wo0g1_in */
#define PA11_TC2WO0G1_IN       MCHP_PINMUX(a, 11, 0xec, 3, periph)
/* pa11_tc2wo1g2_in */
#define PA11_TC2WO1G2_IN       MCHP_PINMUX(a, 11, 0xf4, 25, periph)
/* pa11_tc3wo0g1_in */
#define PA11_TC3WO0G1_IN       MCHP_PINMUX(a, 11, 0xfc, 3, periph)
/* pa11_tc3wo1g2_in */
#define PA11_TC3WO1G2_IN       MCHP_PINMUX(a, 11, 0x104, 25, periph)
/* pa11_tc4wo0g1_in */
#define PA11_TC4WO0G1_IN       MCHP_PINMUX(a, 11, 0x10c, 3, periph)
/* pa11_tc4wo1g2_in */
#define PA11_TC4WO1G2_IN       MCHP_PINMUX(a, 11, 0x114, 25, periph)
/* pa11_tc5wo0g1_in */
#define PA11_TC5WO0G1_IN       MCHP_PINMUX(a, 11, 0x11c, 3, periph)
/* pa11_tc5wo1g2_in */
#define PA11_TC5WO1G2_IN       MCHP_PINMUX(a, 11, 0x124, 25, periph)
/* pa11_tc6wo0g1_in */
#define PA11_TC6WO0G1_IN       MCHP_PINMUX(a, 11, 0x12c, 3, periph)
/* pa11_tc6wo1g2_in */
#define PA11_TC6WO1G2_IN       MCHP_PINMUX(a, 11, 0x134, 25, periph)
/* pa11_tc7wo0g1_in */
#define PA11_TC7WO0G1_IN       MCHP_PINMUX(a, 11, 0x13c, 3, periph)
/* pa11_tc7wo1g2_in */
#define PA11_TC7WO1G2_IN       MCHP_PINMUX(a, 11, 0x144, 25, periph)
/* pa11_tc8wo0g1_in */
#define PA11_TC8WO0G1_IN       MCHP_PINMUX(a, 11, 0x14c, 3, periph)
/* pa11_tc8wo1g2_in */
#define PA11_TC8WO1G2_IN       MCHP_PINMUX(a, 11, 0x154, 25, periph)
/* pa11_tc9wo0g2_in */
#define PA11_TC9WO0G2_IN       MCHP_PINMUX(a, 11, 0x15c, 25, periph)
/* pa12_can1rx_in */
#define PA12_CAN1RX_IN         MCHP_PINMUX(a, 12, 0x190, 24, periph)
/* pa12_cclin1_in */
#define PA12_CCLIN1_IN         MCHP_PINMUX(a, 12, 0xb8, 3, periph)
/* pa12_cclin2_in */
#define PA12_CCLIN2_IN         MCHP_PINMUX(a, 12, 0xbc, 24, periph)
/* pa12_cclin4_in */
#define PA12_CCLIN4_IN         MCHP_PINMUX(a, 12, 0xc4, 3, periph)
/* pa12_cclin5_in */
#define PA12_CCLIN5_IN         MCHP_PINMUX(a, 12, 0xc8, 24, periph)
/* pa12_extint1_in */
#define PA12_EXTINT1_IN        MCHP_PINMUX(a, 12, 0x4, 3, periph)
/* pa12_extint2_in */
#define PA12_EXTINT2_IN        MCHP_PINMUX(a, 12, 0x8, 24, periph)
/* pa12_qd2_in */
#define PA12_QD2_IN            MCHP_PINMUX(a, 12, 0xa8, 3, periph)
/* pa12_qd3_in */
#define PA12_QD3_IN            MCHP_PINMUX(a, 12, 0xac, 24, periph)
/* pa12_qeihome0g2_in */
#define PA12_QEIHOME0G2_IN     MCHP_PINMUX(a, 12, 0x170, 3, periph)
/* pa12_qeiindx0g2_in */
#define PA12_QEIINDX0G2_IN     MCHP_PINMUX(a, 12, 0x174, 3, periph)
/* pa12_qeiindx0g3_in */
#define PA12_QEIINDX0G3_IN     MCHP_PINMUX(a, 12, 0x178, 24, periph)
/* pa12_qeiqea0g3_in */
#define PA12_QEIQEA0G3_IN      MCHP_PINMUX(a, 12, 0x17c, 24, periph)
/* pa12_scom0p0_in */
#define PA12_SCOM0P0_IN        MCHP_PINMUX(a, 12, 0x40, 3, periph)
/* pa12_scom1p0_in */
#define PA12_SCOM1P0_IN        MCHP_PINMUX(a, 12, 0x50, 24, periph)
/* pa12_scom1p3_in */
#define PA12_SCOM1P3_IN        MCHP_PINMUX(a, 12, 0x5c, 3, periph)
/* pa12_scom2p0_in */
#define PA12_SCOM2P0_IN        MCHP_PINMUX(a, 12, 0x60, 3, periph)
/* pa12_scom3p0_in */
#define PA12_SCOM3P0_IN        MCHP_PINMUX(a, 12, 0x70, 24, periph)
/* pa12_scom3p3_in */
#define PA12_SCOM3P3_IN        MCHP_PINMUX(a, 12, 0x7c, 3, periph)
/* pa12_scom4p0_in */
#define PA12_SCOM4P0_IN        MCHP_PINMUX(a, 12, 0x80, 3, periph)
/* pa12_scom5p0_in */
#define PA12_SCOM5P0_IN        MCHP_PINMUX(a, 12, 0x90, 24, periph)
/* pa12_scom5p3_in */
#define PA12_SCOM5P3_IN        MCHP_PINMUX(a, 12, 0x9c, 3, periph)
/* pa12_tc0wo0g2_in */
#define PA12_TC0WO0G2_IN       MCHP_PINMUX(a, 12, 0xd0, 3, periph)
/* pa12_tc0wo1g3_in */
#define PA12_TC0WO1G3_IN       MCHP_PINMUX(a, 12, 0xd4, 24, periph)
/* pa12_tc1wo1g2_in */
#define PA12_TC1WO1G2_IN       MCHP_PINMUX(a, 12, 0xe4, 3, periph)
/* pa12_tc2wo0g3_in */
#define PA12_TC2WO0G3_IN       MCHP_PINMUX(a, 12, 0xf0, 24, periph)
/* pa12_tc2wo1g2_in */
#define PA12_TC2WO1G2_IN       MCHP_PINMUX(a, 12, 0xf4, 3, periph)
/* pa12_tc3wo0g3_in */
#define PA12_TC3WO0G3_IN       MCHP_PINMUX(a, 12, 0x100, 24, periph)
/* pa12_tc3wo1g2_in */
#define PA12_TC3WO1G2_IN       MCHP_PINMUX(a, 12, 0x104, 3, periph)
/* pa12_tc4wo0g3_in */
#define PA12_TC4WO0G3_IN       MCHP_PINMUX(a, 12, 0x110, 24, periph)
/* pa12_tc4wo1g2_in */
#define PA12_TC4WO1G2_IN       MCHP_PINMUX(a, 12, 0x114, 3, periph)
/* pa12_tc5wo0g3_in */
#define PA12_TC5WO0G3_IN       MCHP_PINMUX(a, 12, 0x120, 24, periph)
/* pa12_tc5wo1g2_in */
#define PA12_TC5WO1G2_IN       MCHP_PINMUX(a, 12, 0x124, 3, periph)
/* pa12_tc6wo0g3_in */
#define PA12_TC6WO0G3_IN       MCHP_PINMUX(a, 12, 0x130, 24, periph)
/* pa12_tc6wo1g2_in */
#define PA12_TC6WO1G2_IN       MCHP_PINMUX(a, 12, 0x134, 3, periph)
/* pa12_tc7wo0g3_in */
#define PA12_TC7WO0G3_IN       MCHP_PINMUX(a, 12, 0x140, 24, periph)
/* pa12_tc7wo1g2_in */
#define PA12_TC7WO1G2_IN       MCHP_PINMUX(a, 12, 0x144, 3, periph)
/* pa12_tc8wo0g3_in */
#define PA12_TC8WO0G3_IN       MCHP_PINMUX(a, 12, 0x150, 24, periph)
/* pa12_tc8wo1g2_in */
#define PA12_TC8WO1G2_IN       MCHP_PINMUX(a, 12, 0x154, 3, periph)
/* pa12_tc9wo0g2_in */
#define PA12_TC9WO0G2_IN       MCHP_PINMUX(a, 12, 0x15c, 3, periph)
/* pa12_tc9wo1g3_in */
#define PA12_TC9WO1G3_IN       MCHP_PINMUX(a, 12, 0x164, 24, periph)
/* pa13_ac_cmp0_out */
#define PA13_AC_CMP0_OUT       MCHP_PINMUX(a, 13, 0x2a0, 40, periph)
/* pa13_ac_cmp1_out */
#define PA13_AC_CMP1_OUT       MCHP_PINMUX(a, 13, 0x2a4, 36, periph)
/* pa13_ac_cmptout_out */
#define PA13_AC_CMPTOUT_OUT    MCHP_PINMUX(a, 13, 0x2a4, 37, periph)
/* pa13_ac_cmptrdy_out */
#define PA13_AC_CMPTRDY_OUT    MCHP_PINMUX(a, 13, 0x2a0, 41, periph)
/* pa13_can1rx_in */
#define PA13_CAN1RX_IN         MCHP_PINMUX(a, 13, 0x190, 3, periph)
/* pa13_can1_tx_out */
#define PA13_CAN1_TX_OUT       MCHP_PINMUX(a, 13, 0x2a4, 38, periph)
/* pa13_cclin2_in */
#define PA13_CCLIN2_IN         MCHP_PINMUX(a, 13, 0xbc, 3, periph)
/* pa13_cclin5_in */
#define PA13_CCLIN5_IN         MCHP_PINMUX(a, 13, 0xc8, 3, periph)
/* pa13_cclo0_out */
#define PA13_CCLO0_OUT         MCHP_PINMUX(a, 13, 0x2a0, 1, periph)
/* pa13_cclo1_out */
#define PA13_CCLO1_OUT         MCHP_PINMUX(a, 13, 0x2a4, 1, periph)
/* pa13_coexwlanact_in */
#define PA13_COEXWLANACT_IN    MCHP_PINMUX(a, 13, 0x194, 19, periph)
/* pa13_extint2_in */
#define PA13_EXTINT2_IN        MCHP_PINMUX(a, 13, 0x8, 3, periph)
/* pa13_extint3_in */
#define PA13_EXTINT3_IN        MCHP_PINMUX(a, 13, 0xc, 19, periph)
/* pa13_fectrl3_out */
#define PA13_FECTRL3_OUT       MCHP_PINMUX(a, 13, 0x2a4, 39, periph)
/* pa13_fectrl4_out */
#define PA13_FECTRL4_OUT       MCHP_PINMUX(a, 13, 0x2a0, 42, periph)
/* pa13_fectrl5_out */
#define PA13_FECTRL5_OUT       MCHP_PINMUX(a, 13, 0x2a4, 40, periph)
/* pa13_nmi_in */
#define PA13_NMI_IN            MCHP_PINMUX(a, 13, 0x3c, 19, periph)
/* pa13_qd0_in */
#define PA13_QD0_IN            MCHP_PINMUX(a, 13, 0xa0, 19, periph)
/* pa13_qd0_out */
#define PA13_QD0_OUT           MCHP_PINMUX(a, 13, 0x2a0, 36, periph)
/* pa13_qd1_out */
#define PA13_QD1_OUT           MCHP_PINMUX(a, 13, 0x2a0, 35, periph)
/* pa13_qd2_out */
#define PA13_QD2_OUT           MCHP_PINMUX(a, 13, 0x2a4, 31, periph)
/* pa13_qd3_in */
#define PA13_QD3_IN            MCHP_PINMUX(a, 13, 0xac, 3, periph)
/* pa13_qd3_out */
#define PA13_QD3_OUT           MCHP_PINMUX(a, 13, 0x2a0, 37, periph)
/* pa13_qeiindx0g3_in */
#define PA13_QEIINDX0G3_IN     MCHP_PINMUX(a, 13, 0x178, 3, periph)
/* pa13_qeiqea0g3_in */
#define PA13_QEIQEA0G3_IN      MCHP_PINMUX(a, 13, 0x17c, 3, periph)
/* pa13_qeiqea0g4_in */
#define PA13_QEIQEA0G4_IN      MCHP_PINMUX(a, 13, 0x180, 19, periph)
/* pa13_qeiqeb0g4_in */
#define PA13_QEIQEB0G4_IN      MCHP_PINMUX(a, 13, 0x184, 19, periph)
/* pa13_qspics_out */
#define PA13_QSPICS_OUT        MCHP_PINMUX(a, 13, 0x2a0, 34, periph)
/* pa13_scom0p0_out */
#define PA13_SCOM0P0_OUT       MCHP_PINMUX(a, 13, 0x2a0, 2, periph)
/* pa13_scom0p2_in */
#define PA13_SCOM0P2_IN        MCHP_PINMUX(a, 13, 0x48, 19, periph)
/* pa13_scom0p2_out */
#define PA13_SCOM0P2_OUT       MCHP_PINMUX(a, 13, 0x2a4, 2, periph)
/* pa13_scom0p3_out */
#define PA13_SCOM0P3_OUT       MCHP_PINMUX(a, 13, 0x2a0, 3, periph)
/* pa13_scom1p0_in */
#define PA13_SCOM1P0_IN        MCHP_PINMUX(a, 13, 0x50, 3, periph)
/* pa13_scom1p0_out */
#define PA13_SCOM1P0_OUT       MCHP_PINMUX(a, 13, 0x2a0, 5, periph)
/* pa13_scom1p2_out */
#define PA13_SCOM1P2_OUT       MCHP_PINMUX(a, 13, 0x2a0, 4, periph)
/* pa13_scom1p3_out */
#define PA13_SCOM1P3_OUT       MCHP_PINMUX(a, 13, 0x2a0, 6, periph)
/* pa13_scom2p0_out */
#define PA13_SCOM2P0_OUT       MCHP_PINMUX(a, 13, 0x2a0, 7, periph)
/* pa13_scom2p2_in */
#define PA13_SCOM2P2_IN        MCHP_PINMUX(a, 13, 0x68, 19, periph)
/* pa13_scom2p2_out */
#define PA13_SCOM2P2_OUT       MCHP_PINMUX(a, 13, 0x2a4, 6, periph)
/* pa13_scom2p3_out */
#define PA13_SCOM2P3_OUT       MCHP_PINMUX(a, 13, 0x2a0, 8, periph)
/* pa13_scom3p0_in */
#define PA13_SCOM3P0_IN        MCHP_PINMUX(a, 13, 0x70, 3, periph)
/* pa13_scom3p0_out */
#define PA13_SCOM3P0_OUT       MCHP_PINMUX(a, 13, 0x2a0, 10, periph)
/* pa13_scom3p2_out */
#define PA13_SCOM3P2_OUT       MCHP_PINMUX(a, 13, 0x2a0, 9, periph)
/* pa13_scom3p3_out */
#define PA13_SCOM3P3_OUT       MCHP_PINMUX(a, 13, 0x2a0, 11, periph)
/* pa13_scom4p0_out */
#define PA13_SCOM4P0_OUT       MCHP_PINMUX(a, 13, 0x2a0, 12, periph)
/* pa13_scom4p2_in */
#define PA13_SCOM4P2_IN        MCHP_PINMUX(a, 13, 0x88, 19, periph)
/* pa13_scom4p2_out */
#define PA13_SCOM4P2_OUT       MCHP_PINMUX(a, 13, 0x2a4, 10, periph)
/* pa13_scom4p3_out */
#define PA13_SCOM4P3_OUT       MCHP_PINMUX(a, 13, 0x2a0, 13, periph)
/* pa13_scom5p0_in */
#define PA13_SCOM5P0_IN        MCHP_PINMUX(a, 13, 0x90, 3, periph)
/* pa13_scom5p0_out */
#define PA13_SCOM5P0_OUT       MCHP_PINMUX(a, 13, 0x2a0, 15, periph)
/* pa13_scom5p2_out */
#define PA13_SCOM5P2_OUT       MCHP_PINMUX(a, 13, 0x2a0, 14, periph)
/* pa13_scom5p3_out */
#define PA13_SCOM5P3_OUT       MCHP_PINMUX(a, 13, 0x2a0, 16, periph)
/* pa13_tc0wo0_out */
#define PA13_TC0WO0_OUT        MCHP_PINMUX(a, 13, 0x2a0, 24, periph)
/* pa13_tc0wo1g3_in */
#define PA13_TC0WO1G3_IN       MCHP_PINMUX(a, 13, 0xd4, 3, periph)
/* pa13_tc0wo1g4_in */
#define PA13_TC0WO1G4_IN       MCHP_PINMUX(a, 13, 0xd8, 19, periph)
/* pa13_tc1wo0_out */
#define PA13_TC1WO0_OUT        MCHP_PINMUX(a, 13, 0x2a0, 25, periph)
/* pa13_tc1wo1_out */
#define PA13_TC1WO1_OUT        MCHP_PINMUX(a, 13, 0x2a4, 22, periph)
/* pa13_tc2wo0g3_in */
#define PA13_TC2WO0G3_IN       MCHP_PINMUX(a, 13, 0xf0, 3, periph)
/* pa13_tc2wo0_out */
