zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62132-pinctrl.h
/* pb6_tc4wo0_out */
#define PB6_TC4WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 22, periph)
/* pb6_tc4wo1g4_in */
#define PB6_TC4WO1G4_IN        MCHP_PINMUX(b, 6, 0x118, 21, periph)
/* pb6_tc4wo1_out */
#define PB6_TC4WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 25, periph)
/* pb6_tc5wo0g1_in */
#define PB6_TC5WO0G1_IN        MCHP_PINMUX(b, 6, 0x11c, 5, periph)
/* pb6_tc5wo0g3_in */
#define PB6_TC5WO0G3_IN        MCHP_PINMUX(b, 6, 0x120, 17, periph)
/* pb6_tc5wo0_out */
#define PB6_TC5WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 23, periph)
/* pb6_tc5wo1g4_in */
#define PB6_TC5WO1G4_IN        MCHP_PINMUX(b, 6, 0x128, 21, periph)
/* pb6_tc5wo1_out */
#define PB6_TC5WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 26, periph)
/* pb6_tc6wo0g1_in */
#define PB6_TC6WO0G1_IN        MCHP_PINMUX(b, 6, 0x12c, 5, periph)
/* pb6_tc6wo0g3_in */
#define PB6_TC6WO0G3_IN        MCHP_PINMUX(b, 6, 0x130, 17, periph)
/* pb6_tc6wo0_out */
#define PB6_TC6WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 24, periph)
/* pb6_tc6wo1g4_in */
#define PB6_TC6WO1G4_IN        MCHP_PINMUX(b, 6, 0x138, 21, periph)
/* pb6_tc6wo1_out */
#define PB6_TC6WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 27, periph)
/* pb6_tc7wo0g1_in */
#define PB6_TC7WO0G1_IN        MCHP_PINMUX(b, 6, 0x13c, 5, periph)
/* pb6_tc7wo0g3_in */
#define PB6_TC7WO0G3_IN        MCHP_PINMUX(b, 6, 0x140, 17, periph)
/* pb6_tc7wo0_out */
#define PB6_TC7WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 25, periph)
/* pb6_tc7wo1g4_in */
#define PB6_TC7WO1G4_IN        MCHP_PINMUX(b, 6, 0x148, 21, periph)
/* pb6_tc7wo1_out */
#define PB6_TC7WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 28, periph)
/* pb6_tc8wo0g1_in */
#define PB6_TC8WO0G1_IN        MCHP_PINMUX(b, 6, 0x14c, 5, periph)
/* pb6_tc8wo0g3_in */
#define PB6_TC8WO0G3_IN        MCHP_PINMUX(b, 6, 0x150, 17, periph)
/* pb6_tc8wo0_out */
#define PB6_TC8WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 26, periph)
/* pb6_tc9wo0g4_in */
#define PB6_TC9WO0G4_IN        MCHP_PINMUX(b, 6, 0x160, 21, periph)
/* pb6_tc9wo0_out */
#define PB6_TC9WO0_OUT         MCHP_PINMUX(b, 6, 0x308, 29, periph)
/* pb6_tc9wo1g3_in */
#define PB6_TC9WO1G3_IN        MCHP_PINMUX(b, 6, 0x164, 17, periph)
/* pb6_tc9wo1_out */
#define PB6_TC9WO1_OUT         MCHP_PINMUX(b, 6, 0x304, 33, periph)
/* pb6_tcc0wo0_out */
#define PB6_TCC0WO0_OUT        MCHP_PINMUX(b, 6, 0x300, 13, periph)
/* pb6_tcc0wo1_out */
#define PB6_TCC0WO1_OUT        MCHP_PINMUX(b, 6, 0x308, 15, periph)
/* pb6_tcc0wo2_out */
#define PB6_TCC0WO2_OUT        MCHP_PINMUX(b, 6, 0x304, 17, periph)
/* pb6_tcc0wo3_out */
#define PB6_TCC0WO3_OUT        MCHP_PINMUX(b, 6, 0x308, 14, periph)
/* pb6_tcc0wo4_out */
#define PB6_TCC0WO4_OUT        MCHP_PINMUX(b, 6, 0x300, 14, periph)
/* pb6_tcc0wo5_out */
#define PB6_TCC0WO5_OUT        MCHP_PINMUX(b, 6, 0x308, 16, periph)
/* pb6_tcc1wo0_out */
#define PB6_TCC1WO0_OUT        MCHP_PINMUX(b, 6, 0x300, 15, periph)
/* pb6_tcc1wo1_out */
#define PB6_TCC1WO1_OUT        MCHP_PINMUX(b, 6, 0x308, 18, periph)
/* pb6_tcc1wo2_out */
#define PB6_TCC1WO2_OUT        MCHP_PINMUX(b, 6, 0x304, 20, periph)
/* pb6_tcc1wo3_out */
#define PB6_TCC1WO3_OUT        MCHP_PINMUX(b, 6, 0x308, 17, periph)
/* pb6_tcc1wo4_out */
#define PB6_TCC1WO4_OUT        MCHP_PINMUX(b, 6, 0x300, 16, periph)
/* pb6_tcc1wo5_out */
#define PB6_TCC1WO5_OUT        MCHP_PINMUX(b, 6, 0x308, 19, periph)
/* pb6_tcc2wo0_out */
#define PB6_TCC2WO0_OUT        MCHP_PINMUX(b, 6, 0x300, 17, periph)
/* pb6_tcc2wo1_out */
#define PB6_TCC2WO1_OUT        MCHP_PINMUX(b, 6, 0x308, 20, periph)
/* pb6_tstbus0_out */
#define PB6_TSTBUS0_OUT        MCHP_PINMUX(b, 6, 0x300, 32, periph)
/* pb6_tstbus1_out */
#define PB6_TSTBUS1_OUT        MCHP_PINMUX(b, 6, 0x304, 38, periph)
/* pb6_tstbus2_out */
#define PB6_TSTBUS2_OUT        MCHP_PINMUX(b, 6, 0x308, 34, periph)
/* pb6_tstbus4_out */
#define PB6_TSTBUS4_OUT        MCHP_PINMUX(b, 6, 0x300, 33, periph)
/* pb6_tstbus6_out */
#define PB6_TSTBUS6_OUT        MCHP_PINMUX(b, 6, 0x308, 35, periph)
/* pb6_tstbus8_out */
#define PB6_TSTBUS8_OUT        MCHP_PINMUX(b, 6, 0x300, 34, periph)
/* pb6_tstbus10_out */
#define PB6_TSTBUS10_OUT       MCHP_PINMUX(b, 6, 0x304, 39, periph)
/* pb7_accmpten_in */
#define PB7_ACCMPTEN_IN        MCHP_PINMUX(b, 7, 0x18c, 24, periph)
/* pb7_ac_cmp1_out */
#define PB7_AC_CMP1_OUT        MCHP_PINMUX(b, 7, 0x318, 36, periph)
/* pb7_ac_cmptout_out */
#define PB7_AC_CMPTOUT_OUT     MCHP_PINMUX(b, 7, 0x318, 37, periph)
/* pb7_can1_tx_out */
#define PB7_CAN1_TX_OUT        MCHP_PINMUX(b, 7, 0x318, 38, periph)
/* pb7_cclin0_in */
#define PB7_CCLIN0_IN          MCHP_PINMUX(b, 7, 0xb4, 24, periph)
/* pb7_cclin1_in */
#define PB7_CCLIN1_IN          MCHP_PINMUX(b, 7, 0xb8, 5, periph)
/* pb7_cclin3_in */
#define PB7_CCLIN3_IN          MCHP_PINMUX(b, 7, 0xc0, 24, periph)
/* pb7_cclin4_in */
#define PB7_CCLIN4_IN          MCHP_PINMUX(b, 7, 0xc4, 5, periph)
/* pb7_cclo1_out */
#define PB7_CCLO1_OUT          MCHP_PINMUX(b, 7, 0x314, 1, periph)
/* pb7_coexwlanact_in */
#define PB7_COEXWLANACT_IN     MCHP_PINMUX(b, 7, 0x194, 15, periph)
/* pb7_coex_bt_state_out */
#define PB7_COEX_BT_STATE_OUT  MCHP_PINMUX(b, 7, 0x310, 37, periph)
/* pb7_coex_rf_act_out */
#define PB7_COEX_RF_ACT_OUT    MCHP_PINMUX(b, 7, 0x314, 41, periph)
/* pb7_extint0_in */
#define PB7_EXTINT0_IN         MCHP_PINMUX(b, 7, 0x0, 24, periph)
/* pb7_extint1_in */
#define PB7_EXTINT1_IN         MCHP_PINMUX(b, 7, 0x4, 5, periph)
/* pb7_extint3_in */
#define PB7_EXTINT3_IN         MCHP_PINMUX(b, 7, 0xc, 15, periph)
/* pb7_fectrl0_out */
#define PB7_FECTRL0_OUT        MCHP_PINMUX(b, 7, 0x314, 40, periph)
/* pb7_fectrl1_out */
#define PB7_FECTRL1_OUT        MCHP_PINMUX(b, 7, 0x310, 35, periph)
/* pb7_fectrl2_out */
#define PB7_FECTRL2_OUT        MCHP_PINMUX(b, 7, 0x310, 36, periph)
/* pb7_fectrl3_out */
#define PB7_FECTRL3_OUT        MCHP_PINMUX(b, 7, 0x318, 39, periph)
/* pb7_fectrl5_out */
#define PB7_FECTRL5_OUT        MCHP_PINMUX(b, 7, 0x318, 40, periph)
/* pb7_nmi_in */
#define PB7_NMI_IN             MCHP_PINMUX(b, 7, 0x3c, 15, periph)
/* pb7_qd0_in */
#define PB7_QD0_IN             MCHP_PINMUX(b, 7, 0xa0, 15, periph)
/* pb7_qd0_out */
#define PB7_QD0_OUT            MCHP_PINMUX(b, 7, 0x314, 35, periph)
/* pb7_qd1_in */
#define PB7_QD1_IN             MCHP_PINMUX(b, 7, 0xa4, 24, periph)
/* pb7_qd1_out */
#define PB7_QD1_OUT            MCHP_PINMUX(b, 7, 0x310, 30, periph)
/* pb7_qd2_in */
#define PB7_QD2_IN             MCHP_PINMUX(b, 7, 0xa8, 5, periph)
/* pb7_qd2_out */
#define PB7_QD2_OUT            MCHP_PINMUX(b, 7, 0x310, 29, periph)
/* pb7_qd3_out */
#define PB7_QD3_OUT            MCHP_PINMUX(b, 7, 0x310, 28, periph)
/* pb7_qeiccmp0_out */
#define PB7_QEICCMP0_OUT       MCHP_PINMUX(b, 7, 0x310, 31, periph)
/* pb7_qeihome0g1_in */
#define PB7_QEIHOME0G1_IN      MCHP_PINMUX(b, 7, 0x16c, 24, periph)
/* pb7_qeihome0g2_in */
#define PB7_QEIHOME0G2_IN      MCHP_PINMUX(b, 7, 0x170, 5, periph)
/* pb7_qeiindx0g2_in */
#define PB7_QEIINDX0G2_IN      MCHP_PINMUX(b, 7, 0x174, 5, periph)
/* pb7_qeiqea0g4_in */
#define PB7_QEIQEA0G4_IN       MCHP_PINMUX(b, 7, 0x180, 15, periph)
/* pb7_qeiqeb0g4_in */
#define PB7_QEIQEB0G4_IN       MCHP_PINMUX(b, 7, 0x184, 15, periph)
/* pb7_qspics_out */
#define PB7_QSPICS_OUT         MCHP_PINMUX(b, 7, 0x310, 27, periph)
/* pb7_scom0p0_in */
#define PB7_SCOM0P0_IN         MCHP_PINMUX(b, 7, 0x40, 5, periph)
/* pb7_scom0p0_out */
#define PB7_SCOM0P0_OUT        MCHP_PINMUX(b, 7, 0x314, 2, periph)
/* pb7_scom0p2_in */
#define PB7_SCOM0P2_IN         MCHP_PINMUX(b, 7, 0x48, 15, periph)
/* pb7_scom0p2_out */
#define PB7_SCOM0P2_OUT        MCHP_PINMUX(b, 7, 0x310, 2, periph)
/* pb7_scom0p3_in */
#define PB7_SCOM0P3_IN         MCHP_PINMUX(b, 7, 0x4c, 24, periph)
/* pb7_scom0p3_out */
#define PB7_SCOM0P3_OUT        MCHP_PINMUX(b, 7, 0x310, 1, periph)
/* pb7_scom1p0_out */
#define PB7_SCOM1P0_OUT        MCHP_PINMUX(b, 7, 0x310, 3, periph)
/* pb7_scom1p2_in */
#define PB7_SCOM1P2_IN         MCHP_PINMUX(b, 7, 0x58, 24, periph)
/* pb7_scom1p2_out */
#define PB7_SCOM1P2_OUT        MCHP_PINMUX(b, 7, 0x310, 4, periph)
/* pb7_scom1p3_in */
#define PB7_SCOM1P3_IN         MCHP_PINMUX(b, 7, 0x5c, 5, periph)
/* pb7_scom1p3_out */
#define PB7_SCOM1P3_OUT        MCHP_PINMUX(b, 7, 0x314, 5, periph)
/* pb7_scom2p0_in */
#define PB7_SCOM2P0_IN         MCHP_PINMUX(b, 7, 0x60, 5, periph)
/* pb7_scom2p0_out */
#define PB7_SCOM2P0_OUT        MCHP_PINMUX(b, 7, 0x314, 7, periph)
/* pb7_scom2p2_in */
#define PB7_SCOM2P2_IN         MCHP_PINMUX(b, 7, 0x68, 15, periph)
/* pb7_scom2p2_out */
#define PB7_SCOM2P2_OUT        MCHP_PINMUX(b, 7, 0x310, 6, periph)
/* pb7_scom2p3_in */
#define PB7_SCOM2P3_IN         MCHP_PINMUX(b, 7, 0x6c, 24, periph)
/* pb7_scom2p3_out */
#define PB7_SCOM2P3_OUT        MCHP_PINMUX(b, 7, 0x310, 5, periph)
/* pb7_scom3p0_out */
#define PB7_SCOM3P0_OUT        MCHP_PINMUX(b, 7, 0x310, 7, periph)
/* pb7_scom3p2_in */
#define PB7_SCOM3P2_IN         MCHP_PINMUX(b, 7, 0x78, 24, periph)
/* pb7_scom3p2_out */
#define PB7_SCOM3P2_OUT        MCHP_PINMUX(b, 7, 0x310, 8, periph)
/* pb7_scom3p3_in */
#define PB7_SCOM3P3_IN         MCHP_PINMUX(b, 7, 0x7c, 5, periph)
/* pb7_scom3p3_out */
#define PB7_SCOM3P3_OUT        MCHP_PINMUX(b, 7, 0x314, 10, periph)
/* pb7_scom4p0_in */
#define PB7_SCOM4P0_IN         MCHP_PINMUX(b, 7, 0x80, 5, periph)
/* pb7_scom4p0_out */
#define PB7_SCOM4P0_OUT        MCHP_PINMUX(b, 7, 0x314, 12, periph)
/* pb7_scom4p2_in */
#define PB7_SCOM4P2_IN         MCHP_PINMUX(b, 7, 0x88, 15, periph)
/* pb7_scom4p2_out */
#define PB7_SCOM4P2_OUT        MCHP_PINMUX(b, 7, 0x310, 10, periph)
/* pb7_scom4p3_in */
#define PB7_SCOM4P3_IN         MCHP_PINMUX(b, 7, 0x8c, 24, periph)
/* pb7_scom4p3_out */
#define PB7_SCOM4P3_OUT        MCHP_PINMUX(b, 7, 0x310, 9, periph)
/* pb7_scom5p0_out */
#define PB7_SCOM5P0_OUT        MCHP_PINMUX(b, 7, 0x310, 11, periph)
/* pb7_scom5p2_in */
#define PB7_SCOM5P2_IN         MCHP_PINMUX(b, 7, 0x98, 24, periph)
/* pb7_scom5p2_out */
#define PB7_SCOM5P2_OUT        MCHP_PINMUX(b, 7, 0x310, 12, periph)
/* pb7_scom5p3_in */
#define PB7_SCOM5P3_IN         MCHP_PINMUX(b, 7, 0x9c, 5, periph)
/* pb7_scom5p3_out */
#define PB7_SCOM5P3_OUT        MCHP_PINMUX(b, 7, 0x314, 15, periph)
/* pb7_tc0wo0g1_in */
#define PB7_TC0WO0G1_IN        MCHP_PINMUX(b, 7, 0xcc, 24, periph)
/* pb7_tc0wo0g2_in */
#define PB7_TC0WO0G2_IN        MCHP_PINMUX(b, 7, 0xd0, 5, periph)
/* pb7_tc0wo0_out */
#define PB7_TC0WO0_OUT         MCHP_PINMUX(b, 7, 0x318, 21, periph)
/* pb7_tc0wo1g4_in */
#define PB7_TC0WO1G4_IN        MCHP_PINMUX(b, 7, 0xd8, 15, periph)
/* pb7_tc0wo1_out */
#define PB7_TC0WO1_OUT         MCHP_PINMUX(b, 7, 0x310, 18, periph)
/* pb7_tc1wo0g1_in */
#define PB7_TC1WO0G1_IN        MCHP_PINMUX(b, 7, 0xdc, 24, periph)
/* pb7_tc1wo0_out */
#define PB7_TC1WO0_OUT         MCHP_PINMUX(b, 7, 0x310, 19, periph)
/* pb7_tc1wo1g2_in */
#define PB7_TC1WO1G2_IN        MCHP_PINMUX(b, 7, 0xe4, 5, periph)
/* pb7_tc1wo1_out */
#define PB7_TC1WO1_OUT         MCHP_PINMUX(b, 7, 0x314, 25, periph)
/* pb7_tc2wo0g1_in */
#define PB7_TC2WO0G1_IN        MCHP_PINMUX(b, 7, 0xec, 24, periph)
/* pb7_tc2wo0_out */
#define PB7_TC2WO0_OUT         MCHP_PINMUX(b, 7, 0x310, 20, periph)
/* pb7_tc2wo1g2_in */
#define PB7_TC2WO1G2_IN        MCHP_PINMUX(b, 7, 0xf4, 5, periph)
/* pb7_tc2wo1g4_in */
#define PB7_TC2WO1G4_IN        MCHP_PINMUX(b, 7, 0xf8, 15, periph)
/* pb7_tc2wo1_out */
#define PB7_TC2WO1_OUT         MCHP_PINMUX(b, 7, 0x314, 26, periph)
/* pb7_tc3wo0g1_in */
#define PB7_TC3WO0G1_IN        MCHP_PINMUX(b, 7, 0xfc, 24, periph)
/* pb7_tc3wo0_out */
#define PB7_TC3WO0_OUT         MCHP_PINMUX(b, 7, 0x310, 21, periph)
/* pb7_tc3wo1g2_in */
#define PB7_TC3WO1G2_IN        MCHP_PINMUX(b, 7, 0x104, 5, periph)
/* pb7_tc3wo1g4_in */
#define PB7_TC3WO1G4_IN        MCHP_PINMUX(b, 7, 0x108, 15, periph)
/* pb7_tc3wo1_out */
#define PB7_TC3WO1_OUT         MCHP_PINMUX(b, 7, 0x314, 27, periph)
/* pb7_tc4wo0g1_in */
#define PB7_TC4WO0G1_IN        MCHP_PINMUX(b, 7, 0x10c, 24, periph)
/* pb7_tc4wo0_out */
#define PB7_TC4WO0_OUT         MCHP_PINMUX(b, 7, 0x310, 22, periph)
/* pb7_tc4wo1g2_in */
#define PB7_TC4WO1G2_IN        MCHP_PINMUX(b, 7, 0x114, 5, periph)
/* pb7_tc4wo1g4_in */
#define PB7_TC4WO1G4_IN        MCHP_PINMUX(b, 7, 0x118, 15, periph)
/* pb7_tc4wo1_out */
#define PB7_TC4WO1_OUT         MCHP_PINMUX(b, 7, 0x314, 28, periph)
/* pb7_tc5wo0g1_in */
#define PB7_TC5WO0G1_IN        MCHP_PINMUX(b, 7, 0x11c, 24, periph)
/* pb7_tc5wo0_out */
#define PB7_TC5WO0_OUT         MCHP_PINMUX(b, 7, 0x310, 23, periph)
/* pb7_tc5wo1g2_in */
#define PB7_TC5WO1G2_IN        MCHP_PINMUX(b, 7, 0x124, 5, periph)
/* pb7_tc5wo1g4_in */
#define PB7_TC5WO1G4_IN        MCHP_PINMUX(b, 7, 0x128, 15, periph)
/* pb7_tc5wo1_out */
#define PB7_TC5WO1_OUT         MCHP_PINMUX(b, 7, 0x314, 29, periph)
/* pb7_tc6wo0g1_in */
#define PB7_TC6WO0G1_IN        MCHP_PINMUX(b, 7, 0x12c, 24, periph)
/* pb7_tc6wo0_out */
#define PB7_TC6WO0_OUT         MCHP_PINMUX(b, 7, 0x310, 24, periph)
/* pb7_tc6wo1g2_in */
#define PB7_TC6WO1G2_IN        MCHP_PINMUX(b, 7, 0x134, 5, periph)
/* pb7_tc6wo1g4_in */
#define PB7_TC6WO1G4_IN        MCHP_PINMUX(b, 7, 0x138, 15, periph)
/* pb7_tc6wo1_out */
#define PB7_TC6WO1_OUT         MCHP_PINMUX(b, 7, 0x314, 30, periph)
/* pb7_tc7wo0g1_in */
#define PB7_TC7WO0G1_IN        MCHP_PINMUX(b, 7, 0x13c, 24, periph)
/* pb7_tc7wo0_out */
#define PB7_TC7WO0_OUT         MCHP_PINMUX(b, 7, 0x310, 25, periph)
/* pb7_tc7wo1g2_in */
#define PB7_TC7WO1G2_IN        MCHP_PINMUX(b, 7, 0x144, 5, periph)
/* pb7_tc7wo1g4_in */
#define PB7_TC7WO1G4_IN        MCHP_PINMUX(b, 7, 0x148, 15, periph)
/* pb7_tc7wo1_out */
#define PB7_TC7WO1_OUT         MCHP_PINMUX(b, 7, 0x314, 31, periph)
/* pb7_tc8wo0g1_in */
#define PB7_TC8WO0G1_IN        MCHP_PINMUX(b, 7, 0x14c, 24, periph)
/* pb7_tc8wo0_out */
#define PB7_TC8WO0_OUT         MCHP_PINMUX(b, 7, 0x310, 26, periph)
/* pb7_tc8wo1g2_in */
#define PB7_TC8WO1G2_IN        MCHP_PINMUX(b, 7, 0x154, 5, periph)
/* pb7_tc8wo1_out */
#define PB7_TC8WO1_OUT         MCHP_PINMUX(b, 7, 0x314, 32, periph)
/* pb7_tc9wo0g2_in */
#define PB7_TC9WO0G2_IN        MCHP_PINMUX(b, 7, 0x15c, 5, periph)
/* pb7_tc9wo0g4_in */
#define PB7_TC9WO0G4_IN        MCHP_PINMUX(b, 7, 0x160, 15, periph)
/* pb7_tc9wo0_out */
#define PB7_TC9WO0_OUT         MCHP_PINMUX(b, 7, 0x314, 33, periph)
/* pb7_tcc0wo0_out */
#define PB7_TCC0WO0_OUT        MCHP_PINMUX(b, 7, 0x310, 13, periph)
/* pb7_tcc0wo1_out */
#define PB7_TCC0WO1_OUT        MCHP_PINMUX(b, 7, 0x314, 17, periph)
/* pb7_tcc0wo3_out */
#define PB7_TCC0WO3_OUT        MCHP_PINMUX(b, 7, 0x314, 19, periph)
/* pb7_tcc0wo4_out */
#define PB7_TCC0WO4_OUT        MCHP_PINMUX(b, 7, 0x310, 14, periph)
/* pb7_tcc0wo5_out */
#define PB7_TCC0WO5_OUT        MCHP_PINMUX(b, 7, 0x314, 18, periph)
/* pb7_tcc1wo0_out */
#define PB7_TCC1WO0_OUT        MCHP_PINMUX(b, 7, 0x310, 15, periph)
/* pb7_tcc1wo1_out */
#define PB7_TCC1WO1_OUT        MCHP_PINMUX(b, 7, 0x314, 20, periph)
/* pb7_tcc1wo3_out */
#define PB7_TCC1WO3_OUT        MCHP_PINMUX(b, 7, 0x314, 22, periph)
/* pb7_tcc1wo4_out */
#define PB7_TCC1WO4_OUT        MCHP_PINMUX(b, 7, 0x310, 16, periph)
/* pb7_tcc1wo5_out */
#define PB7_TCC1WO5_OUT        MCHP_PINMUX(b, 7, 0x314, 21, periph)
/* pb7_tcc2wo0_out */
#define PB7_TCC2WO0_OUT        MCHP_PINMUX(b, 7, 0x310, 17, periph)
/* pb7_tcc2wo1_out */
#define PB7_TCC2WO1_OUT        MCHP_PINMUX(b, 7, 0x314, 23, periph)
/* pb7_tstbus0_out */
#define PB7_TSTBUS0_OUT        MCHP_PINMUX(b, 7, 0x310, 32, periph)
/* pb7_tstbus2_out */
#define PB7_TSTBUS2_OUT        MCHP_PINMUX(b, 7, 0x318, 34, periph)
/* pb7_tstbus4_out */
#define PB7_TSTBUS4_OUT        MCHP_PINMUX(b, 7, 0x310, 33, periph)
/* pb7_tstbus5_out */
#define PB7_TSTBUS5_OUT        MCHP_PINMUX(b, 7, 0x314, 38, periph)
/* pb7_tstbus6_out */
#define PB7_TSTBUS6_OUT        MCHP_PINMUX(b, 7, 0x318, 35, periph)
/* pb7_tstbus8_out */
#define PB7_TSTBUS8_OUT        MCHP_PINMUX(b, 7, 0x310, 34, periph)
/* pb7_tstbus9_out */
#define PB7_TSTBUS9_OUT        MCHP_PINMUX(b, 7, 0x314, 39, periph)
/* pb8_accmpten_in */
#define PB8_ACCMPTEN_IN        MCHP_PINMUX(b, 8, 0x18c, 18, periph)
/* pb8_ac_cmp0_out */
#define PB8_AC_CMP0_OUT        MCHP_PINMUX(b, 8, 0x324, 40, periph)
/* pb8_ac_cmptrdy_out */
#define PB8_AC_CMPTRDY_OUT     MCHP_PINMUX(b, 8, 0x324, 41, periph)
/* pb8_can1rx_in */
#define PB8_CAN1RX_IN          MCHP_PINMUX(b, 8, 0x190, 5, periph)
/* pb8_cclin0_in */
#define PB8_CCLIN0_IN          MCHP_PINMUX(b, 8, 0xb4, 18, periph)
/* pb8_cclin1_in */
#define PB8_CCLIN1_IN          MCHP_PINMUX(b, 8, 0xb8, 23, periph)
/* pb8_cclin2_in */
#define PB8_CCLIN2_IN          MCHP_PINMUX(b, 8, 0xbc, 5, periph)
/* pb8_cclin3_in */
#define PB8_CCLIN3_IN          MCHP_PINMUX(b, 8, 0xc0, 18, periph)
/* pb8_cclin4_in */
#define PB8_CCLIN4_IN          MCHP_PINMUX(b, 8, 0xc4, 23, periph)
/* pb8_cclin5_in */
#define PB8_CCLIN5_IN          MCHP_PINMUX(b, 8, 0xc8, 5, periph)
/* pb8_cclo0_out */
#define PB8_CCLO0_OUT          MCHP_PINMUX(b, 8, 0x324, 1, periph)
/* pb8_cclo1_out */
#define PB8_CCLO1_OUT          MCHP_PINMUX(b, 8, 0x320, 1, periph)
/* pb8_coex_bt_state_out */
#define PB8_COEX_BT_STATE_OUT  MCHP_PINMUX(b, 8, 0x31c, 37, periph)
/* pb8_coex_rf_act_out */
#define PB8_COEX_RF_ACT_OUT    MCHP_PINMUX(b, 8, 0x320, 41, periph)
/* pb8_extint0_in */
#define PB8_EXTINT0_IN         MCHP_PINMUX(b, 8, 0x0, 18, periph)
/* pb8_extint1_in */
#define PB8_EXTINT1_IN         MCHP_PINMUX(b, 8, 0x4, 23, periph)
/* pb8_extint2_in */
#define PB8_EXTINT2_IN         MCHP_PINMUX(b, 8, 0x8, 5, periph)
/* pb8_fectrl0_out */
#define PB8_FECTRL0_OUT        MCHP_PINMUX(b, 8, 0x320, 40, periph)
/* pb8_fectrl1_out */
#define PB8_FECTRL1_OUT        MCHP_PINMUX(b, 8, 0x31c, 35, periph)
/* pb8_fectrl2_out */
#define PB8_FECTRL2_OUT        MCHP_PINMUX(b, 8, 0x31c, 36, periph)
/* pb8_fectrl4_out */
#define PB8_FECTRL4_OUT        MCHP_PINMUX(b, 8, 0x324, 42, periph)
/* pb8_qd0_out */
#define PB8_QD0_OUT            MCHP_PINMUX(b, 8, 0x320, 35, periph)
/* pb8_qd1_in */
#define PB8_QD1_IN             MCHP_PINMUX(b, 8, 0xa4, 18, periph)
/* pb8_qd1_out */
#define PB8_QD1_OUT            MCHP_PINMUX(b, 8, 0x31c, 30, periph)
/* pb8_qd2_in */
#define PB8_QD2_IN             MCHP_PINMUX(b, 8, 0xa8, 23, periph)
/* pb8_qd2_out */
#define PB8_QD2_OUT            MCHP_PINMUX(b, 8, 0x31c, 29, periph)
/* pb8_qd3_in */
#define PB8_QD3_IN             MCHP_PINMUX(b, 8, 0xac, 5, periph)
/* pb8_qd3_out */
#define PB8_QD3_OUT            MCHP_PINMUX(b, 8, 0x31c, 28, periph)
/* pb8_qeiccmp0_out */
#define PB8_QEICCMP0_OUT       MCHP_PINMUX(b, 8, 0x31c, 31, periph)
/* pb8_qeihome0g1_in */
#define PB8_QEIHOME0G1_IN      MCHP_PINMUX(b, 8, 0x16c, 18, periph)
/* pb8_qeihome0g2_in */
#define PB8_QEIHOME0G2_IN      MCHP_PINMUX(b, 8, 0x170, 23, periph)
/* pb8_qeiindx0g2_in */
#define PB8_QEIINDX0G2_IN      MCHP_PINMUX(b, 8, 0x174, 23, periph)
/* pb8_qeiindx0g3_in */
#define PB8_QEIINDX0G3_IN      MCHP_PINMUX(b, 8, 0x178, 5, periph)
/* pb8_qeiqea0g3_in */
#define PB8_QEIQEA0G3_IN       MCHP_PINMUX(b, 8, 0x17c, 5, periph)
/* pb8_qspics_out */
#define PB8_QSPICS_OUT         MCHP_PINMUX(b, 8, 0x31c, 27, periph)
/* pb8_qspi_sck_out */
#define PB8_QSPI_SCK_OUT       MCHP_PINMUX(b, 8, 0x328, 7, periph)
/* pb8_refi_in */
#define PB8_REFI_IN            MCHP_PINMUX(b, 8, 0xb0, 10, periph)
/* pb8_refo1_out */
#define PB8_REFO1_OUT          MCHP_PINMUX(b, 8, 0x328, 8, periph)
/* pb8_refo2_out */
#define PB8_REFO2_OUT          MCHP_PINMUX(b, 8, 0x328, 9, periph)
/* pb8_refo3_out */
#define PB8_REFO3_OUT          MCHP_PINMUX(b, 8, 0x328, 10, periph)
/* pb8_refo4_out */
#define PB8_REFO4_OUT          MCHP_PINMUX(b, 8, 0x328, 11, periph)
/* pb8_scom0p0_in */
#define PB8_SCOM0P0_IN         MCHP_PINMUX(b, 8, 0x40, 23, periph)
/* pb8_scom0p0_out */
#define PB8_SCOM0P0_OUT        MCHP_PINMUX(b, 8, 0x320, 2, periph)
/* pb8_scom0p1_in */
#define PB8_SCOM0P1_IN         MCHP_PINMUX(b, 8, 0x44, 10, periph)
/* pb8_scom0p1_out */
#define PB8_SCOM0P1_OUT        MCHP_PINMUX(b, 8, 0x328, 1, periph)
/* pb8_scom0p2_out */
#define PB8_SCOM0P2_OUT        MCHP_PINMUX(b, 8, 0x31c, 2, periph)
/* pb8_scom0p3_in */
#define PB8_SCOM0P3_IN         MCHP_PINMUX(b, 8, 0x4c, 18, periph)
/* pb8_scom0p3_out */
#define PB8_SCOM0P3_OUT        MCHP_PINMUX(b, 8, 0x31c, 1, periph)
/* pb8_scom1p0_in */
#define PB8_SCOM1P0_IN         MCHP_PINMUX(b, 8, 0x50, 5, periph)
/* pb8_scom1p0_out */
#define PB8_SCOM1P0_OUT        MCHP_PINMUX(b, 8, 0x31c, 3, periph)
/* pb8_scom1p1_in */
#define PB8_SCOM1P1_IN         MCHP_PINMUX(b, 8, 0x54, 10, periph)
/* pb8_scom1p1_out */
#define PB8_SCOM1P1_OUT        MCHP_PINMUX(b, 8, 0x328, 2, periph)
/* pb8_scom1p2_in */
#define PB8_SCOM1P2_IN         MCHP_PINMUX(b, 8, 0x58, 18, periph)
/* pb8_scom1p2_out */
#define PB8_SCOM1P2_OUT        MCHP_PINMUX(b, 8, 0x31c, 4, periph)
/* pb8_scom1p3_in */
#define PB8_SCOM1P3_IN         MCHP_PINMUX(b, 8, 0x5c, 23, periph)
/* pb8_scom1p3_out */
#define PB8_SCOM1P3_OUT        MCHP_PINMUX(b, 8, 0x320, 5, periph)
/* pb8_scom2p0_in */
#define PB8_SCOM2P0_IN         MCHP_PINMUX(b, 8, 0x60, 23, periph)
/* pb8_scom2p0_out */
#define PB8_SCOM2P0_OUT        MCHP_PINMUX(b, 8, 0x320, 7, periph)
/* pb8_scom2p1_in */
#define PB8_SCOM2P1_IN         MCHP_PINMUX(b, 8, 0x64, 10, periph)
/* pb8_scom2p1_out */
#define PB8_SCOM2P1_OUT        MCHP_PINMUX(b, 8, 0x328, 3, periph)
/* pb8_scom2p2_out */
#define PB8_SCOM2P2_OUT        MCHP_PINMUX(b, 8, 0x31c, 6, periph)
/* pb8_scom2p3_in */
#define PB8_SCOM2P3_IN         MCHP_PINMUX(b, 8, 0x6c, 18, periph)
/* pb8_scom2p3_out */
#define PB8_SCOM2P3_OUT        MCHP_PINMUX(b, 8, 0x31c, 5, periph)
/* pb8_scom3p0_in */
#define PB8_SCOM3P0_IN         MCHP_PINMUX(b, 8, 0x70, 5, periph)
/* pb8_scom3p0_out */
#define PB8_SCOM3P0_OUT        MCHP_PINMUX(b, 8, 0x31c, 7, periph)
/* pb8_scom3p1_in */
#define PB8_SCOM3P1_IN         MCHP_PINMUX(b, 8, 0x74, 10, periph)
/* pb8_scom3p1_out */
#define PB8_SCOM3P1_OUT        MCHP_PINMUX(b, 8, 0x328, 4, periph)
/* pb8_scom3p2_in */
#define PB8_SCOM3P2_IN         MCHP_PINMUX(b, 8, 0x78, 18, periph)
/* pb8_scom3p2_out */
#define PB8_SCOM3P2_OUT        MCHP_PINMUX(b, 8, 0x31c, 8, periph)
/* pb8_scom3p3_in */
#define PB8_SCOM3P3_IN         MCHP_PINMUX(b, 8, 0x7c, 23, periph)
/* pb8_scom3p3_out */
#define PB8_SCOM3P3_OUT        MCHP_PINMUX(b, 8, 0x320, 10, periph)
/* pb8_scom4p0_in */
#define PB8_SCOM4P0_IN         MCHP_PINMUX(b, 8, 0x80, 23, periph)
/* pb8_scom4p0_out */
#define PB8_SCOM4P0_OUT        MCHP_PINMUX(b, 8, 0x320, 12, periph)
/* pb8_scom4p1_in */
#define PB8_SCOM4P1_IN         MCHP_PINMUX(b, 8, 0x84, 10, periph)
/* pb8_scom4p1_out */
#define PB8_SCOM4P1_OUT        MCHP_PINMUX(b, 8, 0x328, 5, periph)
/* pb8_scom4p2_out */
#define PB8_SCOM4P2_OUT        MCHP_PINMUX(b, 8, 0x31c, 10, periph)
/* pb8_scom4p3_in */
#define PB8_SCOM4P3_IN         MCHP_PINMUX(b, 8, 0x8c, 18, periph)
/* pb8_scom4p3_out */
#define PB8_SCOM4P3_OUT        MCHP_PINMUX(b, 8, 0x31c, 9, periph)
/* pb8_scom5p0_in */
#define PB8_SCOM5P0_IN         MCHP_PINMUX(b, 8, 0x90, 5, periph)
/* pb8_scom5p0_out */
#define PB8_SCOM5P0_OUT        MCHP_PINMUX(b, 8, 0x31c, 11, periph)
/* pb8_scom5p1_in */
#define PB8_SCOM5P1_IN         MCHP_PINMUX(b, 8, 0x94, 10, periph)
/* pb8_scom5p1_out */
#define PB8_SCOM5P1_OUT        MCHP_PINMUX(b, 8, 0x328, 6, periph)
/* pb8_scom5p2_in */
#define PB8_SCOM5P2_IN         MCHP_PINMUX(b, 8, 0x98, 18, periph)
/* pb8_scom5p2_out */
#define PB8_SCOM5P2_OUT        MCHP_PINMUX(b, 8, 0x31c, 12, periph)
/* pb8_scom5p3_in */
#define PB8_SCOM5P3_IN         MCHP_PINMUX(b, 8, 0x9c, 23, periph)
/* pb8_scom5p3_out */
#define PB8_SCOM5P3_OUT        MCHP_PINMUX(b, 8, 0x320, 15, periph)
/* pb8_tc0wo0g1_in */
#define PB8_TC0WO0G1_IN        MCHP_PINMUX(b, 8, 0xcc, 18, periph)
/* pb8_tc0wo0g2_in */
#define PB8_TC0WO0G2_IN        MCHP_PINMUX(b, 8, 0xd0, 23, periph)
/* pb8_tc0wo0_out */
#define PB8_TC0WO0_OUT         MCHP_PINMUX(b, 8, 0x324, 24, periph)
/* pb8_tc0wo1g3_in */
#define PB8_TC0WO1G3_IN        MCHP_PINMUX(b, 8, 0xd4, 5, periph)
/* pb8_tc0wo1_out */
