zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62132-pinctrl.h
#define PB13_EXTINT1_IN        MCHP_PINMUX(b, 13, 0x4, 20, periph)
/* pb13_extint2_in */
#define PB13_EXTINT2_IN        MCHP_PINMUX(b, 13, 0x8, 6, periph)
/* pb13_fectrl0_out */
#define PB13_FECTRL0_OUT       MCHP_PINMUX(b, 13, 0x354, 40, periph)
/* pb13_fectrl4_out */
#define PB13_FECTRL4_OUT       MCHP_PINMUX(b, 13, 0x358, 42, periph)
/* pb13_qd0_out */
#define PB13_QD0_OUT           MCHP_PINMUX(b, 13, 0x354, 35, periph)
/* pb13_qd1_out */
#define PB13_QD1_OUT           MCHP_PINMUX(b, 13, 0x358, 35, periph)
/* pb13_qd2_in */
#define PB13_QD2_IN            MCHP_PINMUX(b, 13, 0xa8, 20, periph)
/* pb13_qd2_out */
#define PB13_QD2_OUT           MCHP_PINMUX(b, 13, 0x354, 37, periph)
/* pb13_qd3_in */
#define PB13_QD3_IN            MCHP_PINMUX(b, 13, 0xac, 6, periph)
/* pb13_qd3_out */
#define PB13_QD3_OUT           MCHP_PINMUX(b, 13, 0x354, 36, periph)
/* pb13_qeihome0g2_in */
#define PB13_QEIHOME0G2_IN     MCHP_PINMUX(b, 13, 0x170, 20, periph)
/* pb13_qeiindx0g2_in */
#define PB13_QEIINDX0G2_IN     MCHP_PINMUX(b, 13, 0x174, 20, periph)
/* pb13_qeiindx0g3_in */
#define PB13_QEIINDX0G3_IN     MCHP_PINMUX(b, 13, 0x178, 6, periph)
/* pb13_qeiqea0g3_in */
#define PB13_QEIQEA0G3_IN      MCHP_PINMUX(b, 13, 0x17c, 6, periph)
/* pb13_qspics_out */
#define PB13_QSPICS_OUT        MCHP_PINMUX(b, 13, 0x354, 34, periph)
/* pb13_scom0p0_in */
#define PB13_SCOM0P0_IN        MCHP_PINMUX(b, 13, 0x40, 20, periph)
/* pb13_scom0p0_out */
#define PB13_SCOM0P0_OUT       MCHP_PINMUX(b, 13, 0x354, 2, periph)
/* pb13_scom0p2_out */
#define PB13_SCOM0P2_OUT       MCHP_PINMUX(b, 13, 0x354, 4, periph)
/* pb13_scom0p3_out */
#define PB13_SCOM0P3_OUT       MCHP_PINMUX(b, 13, 0x354, 3, periph)
/* pb13_scom1p0_in */
#define PB13_SCOM1P0_IN        MCHP_PINMUX(b, 13, 0x50, 6, periph)
/* pb13_scom1p0_out */
#define PB13_SCOM1P0_OUT       MCHP_PINMUX(b, 13, 0x358, 5, periph)
/* pb13_scom1p2_out */
#define PB13_SCOM1P2_OUT       MCHP_PINMUX(b, 13, 0x354, 6, periph)
/* pb13_scom1p3_in */
#define PB13_SCOM1P3_IN        MCHP_PINMUX(b, 13, 0x5c, 20, periph)
/* pb13_scom1p3_out */
#define PB13_SCOM1P3_OUT       MCHP_PINMUX(b, 13, 0x354, 5, periph)
/* pb13_scom2p0_in */
#define PB13_SCOM2P0_IN        MCHP_PINMUX(b, 13, 0x60, 20, periph)
/* pb13_scom2p0_out */
#define PB13_SCOM2P0_OUT       MCHP_PINMUX(b, 13, 0x354, 7, periph)
/* pb13_scom2p2_out */
#define PB13_SCOM2P2_OUT       MCHP_PINMUX(b, 13, 0x354, 9, periph)
/* pb13_scom2p3_out */
#define PB13_SCOM2P3_OUT       MCHP_PINMUX(b, 13, 0x354, 8, periph)
/* pb13_scom3p0_in */
#define PB13_SCOM3P0_IN        MCHP_PINMUX(b, 13, 0x70, 6, periph)
/* pb13_scom3p0_out */
#define PB13_SCOM3P0_OUT       MCHP_PINMUX(b, 13, 0x358, 10, periph)
/* pb13_scom3p2_out */
#define PB13_SCOM3P2_OUT       MCHP_PINMUX(b, 13, 0x354, 11, periph)
/* pb13_scom3p3_in */
#define PB13_SCOM3P3_IN        MCHP_PINMUX(b, 13, 0x7c, 20, periph)
/* pb13_scom3p3_out */
#define PB13_SCOM3P3_OUT       MCHP_PINMUX(b, 13, 0x354, 10, periph)
/* pb13_scom4p0_in */
#define PB13_SCOM4P0_IN        MCHP_PINMUX(b, 13, 0x80, 20, periph)
/* pb13_scom4p0_out */
#define PB13_SCOM4P0_OUT       MCHP_PINMUX(b, 13, 0x354, 12, periph)
/* pb13_scom4p2_out */
#define PB13_SCOM4P2_OUT       MCHP_PINMUX(b, 13, 0x354, 14, periph)
/* pb13_scom4p3_out */
#define PB13_SCOM4P3_OUT       MCHP_PINMUX(b, 13, 0x354, 13, periph)
/* pb13_scom5p0_in */
#define PB13_SCOM5P0_IN        MCHP_PINMUX(b, 13, 0x90, 6, periph)
/* pb13_scom5p0_out */
#define PB13_SCOM5P0_OUT       MCHP_PINMUX(b, 13, 0x358, 15, periph)
/* pb13_scom5p2_out */
#define PB13_SCOM5P2_OUT       MCHP_PINMUX(b, 13, 0x354, 16, periph)
/* pb13_scom5p3_in */
#define PB13_SCOM5P3_IN        MCHP_PINMUX(b, 13, 0x9c, 20, periph)
/* pb13_scom5p3_out */
#define PB13_SCOM5P3_OUT       MCHP_PINMUX(b, 13, 0x354, 15, periph)
/* pb13_tc0wo0g2_in */
#define PB13_TC0WO0G2_IN       MCHP_PINMUX(b, 13, 0xd0, 20, periph)
/* pb13_tc0wo0_out */
#define PB13_TC0WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 24, periph)
/* pb13_tc0wo1g3_in */
#define PB13_TC0WO1G3_IN       MCHP_PINMUX(b, 13, 0xd4, 6, periph)
/* pb13_tc0wo1_out */
#define PB13_TC0WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 24, periph)
/* pb13_tc1wo0_out */
#define PB13_TC1WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 25, periph)
/* pb13_tc1wo1g2_in */
#define PB13_TC1WO1G2_IN       MCHP_PINMUX(b, 13, 0xe4, 20, periph)
/* pb13_tc1wo1_out */
#define PB13_TC1WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 25, periph)
/* pb13_tc2wo0g3_in */
#define PB13_TC2WO0G3_IN       MCHP_PINMUX(b, 13, 0xf0, 6, periph)
/* pb13_tc2wo0_out */
#define PB13_TC2WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 26, periph)
/* pb13_tc2wo1g2_in */
#define PB13_TC2WO1G2_IN       MCHP_PINMUX(b, 13, 0xf4, 20, periph)
/* pb13_tc2wo1_out */
#define PB13_TC2WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 26, periph)
/* pb13_tc3wo0g3_in */
#define PB13_TC3WO0G3_IN       MCHP_PINMUX(b, 13, 0x100, 6, periph)
/* pb13_tc3wo0_out */
#define PB13_TC3WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 27, periph)
/* pb13_tc3wo1g2_in */
#define PB13_TC3WO1G2_IN       MCHP_PINMUX(b, 13, 0x104, 20, periph)
/* pb13_tc3wo1_out */
#define PB13_TC3WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 27, periph)
/* pb13_tc4wo0g3_in */
#define PB13_TC4WO0G3_IN       MCHP_PINMUX(b, 13, 0x110, 6, periph)
/* pb13_tc4wo0_out */
#define PB13_TC4WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 28, periph)
/* pb13_tc4wo1g2_in */
#define PB13_TC4WO1G2_IN       MCHP_PINMUX(b, 13, 0x114, 20, periph)
/* pb13_tc4wo1_out */
#define PB13_TC4WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 28, periph)
/* pb13_tc5wo0g3_in */
#define PB13_TC5WO0G3_IN       MCHP_PINMUX(b, 13, 0x120, 6, periph)
/* pb13_tc5wo0_out */
#define PB13_TC5WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 29, periph)
/* pb13_tc5wo1g2_in */
#define PB13_TC5WO1G2_IN       MCHP_PINMUX(b, 13, 0x124, 20, periph)
/* pb13_tc5wo1_out */
#define PB13_TC5WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 29, periph)
/* pb13_tc6wo0g3_in */
#define PB13_TC6WO0G3_IN       MCHP_PINMUX(b, 13, 0x130, 6, periph)
/* pb13_tc6wo0_out */
#define PB13_TC6WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 30, periph)
/* pb13_tc6wo1g2_in */
#define PB13_TC6WO1G2_IN       MCHP_PINMUX(b, 13, 0x134, 20, periph)
/* pb13_tc6wo1_out */
#define PB13_TC6WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 30, periph)
/* pb13_tc7wo0g3_in */
#define PB13_TC7WO0G3_IN       MCHP_PINMUX(b, 13, 0x140, 6, periph)
/* pb13_tc7wo0_out */
#define PB13_TC7WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 31, periph)
/* pb13_tc7wo1g2_in */
#define PB13_TC7WO1G2_IN       MCHP_PINMUX(b, 13, 0x144, 20, periph)
/* pb13_tc7wo1_out */
#define PB13_TC7WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 31, periph)
/* pb13_tc8wo0g3_in */
#define PB13_TC8WO0G3_IN       MCHP_PINMUX(b, 13, 0x150, 6, periph)
/* pb13_tc8wo0_out */
#define PB13_TC8WO0_OUT        MCHP_PINMUX(b, 13, 0x358, 32, periph)
/* pb13_tc8wo1g2_in */
#define PB13_TC8WO1G2_IN       MCHP_PINMUX(b, 13, 0x154, 20, periph)
/* pb13_tc8wo1_out */
#define PB13_TC8WO1_OUT        MCHP_PINMUX(b, 13, 0x354, 32, periph)
/* pb13_tc9wo0g2_in */
#define PB13_TC9WO0G2_IN       MCHP_PINMUX(b, 13, 0x15c, 20, periph)
/* pb13_tc9wo0_out */
#define PB13_TC9WO0_OUT        MCHP_PINMUX(b, 13, 0x354, 33, periph)
/* pb13_tc9wo1g3_in */
#define PB13_TC9WO1G3_IN       MCHP_PINMUX(b, 13, 0x164, 6, periph)
/* pb13_tc9wo1_out */
#define PB13_TC9WO1_OUT        MCHP_PINMUX(b, 13, 0x358, 33, periph)
/* pb13_tcc0wo0_out */
#define PB13_TCC0WO0_OUT       MCHP_PINMUX(b, 13, 0x358, 18, periph)
/* pb13_tcc0wo1_out */
#define PB13_TCC0WO1_OUT       MCHP_PINMUX(b, 13, 0x354, 17, periph)
/* pb13_tcc0wo2_out */
#define PB13_TCC0WO2_OUT       MCHP_PINMUX(b, 13, 0x358, 17, periph)
/* pb13_tcc0wo3_out */
#define PB13_TCC0WO3_OUT       MCHP_PINMUX(b, 13, 0x354, 19, periph)
/* pb13_tcc0wo4_out */
#define PB13_TCC0WO4_OUT       MCHP_PINMUX(b, 13, 0x358, 19, periph)
/* pb13_tcc0wo5_out */
#define PB13_TCC0WO5_OUT       MCHP_PINMUX(b, 13, 0x354, 18, periph)
/* pb13_tcc1wo0_out */
#define PB13_TCC1WO0_OUT       MCHP_PINMUX(b, 13, 0x358, 21, periph)
/* pb13_tcc1wo1_out */
#define PB13_TCC1WO1_OUT       MCHP_PINMUX(b, 13, 0x354, 20, periph)
/* pb13_tcc1wo2_out */
#define PB13_TCC1WO2_OUT       MCHP_PINMUX(b, 13, 0x358, 20, periph)
/* pb13_tcc1wo3_out */
#define PB13_TCC1WO3_OUT       MCHP_PINMUX(b, 13, 0x354, 22, periph)
/* pb13_tcc1wo4_out */
#define PB13_TCC1WO4_OUT       MCHP_PINMUX(b, 13, 0x358, 22, periph)
/* pb13_tcc1wo5_out */
#define PB13_TCC1WO5_OUT       MCHP_PINMUX(b, 13, 0x354, 21, periph)
/* pb13_tcc2wo0_out */
#define PB13_TCC2WO0_OUT       MCHP_PINMUX(b, 13, 0x358, 23, periph)
/* pb13_tcc2wo1_out */
#define PB13_TCC2WO1_OUT       MCHP_PINMUX(b, 13, 0x354, 23, periph)
/* pb13_tstbus1_out */
#define PB13_TSTBUS1_OUT       MCHP_PINMUX(b, 13, 0x358, 38, periph)
/* pb13_tstbus5_out */
#define PB13_TSTBUS5_OUT       MCHP_PINMUX(b, 13, 0x354, 38, periph)
/* pb13_tstbus9_out */
#define PB13_TSTBUS9_OUT       MCHP_PINMUX(b, 13, 0x354, 39, periph)
/* pb13_tstbus10_out */
#define PB13_TSTBUS10_OUT      MCHP_PINMUX(b, 13, 0x358, 39, periph)
/* pb14_cclo0_out */
#define PB14_CCLO0_OUT         MCHP_PINMUX(b, 14, 0x35c, 1, periph)
/* pb14_gmac_tsucomp_out */
#define PB14_GMAC_TSUCOMP_OUT  MCHP_PINMUX(b, 14, 0x35c, 14, periph)
/* pb14_qeiccmp0_out */
#define PB14_QEICCMP0_OUT      MCHP_PINMUX(b, 14, 0x35c, 13, periph)
/* pb14_qeiqeb0g5_in */
#define PB14_QEIQEB0G5_IN      MCHP_PINMUX(b, 14, 0x188, 15, periph)
/* pb14_qspics_out */
#define PB14_QSPICS_OUT        MCHP_PINMUX(b, 14, 0x35c, 12, periph)
/* pb14_scom1p3_out */
#define PB14_SCOM1P3_OUT       MCHP_PINMUX(b, 14, 0x35c, 2, periph)
/* pb14_scom2p0_out */
#define PB14_SCOM2P0_OUT       MCHP_PINMUX(b, 14, 0x35c, 3, periph)
/* pb14_tc8wo1g5_in */
#define PB14_TC8WO1G5_IN       MCHP_PINMUX(b, 14, 0x158, 15, periph)
/* pb14_tc8wo1_out */
#define PB14_TC8WO1_OUT        MCHP_PINMUX(b, 14, 0x35c, 10, periph)
/* pb14_tc9wo1g5_in */
#define PB14_TC9WO1G5_IN       MCHP_PINMUX(b, 14, 0x168, 15, periph)
/* pb14_tc9wo1_out */
#define PB14_TC9WO1_OUT        MCHP_PINMUX(b, 14, 0x35c, 11, periph)
/* pb14_tcc0wo1_out */
#define PB14_TCC0WO1_OUT       MCHP_PINMUX(b, 14, 0x35c, 6, periph)
/* pb14_tcc0wo2_out */
#define PB14_TCC0WO2_OUT       MCHP_PINMUX(b, 14, 0x35c, 5, periph)
/* pb14_tcc0wo4_out */
#define PB14_TCC0WO4_OUT       MCHP_PINMUX(b, 14, 0x35c, 4, periph)
/* pb14_tcc1wo1_out */
#define PB14_TCC1WO1_OUT       MCHP_PINMUX(b, 14, 0x35c, 9, periph)
/* pb14_tcc1wo2_out */
#define PB14_TCC1WO2_OUT       MCHP_PINMUX(b, 14, 0x35c, 8, periph)
/* pb14_tcc1wo4_out */
#define PB14_TCC1WO4_OUT       MCHP_PINMUX(b, 14, 0x35c, 7, periph)
/* pb14_tstbus3_out */
#define PB14_TSTBUS3_OUT       MCHP_PINMUX(b, 14, 0x35c, 15, periph)
/* pb14_tstbus7_out */
#define PB14_TSTBUS7_OUT       MCHP_PINMUX(b, 14, 0x35c, 16, periph)
/* pb14_tstbus11_out */
#define PB14_TSTBUS11_OUT      MCHP_PINMUX(b, 14, 0x35c, 17, periph)
/* pb15_cclo0_out */
#define PB15_CCLO0_OUT         MCHP_PINMUX(b, 15, 0x360, 1, periph)
/* pb15_gmac_tsucomp_out */
#define PB15_GMAC_TSUCOMP_OUT  MCHP_PINMUX(b, 15, 0x360, 14, periph)
/* pb15_qeiccmp0_out */
#define PB15_QEICCMP0_OUT      MCHP_PINMUX(b, 15, 0x360, 13, periph)
/* pb15_qeiqeb0g5_in */
#define PB15_QEIQEB0G5_IN      MCHP_PINMUX(b, 15, 0x188, 16, periph)
/* pb15_qspics_out */
#define PB15_QSPICS_OUT        MCHP_PINMUX(b, 15, 0x360, 12, periph)
/* pb15_scom1p3_out */
#define PB15_SCOM1P3_OUT       MCHP_PINMUX(b, 15, 0x360, 2, periph)
/* pb15_scom2p0_out */
#define PB15_SCOM2P0_OUT       MCHP_PINMUX(b, 15, 0x360, 3, periph)
/* pb15_tc8wo1g5_in */
#define PB15_TC8WO1G5_IN       MCHP_PINMUX(b, 15, 0x158, 16, periph)
/* pb15_tc8wo1_out */
#define PB15_TC8WO1_OUT        MCHP_PINMUX(b, 15, 0x360, 10, periph)
/* pb15_tc9wo1g5_in */
#define PB15_TC9WO1G5_IN       MCHP_PINMUX(b, 15, 0x168, 16, periph)
/* pb15_tc9wo1_out */
#define PB15_TC9WO1_OUT        MCHP_PINMUX(b, 15, 0x360, 11, periph)
/* pb15_tcc0wo1_out */
#define PB15_TCC0WO1_OUT       MCHP_PINMUX(b, 15, 0x360, 6, periph)
/* pb15_tcc0wo2_out */
#define PB15_TCC0WO2_OUT       MCHP_PINMUX(b, 15, 0x360, 5, periph)
/* pb15_tcc0wo4_out */
#define PB15_TCC0WO4_OUT       MCHP_PINMUX(b, 15, 0x360, 4, periph)
/* pb15_tcc1wo1_out */
#define PB15_TCC1WO1_OUT       MCHP_PINMUX(b, 15, 0x360, 9, periph)
/* pb15_tcc1wo2_out */
#define PB15_TCC1WO2_OUT       MCHP_PINMUX(b, 15, 0x360, 8, periph)
/* pb15_tcc1wo4_out */
#define PB15_TCC1WO4_OUT       MCHP_PINMUX(b, 15, 0x360, 7, periph)
/* pb15_tstbus3_out */
#define PB15_TSTBUS3_OUT       MCHP_PINMUX(b, 15, 0x360, 15, periph)
/* pb15_tstbus7_out */
#define PB15_TSTBUS7_OUT       MCHP_PINMUX(b, 15, 0x360, 16, periph)
/* pb15_tstbus11_out */
#define PB15_TSTBUS11_OUT      MCHP_PINMUX(b, 15, 0x360, 17, periph)
/* pc0_accmpten_in */
#define PC0_ACCMPTEN_IN        MCHP_PINMUX(c, 0, 0x18c, 7, periph)
/* pc0_cclin0_in */
#define PC0_CCLIN0_IN          MCHP_PINMUX(c, 0, 0xb4, 7, periph)
/* pc0_cclin1_in */
#define PC0_CCLIN1_IN          MCHP_PINMUX(c, 0, 0xb8, 12, periph)
/* pc0_cclin3_in */
#define PC0_CCLIN3_IN          MCHP_PINMUX(c, 0, 0xc0, 7, periph)
/* pc0_cclin4_in */
#define PC0_CCLIN4_IN          MCHP_PINMUX(c, 0, 0xc4, 12, periph)
/* pc0_cclo1_out */
#define PC0_CCLO1_OUT          MCHP_PINMUX(c, 0, 0x368, 1, periph)
/* pc0_coex_bt_state_out */
#define PC0_COEX_BT_STATE_OUT  MCHP_PINMUX(c, 0, 0x364, 37, periph)
/* pc0_coex_rf_act_out */
#define PC0_COEX_RF_ACT_OUT    MCHP_PINMUX(c, 0, 0x368, 41, periph)
/* pc0_extint0_in */
#define PC0_EXTINT0_IN         MCHP_PINMUX(c, 0, 0x0, 7, periph)
/* pc0_extint1_in */
#define PC0_EXTINT1_IN         MCHP_PINMUX(c, 0, 0x4, 12, periph)
/* pc0_fectrl0_out */
#define PC0_FECTRL0_OUT        MCHP_PINMUX(c, 0, 0x368, 40, periph)
/* pc0_fectrl1_out */
#define PC0_FECTRL1_OUT        MCHP_PINMUX(c, 0, 0x364, 35, periph)
/* pc0_fectrl2_out */
#define PC0_FECTRL2_OUT        MCHP_PINMUX(c, 0, 0x364, 36, periph)
/* pc0_qd0_out */
#define PC0_QD0_OUT            MCHP_PINMUX(c, 0, 0x368, 35, periph)
/* pc0_qd1_in */
#define PC0_QD1_IN             MCHP_PINMUX(c, 0, 0xa4, 7, periph)
/* pc0_qd1_out */
#define PC0_QD1_OUT            MCHP_PINMUX(c, 0, 0x364, 30, periph)
/* pc0_qd2_in */
#define PC0_QD2_IN             MCHP_PINMUX(c, 0, 0xa8, 12, periph)
/* pc0_qd2_out */
#define PC0_QD2_OUT            MCHP_PINMUX(c, 0, 0x364, 29, periph)
/* pc0_qd3_out */
#define PC0_QD3_OUT            MCHP_PINMUX(c, 0, 0x364, 28, periph)
/* pc0_qeiccmp0_out */
#define PC0_QEICCMP0_OUT       MCHP_PINMUX(c, 0, 0x364, 31, periph)
/* pc0_qeihome0g1_in */
#define PC0_QEIHOME0G1_IN      MCHP_PINMUX(c, 0, 0x16c, 7, periph)
/* pc0_qeihome0g2_in */
#define PC0_QEIHOME0G2_IN      MCHP_PINMUX(c, 0, 0x170, 12, periph)
/* pc0_qeiindx0g2_in */
#define PC0_QEIINDX0G2_IN      MCHP_PINMUX(c, 0, 0x174, 12, periph)
/* pc0_qspics_out */
#define PC0_QSPICS_OUT         MCHP_PINMUX(c, 0, 0x364, 27, periph)
/* pc0_scom0p0_in */
#define PC0_SCOM0P0_IN         MCHP_PINMUX(c, 0, 0x40, 12, periph)
/* pc0_scom0p0_out */
#define PC0_SCOM0P0_OUT        MCHP_PINMUX(c, 0, 0x368, 2, periph)
/* pc0_scom0p2_out */
#define PC0_SCOM0P2_OUT        MCHP_PINMUX(c, 0, 0x364, 2, periph)
/* pc0_scom0p3_in */
#define PC0_SCOM0P3_IN         MCHP_PINMUX(c, 0, 0x4c, 7, periph)
/* pc0_scom0p3_out */
#define PC0_SCOM0P3_OUT        MCHP_PINMUX(c, 0, 0x364, 1, periph)
/* pc0_scom1p0_out */
#define PC0_SCOM1P0_OUT        MCHP_PINMUX(c, 0, 0x364, 3, periph)
/* pc0_scom1p2_in */
#define PC0_SCOM1P2_IN         MCHP_PINMUX(c, 0, 0x58, 7, periph)
/* pc0_scom1p2_out */
#define PC0_SCOM1P2_OUT        MCHP_PINMUX(c, 0, 0x364, 4, periph)
/* pc0_scom1p3_in */
#define PC0_SCOM1P3_IN         MCHP_PINMUX(c, 0, 0x5c, 12, periph)
/* pc0_scom1p3_out */
#define PC0_SCOM1P3_OUT        MCHP_PINMUX(c, 0, 0x368, 5, periph)
/* pc0_scom2p0_in */
#define PC0_SCOM2P0_IN         MCHP_PINMUX(c, 0, 0x60, 12, periph)
/* pc0_scom2p0_out */
#define PC0_SCOM2P0_OUT        MCHP_PINMUX(c, 0, 0x368, 7, periph)
/* pc0_scom2p2_out */
#define PC0_SCOM2P2_OUT        MCHP_PINMUX(c, 0, 0x364, 6, periph)
/* pc0_scom2p3_in */
#define PC0_SCOM2P3_IN         MCHP_PINMUX(c, 0, 0x6c, 7, periph)
/* pc0_scom2p3_out */
#define PC0_SCOM2P3_OUT        MCHP_PINMUX(c, 0, 0x364, 5, periph)
/* pc0_scom3p0_out */
#define PC0_SCOM3P0_OUT        MCHP_PINMUX(c, 0, 0x364, 7, periph)
/* pc0_scom3p2_in */
#define PC0_SCOM3P2_IN         MCHP_PINMUX(c, 0, 0x78, 7, periph)
/* pc0_scom3p2_out */
#define PC0_SCOM3P2_OUT        MCHP_PINMUX(c, 0, 0x364, 8, periph)
/* pc0_scom3p3_in */
#define PC0_SCOM3P3_IN         MCHP_PINMUX(c, 0, 0x7c, 12, periph)
/* pc0_scom3p3_out */
#define PC0_SCOM3P3_OUT        MCHP_PINMUX(c, 0, 0x368, 10, periph)
/* pc0_scom4p0_in */
#define PC0_SCOM4P0_IN         MCHP_PINMUX(c, 0, 0x80, 12, periph)
/* pc0_scom4p0_out */
#define PC0_SCOM4P0_OUT        MCHP_PINMUX(c, 0, 0x368, 12, periph)
/* pc0_scom4p2_out */
#define PC0_SCOM4P2_OUT        MCHP_PINMUX(c, 0, 0x364, 10, periph)
/* pc0_scom4p3_in */
#define PC0_SCOM4P3_IN         MCHP_PINMUX(c, 0, 0x8c, 7, periph)
/* pc0_scom4p3_out */
#define PC0_SCOM4P3_OUT        MCHP_PINMUX(c, 0, 0x364, 9, periph)
/* pc0_scom5p0_out */
#define PC0_SCOM5P0_OUT        MCHP_PINMUX(c, 0, 0x364, 11, periph)
/* pc0_scom5p2_in */
#define PC0_SCOM5P2_IN         MCHP_PINMUX(c, 0, 0x98, 7, periph)
/* pc0_scom5p2_out */
#define PC0_SCOM5P2_OUT        MCHP_PINMUX(c, 0, 0x364, 12, periph)
/* pc0_scom5p3_in */
#define PC0_SCOM5P3_IN         MCHP_PINMUX(c, 0, 0x9c, 12, periph)
/* pc0_scom5p3_out */
#define PC0_SCOM5P3_OUT        MCHP_PINMUX(c, 0, 0x368, 15, periph)
/* pc0_tc0wo0g1_in */
#define PC0_TC0WO0G1_IN        MCHP_PINMUX(c, 0, 0xcc, 7, periph)
/* pc0_tc0wo0g2_in */
#define PC0_TC0WO0G2_IN        MCHP_PINMUX(c, 0, 0xd0, 12, periph)
/* pc0_tc0wo1_out */
#define PC0_TC0WO1_OUT         MCHP_PINMUX(c, 0, 0x364, 18, periph)
/* pc0_tc1wo0g1_in */
#define PC0_TC1WO0G1_IN        MCHP_PINMUX(c, 0, 0xdc, 7, periph)
/* pc0_tc1wo0_out */
#define PC0_TC1WO0_OUT         MCHP_PINMUX(c, 0, 0x364, 19, periph)
/* pc0_tc1wo1g2_in */
#define PC0_TC1WO1G2_IN        MCHP_PINMUX(c, 0, 0xe4, 12, periph)
/* pc0_tc1wo1_out */
#define PC0_TC1WO1_OUT         MCHP_PINMUX(c, 0, 0x368, 25, periph)
/* pc0_tc2wo0g1_in */
#define PC0_TC2WO0G1_IN        MCHP_PINMUX(c, 0, 0xec, 7, periph)
/* pc0_tc2wo0_out */
#define PC0_TC2WO0_OUT         MCHP_PINMUX(c, 0, 0x364, 20, periph)
/* pc0_tc2wo1g2_in */
#define PC0_TC2WO1G2_IN        MCHP_PINMUX(c, 0, 0xf4, 12, periph)
/* pc0_tc2wo1_out */
#define PC0_TC2WO1_OUT         MCHP_PINMUX(c, 0, 0x368, 26, periph)
/* pc0_tc3wo0g1_in */
#define PC0_TC3WO0G1_IN        MCHP_PINMUX(c, 0, 0xfc, 7, periph)
/* pc0_tc3wo0_out */
#define PC0_TC3WO0_OUT         MCHP_PINMUX(c, 0, 0x364, 21, periph)
/* pc0_tc3wo1g2_in */
#define PC0_TC3WO1G2_IN        MCHP_PINMUX(c, 0, 0x104, 12, periph)
/* pc0_tc3wo1_out */
#define PC0_TC3WO1_OUT         MCHP_PINMUX(c, 0, 0x368, 27, periph)
/* pc0_tc4wo0g1_in */
#define PC0_TC4WO0G1_IN        MCHP_PINMUX(c, 0, 0x10c, 7, periph)
/* pc0_tc4wo0_out */
#define PC0_TC4WO0_OUT         MCHP_PINMUX(c, 0, 0x364, 22, periph)
/* pc0_tc4wo1g2_in */
#define PC0_TC4WO1G2_IN        MCHP_PINMUX(c, 0, 0x114, 12, periph)
/* pc0_tc4wo1_out */
#define PC0_TC4WO1_OUT         MCHP_PINMUX(c, 0, 0x368, 28, periph)
/* pc0_tc5wo0g1_in */
#define PC0_TC5WO0G1_IN        MCHP_PINMUX(c, 0, 0x11c, 7, periph)
/* pc0_tc5wo0_out */
#define PC0_TC5WO0_OUT         MCHP_PINMUX(c, 0, 0x364, 23, periph)
/* pc0_tc5wo1g2_in */
#define PC0_TC5WO1G2_IN        MCHP_PINMUX(c, 0, 0x124, 12, periph)
/* pc0_tc5wo1_out */
#define PC0_TC5WO1_OUT         MCHP_PINMUX(c, 0, 0x368, 29, periph)
/* pc0_tc6wo0g1_in */
#define PC0_TC6WO0G1_IN        MCHP_PINMUX(c, 0, 0x12c, 7, periph)
/* pc0_tc6wo0_out */
#define PC0_TC6WO0_OUT         MCHP_PINMUX(c, 0, 0x364, 24, periph)
/* pc0_tc6wo1g2_in */
#define PC0_TC6WO1G2_IN        MCHP_PINMUX(c, 0, 0x134, 12, periph)
/* pc0_tc6wo1_out */
#define PC0_TC6WO1_OUT         MCHP_PINMUX(c, 0, 0x368, 30, periph)
/* pc0_tc7wo0g1_in */
#define PC0_TC7WO0G1_IN        MCHP_PINMUX(c, 0, 0x13c, 7, periph)
/* pc0_tc7wo0_out */
#define PC0_TC7WO0_OUT         MCHP_PINMUX(c, 0, 0x364, 25, periph)
/* pc0_tc7wo1g2_in */
#define PC0_TC7WO1G2_IN        MCHP_PINMUX(c, 0, 0x144, 12, periph)
/* pc0_tc7wo1_out */
#define PC0_TC7WO1_OUT         MCHP_PINMUX(c, 0, 0x368, 31, periph)
/* pc0_tc8wo0g1_in */
#define PC0_TC8WO0G1_IN        MCHP_PINMUX(c, 0, 0x14c, 7, periph)
/* pc0_tc8wo0_out */
#define PC0_TC8WO0_OUT         MCHP_PINMUX(c, 0, 0x364, 26, periph)
/* pc0_tc8wo1g2_in */
#define PC0_TC8WO1G2_IN        MCHP_PINMUX(c, 0, 0x154, 12, periph)
/* pc0_tc8wo1_out */
#define PC0_TC8WO1_OUT         MCHP_PINMUX(c, 0, 0x368, 32, periph)
/* pc0_tc9wo0g2_in */
#define PC0_TC9WO0G2_IN        MCHP_PINMUX(c, 0, 0x15c, 12, periph)
/* pc0_tc9wo0_out */
#define PC0_TC9WO0_OUT         MCHP_PINMUX(c, 0, 0x368, 33, periph)
/* pc0_tcc0wo0_out */
#define PC0_TCC0WO0_OUT        MCHP_PINMUX(c, 0, 0x364, 13, periph)
/* pc0_tcc0wo1_out */
#define PC0_TCC0WO1_OUT        MCHP_PINMUX(c, 0, 0x368, 17, periph)
/* pc0_tcc0wo3_out */
#define PC0_TCC0WO3_OUT        MCHP_PINMUX(c, 0, 0x368, 19, periph)
/* pc0_tcc0wo4_out */
#define PC0_TCC0WO4_OUT        MCHP_PINMUX(c, 0, 0x364, 14, periph)
/* pc0_tcc0wo5_out */
#define PC0_TCC0WO5_OUT        MCHP_PINMUX(c, 0, 0x368, 18, periph)
/* pc0_tcc1wo0_out */
#define PC0_TCC1WO0_OUT        MCHP_PINMUX(c, 0, 0x364, 15, periph)
/* pc0_tcc1wo1_out */
#define PC0_TCC1WO1_OUT        MCHP_PINMUX(c, 0, 0x368, 20, periph)
/* pc0_tcc1wo3_out */
#define PC0_TCC1WO3_OUT        MCHP_PINMUX(c, 0, 0x368, 22, periph)
/* pc0_tcc1wo4_out */
#define PC0_TCC1WO4_OUT        MCHP_PINMUX(c, 0, 0x364, 16, periph)
/* pc0_tcc1wo5_out */
#define PC0_TCC1WO5_OUT        MCHP_PINMUX(c, 0, 0x368, 21, periph)
/* pc0_tcc2wo0_out */
#define PC0_TCC2WO0_OUT        MCHP_PINMUX(c, 0, 0x364, 17, periph)
/* pc0_tcc2wo1_out */
#define PC0_TCC2WO1_OUT        MCHP_PINMUX(c, 0, 0x368, 23, periph)
/* pc0_tstbus0_out */
#define PC0_TSTBUS0_OUT        MCHP_PINMUX(c, 0, 0x364, 32, periph)
/* pc0_tstbus4_out */
#define PC0_TSTBUS4_OUT        MCHP_PINMUX(c, 0, 0x364, 33, periph)
/* pc0_tstbus5_out */
#define PC0_TSTBUS5_OUT        MCHP_PINMUX(c, 0, 0x368, 38, periph)
/* pc0_tstbus8_out */
#define PC0_TSTBUS8_OUT        MCHP_PINMUX(c, 0, 0x364, 34, periph)
/* pc0_tstbus9_out */
#define PC0_TSTBUS9_OUT        MCHP_PINMUX(c, 0, 0x368, 39, periph)
/* pc1_ac_cmp0_out */
#define PC1_AC_CMP0_OUT        MCHP_PINMUX(c, 1, 0x370, 40, periph)
/* pc1_ac_cmptrdy_out */
#define PC1_AC_CMPTRDY_OUT     MCHP_PINMUX(c, 1, 0x370, 41, periph)
/* pc1_can1rx_in */
#define PC1_CAN1RX_IN          MCHP_PINMUX(c, 1, 0x190, 12, periph)
/* pc1_cclin1_in */
#define PC1_CCLIN1_IN          MCHP_PINMUX(c, 1, 0xb8, 6, periph)
/* pc1_cclin2_in */
#define PC1_CCLIN2_IN          MCHP_PINMUX(c, 1, 0xbc, 12, periph)
/* pc1_cclin4_in */
#define PC1_CCLIN4_IN          MCHP_PINMUX(c, 1, 0xc4, 6, periph)
/* pc1_cclin5_in */
#define PC1_CCLIN5_IN          MCHP_PINMUX(c, 1, 0xc8, 12, periph)
/* pc1_cclo0_out */
#define PC1_CCLO0_OUT          MCHP_PINMUX(c, 1, 0x370, 1, periph)
/* pc1_cclo1_out */
#define PC1_CCLO1_OUT          MCHP_PINMUX(c, 1, 0x36c, 1, periph)
/* pc1_coex_rf_act_out */
#define PC1_COEX_RF_ACT_OUT    MCHP_PINMUX(c, 1, 0x36c, 41, periph)
/* pc1_extint1_in */
#define PC1_EXTINT1_IN         MCHP_PINMUX(c, 1, 0x4, 6, periph)
/* pc1_extint2_in */
#define PC1_EXTINT2_IN         MCHP_PINMUX(c, 1, 0x8, 12, periph)
/* pc1_fectrl0_out */
#define PC1_FECTRL0_OUT        MCHP_PINMUX(c, 1, 0x36c, 40, periph)
/* pc1_fectrl4_out */
#define PC1_FECTRL4_OUT        MCHP_PINMUX(c, 1, 0x370, 42, periph)
/* pc1_qd0_out */
#define PC1_QD0_OUT            MCHP_PINMUX(c, 1, 0x36c, 35, periph)
/* pc1_qd1_out */
#define PC1_QD1_OUT            MCHP_PINMUX(c, 1, 0x370, 35, periph)
/* pc1_qd2_in */
#define PC1_QD2_IN             MCHP_PINMUX(c, 1, 0xa8, 6, periph)
/* pc1_qd2_out */
#define PC1_QD2_OUT            MCHP_PINMUX(c, 1, 0x36c, 37, periph)
/* pc1_qd3_in */
#define PC1_QD3_IN             MCHP_PINMUX(c, 1, 0xac, 12, periph)
/* pc1_qd3_out */
