zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62132-pinctrl.h
#define PC1_QD3_OUT            MCHP_PINMUX(c, 1, 0x36c, 36, periph)
/* pc1_qeihome0g2_in */
#define PC1_QEIHOME0G2_IN      MCHP_PINMUX(c, 1, 0x170, 6, periph)
/* pc1_qeiindx0g2_in */
#define PC1_QEIINDX0G2_IN      MCHP_PINMUX(c, 1, 0x174, 6, periph)
/* pc1_qeiindx0g3_in */
#define PC1_QEIINDX0G3_IN      MCHP_PINMUX(c, 1, 0x178, 12, periph)
/* pc1_qeiqea0g3_in */
#define PC1_QEIQEA0G3_IN       MCHP_PINMUX(c, 1, 0x17c, 12, periph)
/* pc1_qspics_out */
#define PC1_QSPICS_OUT         MCHP_PINMUX(c, 1, 0x36c, 34, periph)
/* pc1_scom0p0_in */
#define PC1_SCOM0P0_IN         MCHP_PINMUX(c, 1, 0x40, 6, periph)
/* pc1_scom0p0_out */
#define PC1_SCOM0P0_OUT        MCHP_PINMUX(c, 1, 0x36c, 2, periph)
/* pc1_scom0p2_out */
#define PC1_SCOM0P2_OUT        MCHP_PINMUX(c, 1, 0x36c, 4, periph)
/* pc1_scom0p3_out */
#define PC1_SCOM0P3_OUT        MCHP_PINMUX(c, 1, 0x36c, 3, periph)
/* pc1_scom1p0_in */
#define PC1_SCOM1P0_IN         MCHP_PINMUX(c, 1, 0x50, 12, periph)
/* pc1_scom1p0_out */
#define PC1_SCOM1P0_OUT        MCHP_PINMUX(c, 1, 0x370, 5, periph)
/* pc1_scom1p2_out */
#define PC1_SCOM1P2_OUT        MCHP_PINMUX(c, 1, 0x36c, 6, periph)
/* pc1_scom1p3_in */
#define PC1_SCOM1P3_IN         MCHP_PINMUX(c, 1, 0x5c, 6, periph)
/* pc1_scom1p3_out */
#define PC1_SCOM1P3_OUT        MCHP_PINMUX(c, 1, 0x36c, 5, periph)
/* pc1_scom2p0_in */
#define PC1_SCOM2P0_IN         MCHP_PINMUX(c, 1, 0x60, 6, periph)
/* pc1_scom2p0_out */
#define PC1_SCOM2P0_OUT        MCHP_PINMUX(c, 1, 0x36c, 7, periph)
/* pc1_scom2p2_out */
#define PC1_SCOM2P2_OUT        MCHP_PINMUX(c, 1, 0x36c, 9, periph)
/* pc1_scom2p3_out */
#define PC1_SCOM2P3_OUT        MCHP_PINMUX(c, 1, 0x36c, 8, periph)
/* pc1_scom3p0_in */
#define PC1_SCOM3P0_IN         MCHP_PINMUX(c, 1, 0x70, 12, periph)
/* pc1_scom3p0_out */
#define PC1_SCOM3P0_OUT        MCHP_PINMUX(c, 1, 0x370, 10, periph)
/* pc1_scom3p2_out */
#define PC1_SCOM3P2_OUT        MCHP_PINMUX(c, 1, 0x36c, 11, periph)
/* pc1_scom3p3_in */
#define PC1_SCOM3P3_IN         MCHP_PINMUX(c, 1, 0x7c, 6, periph)
/* pc1_scom3p3_out */
#define PC1_SCOM3P3_OUT        MCHP_PINMUX(c, 1, 0x36c, 10, periph)
/* pc1_scom4p0_in */
#define PC1_SCOM4P0_IN         MCHP_PINMUX(c, 1, 0x80, 6, periph)
/* pc1_scom4p0_out */
#define PC1_SCOM4P0_OUT        MCHP_PINMUX(c, 1, 0x36c, 12, periph)
/* pc1_scom4p2_out */
#define PC1_SCOM4P2_OUT        MCHP_PINMUX(c, 1, 0x36c, 14, periph)
/* pc1_scom4p3_out */
#define PC1_SCOM4P3_OUT        MCHP_PINMUX(c, 1, 0x36c, 13, periph)
/* pc1_scom5p0_in */
#define PC1_SCOM5P0_IN         MCHP_PINMUX(c, 1, 0x90, 12, periph)
/* pc1_scom5p0_out */
#define PC1_SCOM5P0_OUT        MCHP_PINMUX(c, 1, 0x370, 15, periph)
/* pc1_scom5p2_out */
#define PC1_SCOM5P2_OUT        MCHP_PINMUX(c, 1, 0x36c, 16, periph)
/* pc1_scom5p3_in */
#define PC1_SCOM5P3_IN         MCHP_PINMUX(c, 1, 0x9c, 6, periph)
/* pc1_scom5p3_out */
#define PC1_SCOM5P3_OUT        MCHP_PINMUX(c, 1, 0x36c, 15, periph)
/* pc1_tc0wo0g2_in */
#define PC1_TC0WO0G2_IN        MCHP_PINMUX(c, 1, 0xd0, 6, periph)
/* pc1_tc0wo0_out */
#define PC1_TC0WO0_OUT         MCHP_PINMUX(c, 1, 0x370, 24, periph)
/* pc1_tc0wo1g3_in */
#define PC1_TC0WO1G3_IN        MCHP_PINMUX(c, 1, 0xd4, 12, periph)
/* pc1_tc0wo1_out */
#define PC1_TC0WO1_OUT         MCHP_PINMUX(c, 1, 0x36c, 24, periph)
/* pc1_tc1wo0_out */
#define PC1_TC1WO0_OUT         MCHP_PINMUX(c, 1, 0x370, 25, periph)
/* pc1_tc1wo1g2_in */
#define PC1_TC1WO1G2_IN        MCHP_PINMUX(c, 1, 0xe4, 6, periph)
/* pc1_tc1wo1_out */
#define PC1_TC1WO1_OUT         MCHP_PINMUX(c, 1, 0x36c, 25, periph)
/* pc1_tc2wo0g3_in */
#define PC1_TC2WO0G3_IN        MCHP_PINMUX(c, 1, 0xf0, 12, periph)
/* pc1_tc2wo0_out */
#define PC1_TC2WO0_OUT         MCHP_PINMUX(c, 1, 0x370, 26, periph)
/* pc1_tc2wo1g2_in */
#define PC1_TC2WO1G2_IN        MCHP_PINMUX(c, 1, 0xf4, 6, periph)
/* pc1_tc2wo1_out */
#define PC1_TC2WO1_OUT         MCHP_PINMUX(c, 1, 0x36c, 26, periph)
/* pc1_tc3wo0g3_in */
#define PC1_TC3WO0G3_IN        MCHP_PINMUX(c, 1, 0x100, 12, periph)
/* pc1_tc3wo0_out */
#define PC1_TC3WO0_OUT         MCHP_PINMUX(c, 1, 0x370, 27, periph)
/* pc1_tc3wo1g2_in */
#define PC1_TC3WO1G2_IN        MCHP_PINMUX(c, 1, 0x104, 6, periph)
/* pc1_tc3wo1_out */
#define PC1_TC3WO1_OUT         MCHP_PINMUX(c, 1, 0x36c, 27, periph)
/* pc1_tc4wo0g3_in */
#define PC1_TC4WO0G3_IN        MCHP_PINMUX(c, 1, 0x110, 12, periph)
/* pc1_tc4wo0_out */
#define PC1_TC4WO0_OUT         MCHP_PINMUX(c, 1, 0x370, 28, periph)
/* pc1_tc4wo1g2_in */
#define PC1_TC4WO1G2_IN        MCHP_PINMUX(c, 1, 0x114, 6, periph)
/* pc1_tc4wo1_out */
#define PC1_TC4WO1_OUT         MCHP_PINMUX(c, 1, 0x36c, 28, periph)
/* pc1_tc5wo0g3_in */
#define PC1_TC5WO0G3_IN        MCHP_PINMUX(c, 1, 0x120, 12, periph)
/* pc1_tc5wo0_out */
#define PC1_TC5WO0_OUT         MCHP_PINMUX(c, 1, 0x370, 29, periph)
/* pc1_tc5wo1g2_in */
#define PC1_TC5WO1G2_IN        MCHP_PINMUX(c, 1, 0x124, 6, periph)
/* pc1_tc5wo1_out */
#define PC1_TC5WO1_OUT         MCHP_PINMUX(c, 1, 0x36c, 29, periph)
/* pc1_tc6wo0g3_in */
#define PC1_TC6WO0G3_IN        MCHP_PINMUX(c, 1, 0x130, 12, periph)
/* pc1_tc6wo0_out */
#define PC1_TC6WO0_OUT         MCHP_PINMUX(c, 1, 0x370, 30, periph)
/* pc1_tc6wo1g2_in */
#define PC1_TC6WO1G2_IN        MCHP_PINMUX(c, 1, 0x134, 6, periph)
/* pc1_tc6wo1_out */
#define PC1_TC6WO1_OUT         MCHP_PINMUX(c, 1, 0x36c, 30, periph)
/* pc1_tc7wo0g3_in */
#define PC1_TC7WO0G3_IN        MCHP_PINMUX(c, 1, 0x140, 12, periph)
/* pc1_tc7wo0_out */
#define PC1_TC7WO0_OUT         MCHP_PINMUX(c, 1, 0x370, 31, periph)
/* pc1_tc7wo1g2_in */
#define PC1_TC7WO1G2_IN        MCHP_PINMUX(c, 1, 0x144, 6, periph)
/* pc1_tc7wo1_out */
#define PC1_TC7WO1_OUT         MCHP_PINMUX(c, 1, 0x36c, 31, periph)
/* pc1_tc8wo0g3_in */
#define PC1_TC8WO0G3_IN        MCHP_PINMUX(c, 1, 0x150, 12, periph)
/* pc1_tc8wo0_out */
#define PC1_TC8WO0_OUT         MCHP_PINMUX(c, 1, 0x370, 32, periph)
/* pc1_tc8wo1g2_in */
#define PC1_TC8WO1G2_IN        MCHP_PINMUX(c, 1, 0x154, 6, periph)
/* pc1_tc8wo1_out */
#define PC1_TC8WO1_OUT         MCHP_PINMUX(c, 1, 0x36c, 32, periph)
/* pc1_tc9wo0g2_in */
#define PC1_TC9WO0G2_IN        MCHP_PINMUX(c, 1, 0x15c, 6, periph)
/* pc1_tc9wo0_out */
#define PC1_TC9WO0_OUT         MCHP_PINMUX(c, 1, 0x36c, 33, periph)
/* pc1_tc9wo1g3_in */
#define PC1_TC9WO1G3_IN        MCHP_PINMUX(c, 1, 0x164, 12, periph)
/* pc1_tc9wo1_out */
#define PC1_TC9WO1_OUT         MCHP_PINMUX(c, 1, 0x370, 33, periph)
/* pc1_tcc0wo0_out */
#define PC1_TCC0WO0_OUT        MCHP_PINMUX(c, 1, 0x370, 18, periph)
/* pc1_tcc0wo1_out */
#define PC1_TCC0WO1_OUT        MCHP_PINMUX(c, 1, 0x36c, 17, periph)
/* pc1_tcc0wo2_out */
#define PC1_TCC0WO2_OUT        MCHP_PINMUX(c, 1, 0x370, 17, periph)
/* pc1_tcc0wo3_out */
#define PC1_TCC0WO3_OUT        MCHP_PINMUX(c, 1, 0x36c, 19, periph)
/* pc1_tcc0wo4_out */
#define PC1_TCC0WO4_OUT        MCHP_PINMUX(c, 1, 0x370, 19, periph)
/* pc1_tcc0wo5_out */
#define PC1_TCC0WO5_OUT        MCHP_PINMUX(c, 1, 0x36c, 18, periph)
/* pc1_tcc1wo0_out */
#define PC1_TCC1WO0_OUT        MCHP_PINMUX(c, 1, 0x370, 21, periph)
/* pc1_tcc1wo1_out */
#define PC1_TCC1WO1_OUT        MCHP_PINMUX(c, 1, 0x36c, 20, periph)
/* pc1_tcc1wo2_out */
#define PC1_TCC1WO2_OUT        MCHP_PINMUX(c, 1, 0x370, 20, periph)
/* pc1_tcc1wo3_out */
#define PC1_TCC1WO3_OUT        MCHP_PINMUX(c, 1, 0x36c, 22, periph)
/* pc1_tcc1wo4_out */
#define PC1_TCC1WO4_OUT        MCHP_PINMUX(c, 1, 0x370, 22, periph)
/* pc1_tcc1wo5_out */
#define PC1_TCC1WO5_OUT        MCHP_PINMUX(c, 1, 0x36c, 21, periph)
/* pc1_tcc2wo0_out */
#define PC1_TCC2WO0_OUT        MCHP_PINMUX(c, 1, 0x370, 23, periph)
/* pc1_tcc2wo1_out */
#define PC1_TCC2WO1_OUT        MCHP_PINMUX(c, 1, 0x36c, 23, periph)
/* pc1_tstbus1_out */
#define PC1_TSTBUS1_OUT        MCHP_PINMUX(c, 1, 0x370, 38, periph)
/* pc1_tstbus5_out */
#define PC1_TSTBUS5_OUT        MCHP_PINMUX(c, 1, 0x36c, 38, periph)
/* pc1_tstbus9_out */
#define PC1_TSTBUS9_OUT        MCHP_PINMUX(c, 1, 0x36c, 39, periph)
/* pc1_tstbus10_out */
#define PC1_TSTBUS10_OUT       MCHP_PINMUX(c, 1, 0x370, 39, periph)
/* pc7_ac_cmp1_out */
#define PC7_AC_CMP1_OUT        MCHP_PINMUX(c, 7, 0x38c, 36, periph)
/* pc7_ac_cmptout_out */
#define PC7_AC_CMPTOUT_OUT     MCHP_PINMUX(c, 7, 0x38c, 37, periph)
/* pc7_can1_tx_out */
#define PC7_CAN1_TX_OUT        MCHP_PINMUX(c, 7, 0x38c, 38, periph)
/* pc7_cclin1_in */
#define PC7_CCLIN1_IN          MCHP_PINMUX(c, 7, 0xb8, 7, periph)
/* pc7_cclin4_in */
#define PC7_CCLIN4_IN          MCHP_PINMUX(c, 7, 0xc4, 7, periph)
/* pc7_cclo1_out */
#define PC7_CCLO1_OUT          MCHP_PINMUX(c, 7, 0x388, 1, periph)
/* pc7_coexwlanact_in */
#define PC7_COEXWLANACT_IN     MCHP_PINMUX(c, 7, 0x194, 10, periph)
/* pc7_coex_rf_act_out */
#define PC7_COEX_RF_ACT_OUT    MCHP_PINMUX(c, 7, 0x388, 41, periph)
/* pc7_extint1_in */
#define PC7_EXTINT1_IN         MCHP_PINMUX(c, 7, 0x4, 7, periph)
/* pc7_extint3_in */
#define PC7_EXTINT3_IN         MCHP_PINMUX(c, 7, 0xc, 10, periph)
/* pc7_fectrl0_out */
#define PC7_FECTRL0_OUT        MCHP_PINMUX(c, 7, 0x388, 40, periph)
/* pc7_fectrl3_out */
#define PC7_FECTRL3_OUT        MCHP_PINMUX(c, 7, 0x38c, 39, periph)
/* pc7_fectrl5_out */
#define PC7_FECTRL5_OUT        MCHP_PINMUX(c, 7, 0x38c, 40, periph)
/* pc7_nmi_in */
#define PC7_NMI_IN             MCHP_PINMUX(c, 7, 0x3c, 10, periph)
/* pc7_qd0_in */
#define PC7_QD0_IN             MCHP_PINMUX(c, 7, 0xa0, 10, periph)
/* pc7_qd0_out */
#define PC7_QD0_OUT            MCHP_PINMUX(c, 7, 0x388, 35, periph)
/* pc7_qd1_out */
#define PC7_QD1_OUT            MCHP_PINMUX(c, 7, 0x38c, 32, periph)
/* pc7_qd2_in */
#define PC7_QD2_IN             MCHP_PINMUX(c, 7, 0xa8, 7, periph)
/* pc7_qd2_out */
#define PC7_QD2_OUT            MCHP_PINMUX(c, 7, 0x388, 37, periph)
/* pc7_qd3_out */
#define PC7_QD3_OUT            MCHP_PINMUX(c, 7, 0x388, 36, periph)
/* pc7_qeihome0g2_in */
#define PC7_QEIHOME0G2_IN      MCHP_PINMUX(c, 7, 0x170, 7, periph)
/* pc7_qeiindx0g2_in */
#define PC7_QEIINDX0G2_IN      MCHP_PINMUX(c, 7, 0x174, 7, periph)
/* pc7_qeiqea0g4_in */
#define PC7_QEIQEA0G4_IN       MCHP_PINMUX(c, 7, 0x180, 10, periph)
/* pc7_qeiqeb0g4_in */
#define PC7_QEIQEB0G4_IN       MCHP_PINMUX(c, 7, 0x184, 10, periph)
/* pc7_qspics_out */
#define PC7_QSPICS_OUT         MCHP_PINMUX(c, 7, 0x388, 34, periph)
/* pc7_scom0p0_in */
#define PC7_SCOM0P0_IN         MCHP_PINMUX(c, 7, 0x40, 7, periph)
/* pc7_scom0p0_out */
#define PC7_SCOM0P0_OUT        MCHP_PINMUX(c, 7, 0x388, 2, periph)
/* pc7_scom0p2_in */
#define PC7_SCOM0P2_IN         MCHP_PINMUX(c, 7, 0x48, 10, periph)
/* pc7_scom0p2_out */
#define PC7_SCOM0P2_OUT        MCHP_PINMUX(c, 7, 0x388, 4, periph)
/* pc7_scom0p3_out */
#define PC7_SCOM0P3_OUT        MCHP_PINMUX(c, 7, 0x388, 3, periph)
/* pc7_scom1p0_out */
#define PC7_SCOM1P0_OUT        MCHP_PINMUX(c, 7, 0x38c, 5, periph)
/* pc7_scom1p2_out */
#define PC7_SCOM1P2_OUT        MCHP_PINMUX(c, 7, 0x388, 6, periph)
/* pc7_scom1p3_in */
#define PC7_SCOM1P3_IN         MCHP_PINMUX(c, 7, 0x5c, 7, periph)
/* pc7_scom1p3_out */
#define PC7_SCOM1P3_OUT        MCHP_PINMUX(c, 7, 0x388, 5, periph)
/* pc7_scom2p0_in */
#define PC7_SCOM2P0_IN         MCHP_PINMUX(c, 7, 0x60, 7, periph)
/* pc7_scom2p0_out */
#define PC7_SCOM2P0_OUT        MCHP_PINMUX(c, 7, 0x388, 7, periph)
/* pc7_scom2p2_in */
#define PC7_SCOM2P2_IN         MCHP_PINMUX(c, 7, 0x68, 10, periph)
/* pc7_scom2p2_out */
#define PC7_SCOM2P2_OUT        MCHP_PINMUX(c, 7, 0x388, 9, periph)
/* pc7_scom2p3_out */
#define PC7_SCOM2P3_OUT        MCHP_PINMUX(c, 7, 0x388, 8, periph)
/* pc7_scom3p0_out */
#define PC7_SCOM3P0_OUT        MCHP_PINMUX(c, 7, 0x38c, 9, periph)
/* pc7_scom3p2_out */
#define PC7_SCOM3P2_OUT        MCHP_PINMUX(c, 7, 0x388, 11, periph)
/* pc7_scom3p3_in */
#define PC7_SCOM3P3_IN         MCHP_PINMUX(c, 7, 0x7c, 7, periph)
/* pc7_scom3p3_out */
#define PC7_SCOM3P3_OUT        MCHP_PINMUX(c, 7, 0x388, 10, periph)
/* pc7_scom4p0_in */
#define PC7_SCOM4P0_IN         MCHP_PINMUX(c, 7, 0x80, 7, periph)
/* pc7_scom4p0_out */
#define PC7_SCOM4P0_OUT        MCHP_PINMUX(c, 7, 0x388, 12, periph)
/* pc7_scom4p2_in */
#define PC7_SCOM4P2_IN         MCHP_PINMUX(c, 7, 0x88, 10, periph)
/* pc7_scom4p2_out */
#define PC7_SCOM4P2_OUT        MCHP_PINMUX(c, 7, 0x388, 14, periph)
/* pc7_scom4p3_out */
#define PC7_SCOM4P3_OUT        MCHP_PINMUX(c, 7, 0x388, 13, periph)
/* pc7_scom5p0_out */
#define PC7_SCOM5P0_OUT        MCHP_PINMUX(c, 7, 0x38c, 13, periph)
/* pc7_scom5p2_out */
#define PC7_SCOM5P2_OUT        MCHP_PINMUX(c, 7, 0x388, 16, periph)
/* pc7_scom5p3_in */
#define PC7_SCOM5P3_IN         MCHP_PINMUX(c, 7, 0x9c, 7, periph)
/* pc7_scom5p3_out */
#define PC7_SCOM5P3_OUT        MCHP_PINMUX(c, 7, 0x388, 15, periph)
/* pc7_tc0wo0g2_in */
#define PC7_TC0WO0G2_IN        MCHP_PINMUX(c, 7, 0xd0, 7, periph)
/* pc7_tc0wo0_out */
#define PC7_TC0WO0_OUT         MCHP_PINMUX(c, 7, 0x38c, 21, periph)
/* pc7_tc0wo1g4_in */
#define PC7_TC0WO1G4_IN        MCHP_PINMUX(c, 7, 0xd8, 10, periph)
/* pc7_tc0wo1_out */
#define PC7_TC0WO1_OUT         MCHP_PINMUX(c, 7, 0x388, 24, periph)
/* pc7_tc1wo1g2_in */
#define PC7_TC1WO1G2_IN        MCHP_PINMUX(c, 7, 0xe4, 7, periph)
/* pc7_tc1wo1_out */
#define PC7_TC1WO1_OUT         MCHP_PINMUX(c, 7, 0x388, 25, periph)
/* pc7_tc2wo1g2_in */
#define PC7_TC2WO1G2_IN        MCHP_PINMUX(c, 7, 0xf4, 7, periph)
/* pc7_tc2wo1g4_in */
#define PC7_TC2WO1G4_IN        MCHP_PINMUX(c, 7, 0xf8, 10, periph)
/* pc7_tc2wo1_out */
#define PC7_TC2WO1_OUT         MCHP_PINMUX(c, 7, 0x388, 26, periph)
/* pc7_tc3wo1g2_in */
#define PC7_TC3WO1G2_IN        MCHP_PINMUX(c, 7, 0x104, 7, periph)
/* pc7_tc3wo1g4_in */
#define PC7_TC3WO1G4_IN        MCHP_PINMUX(c, 7, 0x108, 10, periph)
/* pc7_tc3wo1_out */
#define PC7_TC3WO1_OUT         MCHP_PINMUX(c, 7, 0x388, 27, periph)
/* pc7_tc4wo1g2_in */
#define PC7_TC4WO1G2_IN        MCHP_PINMUX(c, 7, 0x114, 7, periph)
/* pc7_tc4wo1g4_in */
#define PC7_TC4WO1G4_IN        MCHP_PINMUX(c, 7, 0x118, 10, periph)
/* pc7_tc4wo1_out */
#define PC7_TC4WO1_OUT         MCHP_PINMUX(c, 7, 0x388, 28, periph)
/* pc7_tc5wo1g2_in */
#define PC7_TC5WO1G2_IN        MCHP_PINMUX(c, 7, 0x124, 7, periph)
/* pc7_tc5wo1g4_in */
#define PC7_TC5WO1G4_IN        MCHP_PINMUX(c, 7, 0x128, 10, periph)
/* pc7_tc5wo1_out */
#define PC7_TC5WO1_OUT         MCHP_PINMUX(c, 7, 0x388, 29, periph)
/* pc7_tc6wo1g2_in */
#define PC7_TC6WO1G2_IN        MCHP_PINMUX(c, 7, 0x134, 7, periph)
/* pc7_tc6wo1g4_in */
#define PC7_TC6WO1G4_IN        MCHP_PINMUX(c, 7, 0x138, 10, periph)
/* pc7_tc6wo1_out */
#define PC7_TC6WO1_OUT         MCHP_PINMUX(c, 7, 0x388, 30, periph)
/* pc7_tc7wo1g2_in */
#define PC7_TC7WO1G2_IN        MCHP_PINMUX(c, 7, 0x144, 7, periph)
/* pc7_tc7wo1g4_in */
#define PC7_TC7WO1G4_IN        MCHP_PINMUX(c, 7, 0x148, 10, periph)
/* pc7_tc7wo1_out */
#define PC7_TC7WO1_OUT         MCHP_PINMUX(c, 7, 0x388, 31, periph)
/* pc7_tc8wo1g2_in */
#define PC7_TC8WO1G2_IN        MCHP_PINMUX(c, 7, 0x154, 7, periph)
/* pc7_tc8wo1_out */
#define PC7_TC8WO1_OUT         MCHP_PINMUX(c, 7, 0x388, 32, periph)
/* pc7_tc9wo0g2_in */
#define PC7_TC9WO0G2_IN        MCHP_PINMUX(c, 7, 0x15c, 7, periph)
/* pc7_tc9wo0g4_in */
#define PC7_TC9WO0G4_IN        MCHP_PINMUX(c, 7, 0x160, 10, periph)
/* pc7_tc9wo0_out */
#define PC7_TC9WO0_OUT         MCHP_PINMUX(c, 7, 0x388, 33, periph)
/* pc7_tcc0wo1_out */
#define PC7_TCC0WO1_OUT        MCHP_PINMUX(c, 7, 0x388, 17, periph)
/* pc7_tcc0wo3_out */
#define PC7_TCC0WO3_OUT        MCHP_PINMUX(c, 7, 0x388, 19, periph)
/* pc7_tcc0wo5_out */
#define PC7_TCC0WO5_OUT        MCHP_PINMUX(c, 7, 0x388, 18, periph)
/* pc7_tcc1wo1_out */
#define PC7_TCC1WO1_OUT        MCHP_PINMUX(c, 7, 0x388, 20, periph)
/* pc7_tcc1wo3_out */
#define PC7_TCC1WO3_OUT        MCHP_PINMUX(c, 7, 0x388, 22, periph)
/* pc7_tcc1wo5_out */
#define PC7_TCC1WO5_OUT        MCHP_PINMUX(c, 7, 0x388, 21, periph)
/* pc7_tcc2wo1_out */
#define PC7_TCC2WO1_OUT        MCHP_PINMUX(c, 7, 0x388, 23, periph)
/* pc7_tstbus2_out */
#define PC7_TSTBUS2_OUT        MCHP_PINMUX(c, 7, 0x38c, 34, periph)
/* pc7_tstbus5_out */
#define PC7_TSTBUS5_OUT        MCHP_PINMUX(c, 7, 0x388, 38, periph)
/* pc7_tstbus6_out */
#define PC7_TSTBUS6_OUT        MCHP_PINMUX(c, 7, 0x38c, 35, periph)
/* pc7_tstbus9_out */
#define PC7_TSTBUS9_OUT        MCHP_PINMUX(c, 7, 0x388, 39, periph)
/* pc8_ac_cmp0_out */
#define PC8_AC_CMP0_OUT        MCHP_PINMUX(c, 8, 0x390, 40, periph)
/* pc8_ac_cmptrdy_out */
#define PC8_AC_CMPTRDY_OUT     MCHP_PINMUX(c, 8, 0x390, 41, periph)
/* pc8_can1rx_in */
#define PC8_CAN1RX_IN          MCHP_PINMUX(c, 8, 0x190, 7, periph)
/* pc8_cclin2_in */
#define PC8_CCLIN2_IN          MCHP_PINMUX(c, 8, 0xbc, 7, periph)
/* pc8_cclin5_in */
#define PC8_CCLIN5_IN          MCHP_PINMUX(c, 8, 0xc8, 7, periph)
/* pc8_cclo0_out */
#define PC8_CCLO0_OUT          MCHP_PINMUX(c, 8, 0x390, 1, periph)
/* pc8_extint2_in */
#define PC8_EXTINT2_IN         MCHP_PINMUX(c, 8, 0x8, 7, periph)
/* pc8_fectrl4_out */
#define PC8_FECTRL4_OUT        MCHP_PINMUX(c, 8, 0x390, 42, periph)
/* pc8_gmac_tsucomp_out */
#define PC8_GMAC_TSUCOMP_OUT   MCHP_PINMUX(c, 8, 0x394, 14, periph)
/* pc8_qd0_out */
#define PC8_QD0_OUT            MCHP_PINMUX(c, 8, 0x390, 36, periph)
/* pc8_qd1_out */
#define PC8_QD1_OUT            MCHP_PINMUX(c, 8, 0x390, 35, periph)
/* pc8_qd3_in */
#define PC8_QD3_IN             MCHP_PINMUX(c, 8, 0xac, 7, periph)
/* pc8_qd3_out */
#define PC8_QD3_OUT            MCHP_PINMUX(c, 8, 0x390, 37, periph)
/* pc8_qeiccmp0_out */
#define PC8_QEICCMP0_OUT       MCHP_PINMUX(c, 8, 0x394, 13, periph)
/* pc8_qeiindx0g3_in */
#define PC8_QEIINDX0G3_IN      MCHP_PINMUX(c, 8, 0x178, 7, periph)
/* pc8_qeiqea0g3_in */
#define PC8_QEIQEA0G3_IN       MCHP_PINMUX(c, 8, 0x17c, 7, periph)
/* pc8_qeiqeb0g5_in */
#define PC8_QEIQEB0G5_IN       MCHP_PINMUX(c, 8, 0x188, 9, periph)
/* pc8_qspics_out */
#define PC8_QSPICS_OUT         MCHP_PINMUX(c, 8, 0x390, 34, periph)
/* pc8_scom0p0_out */
#define PC8_SCOM0P0_OUT        MCHP_PINMUX(c, 8, 0x390, 2, periph)
/* pc8_scom0p3_out */
#define PC8_SCOM0P3_OUT        MCHP_PINMUX(c, 8, 0x390, 3, periph)
/* pc8_scom1p0_in */
#define PC8_SCOM1P0_IN         MCHP_PINMUX(c, 8, 0x50, 7, periph)
/* pc8_scom1p0_out */
#define PC8_SCOM1P0_OUT        MCHP_PINMUX(c, 8, 0x390, 5, periph)
/* pc8_scom1p2_out */
#define PC8_SCOM1P2_OUT        MCHP_PINMUX(c, 8, 0x390, 4, periph)
/* pc8_scom1p3_out */
#define PC8_SCOM1P3_OUT        MCHP_PINMUX(c, 8, 0x390, 6, periph)
/* pc8_scom2p0_out */
#define PC8_SCOM2P0_OUT        MCHP_PINMUX(c, 8, 0x390, 7, periph)
/* pc8_scom2p3_out */
#define PC8_SCOM2P3_OUT        MCHP_PINMUX(c, 8, 0x390, 8, periph)
/* pc8_scom3p0_in */
#define PC8_SCOM3P0_IN         MCHP_PINMUX(c, 8, 0x70, 7, periph)
/* pc8_scom3p0_out */
#define PC8_SCOM3P0_OUT        MCHP_PINMUX(c, 8, 0x390, 10, periph)
/* pc8_scom3p2_out */
#define PC8_SCOM3P2_OUT        MCHP_PINMUX(c, 8, 0x390, 9, periph)
/* pc8_scom3p3_out */
#define PC8_SCOM3P3_OUT        MCHP_PINMUX(c, 8, 0x390, 11, periph)
/* pc8_scom4p0_out */
#define PC8_SCOM4P0_OUT        MCHP_PINMUX(c, 8, 0x390, 12, periph)
/* pc8_scom4p3_out */
#define PC8_SCOM4P3_OUT        MCHP_PINMUX(c, 8, 0x390, 13, periph)
/* pc8_scom5p0_in */
#define PC8_SCOM5P0_IN         MCHP_PINMUX(c, 8, 0x90, 7, periph)
/* pc8_scom5p0_out */
#define PC8_SCOM5P0_OUT        MCHP_PINMUX(c, 8, 0x390, 15, periph)
/* pc8_scom5p2_out */
#define PC8_SCOM5P2_OUT        MCHP_PINMUX(c, 8, 0x390, 14, periph)
/* pc8_scom5p3_out */
#define PC8_SCOM5P3_OUT        MCHP_PINMUX(c, 8, 0x390, 16, periph)
/* pc8_tc0wo0_out */
#define PC8_TC0WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 24, periph)
/* pc8_tc0wo1g3_in */
#define PC8_TC0WO1G3_IN        MCHP_PINMUX(c, 8, 0xd4, 7, periph)
/* pc8_tc1wo0_out */
#define PC8_TC1WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 25, periph)
/* pc8_tc2wo0g3_in */
#define PC8_TC2WO0G3_IN        MCHP_PINMUX(c, 8, 0xf0, 7, periph)
/* pc8_tc2wo0_out */
#define PC8_TC2WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 26, periph)
/* pc8_tc3wo0g3_in */
#define PC8_TC3WO0G3_IN        MCHP_PINMUX(c, 8, 0x100, 7, periph)
/* pc8_tc3wo0_out */
#define PC8_TC3WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 27, periph)
/* pc8_tc4wo0g3_in */
#define PC8_TC4WO0G3_IN        MCHP_PINMUX(c, 8, 0x110, 7, periph)
/* pc8_tc4wo0_out */
#define PC8_TC4WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 28, periph)
/* pc8_tc5wo0g3_in */
#define PC8_TC5WO0G3_IN        MCHP_PINMUX(c, 8, 0x120, 7, periph)
/* pc8_tc5wo0_out */
#define PC8_TC5WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 29, periph)
/* pc8_tc6wo0g3_in */
#define PC8_TC6WO0G3_IN        MCHP_PINMUX(c, 8, 0x130, 7, periph)
/* pc8_tc6wo0_out */
#define PC8_TC6WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 30, periph)
/* pc8_tc7wo0g3_in */
#define PC8_TC7WO0G3_IN        MCHP_PINMUX(c, 8, 0x140, 7, periph)
/* pc8_tc7wo0_out */
#define PC8_TC7WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 31, periph)
/* pc8_tc8wo0g3_in */
#define PC8_TC8WO0G3_IN        MCHP_PINMUX(c, 8, 0x150, 7, periph)
/* pc8_tc8wo0_out */
#define PC8_TC8WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 32, periph)
/* pc8_tc8wo1g5_in */
#define PC8_TC8WO1G5_IN        MCHP_PINMUX(c, 8, 0x158, 9, periph)
/* pc8_tc8wo1_out */
#define PC8_TC8WO1_OUT         MCHP_PINMUX(c, 8, 0x394, 10, periph)
/* pc8_tc9wo1g3_in */
#define PC8_TC9WO1G3_IN        MCHP_PINMUX(c, 8, 0x164, 7, periph)
/* pc8_tc9wo1g5_in */
#define PC8_TC9WO1G5_IN        MCHP_PINMUX(c, 8, 0x168, 9, periph)
/* pc8_tc9wo1_out */
#define PC8_TC9WO1_OUT         MCHP_PINMUX(c, 8, 0x390, 33, periph)
/* pc8_tcc0wo0_out */
#define PC8_TCC0WO0_OUT        MCHP_PINMUX(c, 8, 0x390, 18, periph)
/* pc8_tcc0wo1_out */
#define PC8_TCC0WO1_OUT        MCHP_PINMUX(c, 8, 0x394, 6, periph)
/* pc8_tcc0wo2_out */
#define PC8_TCC0WO2_OUT        MCHP_PINMUX(c, 8, 0x390, 17, periph)
/* pc8_tcc0wo4_out */
#define PC8_TCC0WO4_OUT        MCHP_PINMUX(c, 8, 0x390, 19, periph)
/* pc8_tcc1wo0_out */
#define PC8_TCC1WO0_OUT        MCHP_PINMUX(c, 8, 0x390, 21, periph)
/* pc8_tcc1wo1_out */
#define PC8_TCC1WO1_OUT        MCHP_PINMUX(c, 8, 0x394, 9, periph)
/* pc8_tcc1wo2_out */
#define PC8_TCC1WO2_OUT        MCHP_PINMUX(c, 8, 0x390, 20, periph)
/* pc8_tcc1wo4_out */
#define PC8_TCC1WO4_OUT        MCHP_PINMUX(c, 8, 0x390, 22, periph)
/* pc8_tcc2wo0_out */
#define PC8_TCC2WO0_OUT        MCHP_PINMUX(c, 8, 0x390, 23, periph)
/* pc8_tstbus1_out */
#define PC8_TSTBUS1_OUT        MCHP_PINMUX(c, 8, 0x390, 38, periph)
/* pc8_tstbus3_out */
#define PC8_TSTBUS3_OUT        MCHP_PINMUX(c, 8, 0x394, 15, periph)
/* pc8_tstbus7_out */
#define PC8_TSTBUS7_OUT        MCHP_PINMUX(c, 8, 0x394, 16, periph)
/* pc8_tstbus10_out */
#define PC8_TSTBUS10_OUT       MCHP_PINMUX(c, 8, 0x390, 39, periph)
/* pc8_tstbus11_out */
#define PC8_TSTBUS11_OUT       MCHP_PINMUX(c, 8, 0x394, 17, periph)
/* pc9_accmpten_in */
#define PC9_ACCMPTEN_IN        MCHP_PINMUX(c, 9, 0x18c, 12, periph)
/* pc9_ac_cmp1_out */
#define PC9_AC_CMP1_OUT        MCHP_PINMUX(c, 9, 0x39c, 36, periph)
/* pc9_ac_cmptout_out */
#define PC9_AC_CMPTOUT_OUT     MCHP_PINMUX(c, 9, 0x39c, 37, periph)
/* pc9_can1_tx_out */
#define PC9_CAN1_TX_OUT        MCHP_PINMUX(c, 9, 0x39c, 38, periph)
/* pc9_cclin0_in */
#define PC9_CCLIN0_IN          MCHP_PINMUX(c, 9, 0xb4, 12, periph)
/* pc9_cclin3_in */
#define PC9_CCLIN3_IN          MCHP_PINMUX(c, 9, 0xc0, 12, periph)
/* pc9_cclo1_out */
#define PC9_CCLO1_OUT          MCHP_PINMUX(c, 9, 0x39c, 1, periph)
/* pc9_coexwlanact_in */
#define PC9_COEXWLANACT_IN     MCHP_PINMUX(c, 9, 0x194, 5, periph)
/* pc9_coex_bt_state_out */
#define PC9_COEX_BT_STATE_OUT  MCHP_PINMUX(c, 9, 0x398, 37, periph)
/* pc9_extint0_in */
#define PC9_EXTINT0_IN         MCHP_PINMUX(c, 9, 0x0, 12, periph)
/* pc9_extint3_in */
#define PC9_EXTINT3_IN         MCHP_PINMUX(c, 9, 0xc, 5, periph)
/* pc9_fectrl1_out */
#define PC9_FECTRL1_OUT        MCHP_PINMUX(c, 9, 0x398, 35, periph)
/* pc9_fectrl2_out */
#define PC9_FECTRL2_OUT        MCHP_PINMUX(c, 9, 0x398, 36, periph)
/* pc9_fectrl3_out */
#define PC9_FECTRL3_OUT        MCHP_PINMUX(c, 9, 0x39c, 39, periph)
/* pc9_fectrl5_out */
#define PC9_FECTRL5_OUT        MCHP_PINMUX(c, 9, 0x39c, 40, periph)
/* pc9_nmi_in */
