zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62132-pinctrl.h
#define PC9_NMI_IN             MCHP_PINMUX(c, 9, 0x3c, 5, periph)
/* pc9_qd0_in */
#define PC9_QD0_IN             MCHP_PINMUX(c, 9, 0xa0, 5, periph)
/* pc9_qd0_out */
#define PC9_QD0_OUT            MCHP_PINMUX(c, 9, 0x39c, 33, periph)
/* pc9_qd1_in */
#define PC9_QD1_IN             MCHP_PINMUX(c, 9, 0xa4, 12, periph)
/* pc9_qd1_out */
#define PC9_QD1_OUT            MCHP_PINMUX(c, 9, 0x398, 30, periph)
/* pc9_qd2_out */
#define PC9_QD2_OUT            MCHP_PINMUX(c, 9, 0x398, 29, periph)
/* pc9_qd3_out */
#define PC9_QD3_OUT            MCHP_PINMUX(c, 9, 0x398, 28, periph)
/* pc9_qeiccmp0_out */
#define PC9_QEICCMP0_OUT       MCHP_PINMUX(c, 9, 0x398, 31, periph)
/* pc9_qeihome0g1_in */
#define PC9_QEIHOME0G1_IN      MCHP_PINMUX(c, 9, 0x16c, 12, periph)
/* pc9_qeiqea0g4_in */
#define PC9_QEIQEA0G4_IN       MCHP_PINMUX(c, 9, 0x180, 5, periph)
/* pc9_qeiqeb0g4_in */
#define PC9_QEIQEB0G4_IN       MCHP_PINMUX(c, 9, 0x184, 5, periph)
/* pc9_qspics_out */
#define PC9_QSPICS_OUT         MCHP_PINMUX(c, 9, 0x398, 27, periph)
/* pc9_scom0p0_out */
#define PC9_SCOM0P0_OUT        MCHP_PINMUX(c, 9, 0x39c, 3, periph)
/* pc9_scom0p2_in */
#define PC9_SCOM0P2_IN         MCHP_PINMUX(c, 9, 0x48, 5, periph)
/* pc9_scom0p2_out */
#define PC9_SCOM0P2_OUT        MCHP_PINMUX(c, 9, 0x398, 2, periph)
/* pc9_scom0p3_in */
#define PC9_SCOM0P3_IN         MCHP_PINMUX(c, 9, 0x4c, 12, periph)
/* pc9_scom0p3_out */
#define PC9_SCOM0P3_OUT        MCHP_PINMUX(c, 9, 0x398, 1, periph)
/* pc9_scom1p0_out */
#define PC9_SCOM1P0_OUT        MCHP_PINMUX(c, 9, 0x398, 3, periph)
/* pc9_scom1p2_in */
#define PC9_SCOM1P2_IN         MCHP_PINMUX(c, 9, 0x58, 12, periph)
/* pc9_scom1p2_out */
#define PC9_SCOM1P2_OUT        MCHP_PINMUX(c, 9, 0x398, 4, periph)
/* pc9_scom1p3_out */
#define PC9_SCOM1P3_OUT        MCHP_PINMUX(c, 9, 0x39c, 4, periph)
/* pc9_scom2p0_out */
#define PC9_SCOM2P0_OUT        MCHP_PINMUX(c, 9, 0x39c, 7, periph)
/* pc9_scom2p2_in */
#define PC9_SCOM2P2_IN         MCHP_PINMUX(c, 9, 0x68, 5, periph)
/* pc9_scom2p2_out */
#define PC9_SCOM2P2_OUT        MCHP_PINMUX(c, 9, 0x398, 6, periph)
/* pc9_scom2p3_in */
#define PC9_SCOM2P3_IN         MCHP_PINMUX(c, 9, 0x6c, 12, periph)
/* pc9_scom2p3_out */
#define PC9_SCOM2P3_OUT        MCHP_PINMUX(c, 9, 0x398, 5, periph)
/* pc9_scom3p0_out */
#define PC9_SCOM3P0_OUT        MCHP_PINMUX(c, 9, 0x398, 7, periph)
/* pc9_scom3p2_in */
#define PC9_SCOM3P2_IN         MCHP_PINMUX(c, 9, 0x78, 12, periph)
/* pc9_scom3p2_out */
#define PC9_SCOM3P2_OUT        MCHP_PINMUX(c, 9, 0x398, 8, periph)
/* pc9_scom3p3_out */
#define PC9_SCOM3P3_OUT        MCHP_PINMUX(c, 9, 0x39c, 8, periph)
/* pc9_scom4p0_out */
#define PC9_SCOM4P0_OUT        MCHP_PINMUX(c, 9, 0x39c, 11, periph)
/* pc9_scom4p2_in */
#define PC9_SCOM4P2_IN         MCHP_PINMUX(c, 9, 0x88, 5, periph)
/* pc9_scom4p2_out */
#define PC9_SCOM4P2_OUT        MCHP_PINMUX(c, 9, 0x398, 10, periph)
/* pc9_scom4p3_in */
#define PC9_SCOM4P3_IN         MCHP_PINMUX(c, 9, 0x8c, 12, periph)
/* pc9_scom4p3_out */
#define PC9_SCOM4P3_OUT        MCHP_PINMUX(c, 9, 0x398, 9, periph)
/* pc9_scom5p0_out */
#define PC9_SCOM5P0_OUT        MCHP_PINMUX(c, 9, 0x398, 11, periph)
/* pc9_scom5p2_in */
#define PC9_SCOM5P2_IN         MCHP_PINMUX(c, 9, 0x98, 12, periph)
/* pc9_scom5p2_out */
#define PC9_SCOM5P2_OUT        MCHP_PINMUX(c, 9, 0x398, 12, periph)
/* pc9_scom5p3_out */
#define PC9_SCOM5P3_OUT        MCHP_PINMUX(c, 9, 0x39c, 12, periph)
/* pc9_tc0wo0g1_in */
#define PC9_TC0WO0G1_IN        MCHP_PINMUX(c, 9, 0xcc, 12, periph)
/* pc9_tc0wo0_out */
#define PC9_TC0WO0_OUT         MCHP_PINMUX(c, 9, 0x39c, 21, periph)
/* pc9_tc0wo1g4_in */
#define PC9_TC0WO1G4_IN        MCHP_PINMUX(c, 9, 0xd8, 5, periph)
/* pc9_tc0wo1_out */
#define PC9_TC0WO1_OUT         MCHP_PINMUX(c, 9, 0x398, 18, periph)
/* pc9_tc1wo0g1_in */
#define PC9_TC1WO0G1_IN        MCHP_PINMUX(c, 9, 0xdc, 12, periph)
/* pc9_tc1wo0_out */
#define PC9_TC1WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 19, periph)
/* pc9_tc1wo1_out */
#define PC9_TC1WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 22, periph)
/* pc9_tc2wo0g1_in */
#define PC9_TC2WO0G1_IN        MCHP_PINMUX(c, 9, 0xec, 12, periph)
/* pc9_tc2wo0_out */
#define PC9_TC2WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 20, periph)
/* pc9_tc2wo1g4_in */
#define PC9_TC2WO1G4_IN        MCHP_PINMUX(c, 9, 0xf8, 5, periph)
/* pc9_tc2wo1_out */
#define PC9_TC2WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 23, periph)
/* pc9_tc3wo0g1_in */
#define PC9_TC3WO0G1_IN        MCHP_PINMUX(c, 9, 0xfc, 12, periph)
/* pc9_tc3wo0_out */
#define PC9_TC3WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 21, periph)
/* pc9_tc3wo1g4_in */
#define PC9_TC3WO1G4_IN        MCHP_PINMUX(c, 9, 0x108, 5, periph)
/* pc9_tc3wo1_out */
#define PC9_TC3WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 24, periph)
/* pc9_tc4wo0g1_in */
#define PC9_TC4WO0G1_IN        MCHP_PINMUX(c, 9, 0x10c, 12, periph)
/* pc9_tc4wo0_out */
#define PC9_TC4WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 22, periph)
/* pc9_tc4wo1g4_in */
#define PC9_TC4WO1G4_IN        MCHP_PINMUX(c, 9, 0x118, 5, periph)
/* pc9_tc4wo1_out */
#define PC9_TC4WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 25, periph)
/* pc9_tc5wo0g1_in */
#define PC9_TC5WO0G1_IN        MCHP_PINMUX(c, 9, 0x11c, 12, periph)
/* pc9_tc5wo0_out */
#define PC9_TC5WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 23, periph)
/* pc9_tc5wo1g4_in */
#define PC9_TC5WO1G4_IN        MCHP_PINMUX(c, 9, 0x128, 5, periph)
/* pc9_tc5wo1_out */
#define PC9_TC5WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 26, periph)
/* pc9_tc6wo0g1_in */
#define PC9_TC6WO0G1_IN        MCHP_PINMUX(c, 9, 0x12c, 12, periph)
/* pc9_tc6wo0_out */
#define PC9_TC6WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 24, periph)
/* pc9_tc6wo1g4_in */
#define PC9_TC6WO1G4_IN        MCHP_PINMUX(c, 9, 0x138, 5, periph)
/* pc9_tc6wo1_out */
#define PC9_TC6WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 27, periph)
/* pc9_tc7wo0g1_in */
#define PC9_TC7WO0G1_IN        MCHP_PINMUX(c, 9, 0x13c, 12, periph)
/* pc9_tc7wo0_out */
#define PC9_TC7WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 25, periph)
/* pc9_tc7wo1g4_in */
#define PC9_TC7WO1G4_IN        MCHP_PINMUX(c, 9, 0x148, 5, periph)
/* pc9_tc7wo1_out */
#define PC9_TC7WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 28, periph)
/* pc9_tc8wo0g1_in */
#define PC9_TC8WO0G1_IN        MCHP_PINMUX(c, 9, 0x14c, 12, periph)
/* pc9_tc8wo0_out */
#define PC9_TC8WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 26, periph)
/* pc9_tc9wo0g4_in */
#define PC9_TC9WO0G4_IN        MCHP_PINMUX(c, 9, 0x160, 5, periph)
/* pc9_tc9wo0_out */
#define PC9_TC9WO0_OUT         MCHP_PINMUX(c, 9, 0x39c, 29, periph)
/* pc9_tcc0wo0_out */
#define PC9_TCC0WO0_OUT        MCHP_PINMUX(c, 9, 0x398, 13, periph)
/* pc9_tcc0wo1_out */
#define PC9_TCC0WO1_OUT        MCHP_PINMUX(c, 9, 0x39c, 15, periph)
/* pc9_tcc0wo3_out */
#define PC9_TCC0WO3_OUT        MCHP_PINMUX(c, 9, 0x39c, 14, periph)
/* pc9_tcc0wo4_out */
#define PC9_TCC0WO4_OUT        MCHP_PINMUX(c, 9, 0x398, 14, periph)
/* pc9_tcc0wo5_out */
#define PC9_TCC0WO5_OUT        MCHP_PINMUX(c, 9, 0x39c, 16, periph)
/* pc9_tcc1wo0_out */
#define PC9_TCC1WO0_OUT        MCHP_PINMUX(c, 9, 0x398, 15, periph)
/* pc9_tcc1wo1_out */
#define PC9_TCC1WO1_OUT        MCHP_PINMUX(c, 9, 0x39c, 18, periph)
/* pc9_tcc1wo3_out */
#define PC9_TCC1WO3_OUT        MCHP_PINMUX(c, 9, 0x39c, 17, periph)
/* pc9_tcc1wo4_out */
#define PC9_TCC1WO4_OUT        MCHP_PINMUX(c, 9, 0x398, 16, periph)
/* pc9_tcc1wo5_out */
#define PC9_TCC1WO5_OUT        MCHP_PINMUX(c, 9, 0x39c, 19, periph)
/* pc9_tcc2wo0_out */
#define PC9_TCC2WO0_OUT        MCHP_PINMUX(c, 9, 0x398, 17, periph)
/* pc9_tcc2wo1_out */
#define PC9_TCC2WO1_OUT        MCHP_PINMUX(c, 9, 0x39c, 20, periph)
/* pc9_tstbus0_out */
#define PC9_TSTBUS0_OUT        MCHP_PINMUX(c, 9, 0x398, 32, periph)
/* pc9_tstbus2_out */
#define PC9_TSTBUS2_OUT        MCHP_PINMUX(c, 9, 0x39c, 34, periph)
/* pc9_tstbus4_out */
#define PC9_TSTBUS4_OUT        MCHP_PINMUX(c, 9, 0x398, 33, periph)
/* pc9_tstbus6_out */
#define PC9_TSTBUS6_OUT        MCHP_PINMUX(c, 9, 0x39c, 35, periph)
/* pc9_tstbus8_out */
#define PC9_TSTBUS8_OUT        MCHP_PINMUX(c, 9, 0x398, 34, periph)
/* pc10_cclo0_out */
#define PC10_CCLO0_OUT         MCHP_PINMUX(c, 10, 0x3a0, 1, periph)
/* pc10_gmac_tsucomp_out */
#define PC10_GMAC_TSUCOMP_OUT  MCHP_PINMUX(c, 10, 0x3a0, 14, periph)
/* pc10_qeiccmp0_out */
#define PC10_QEICCMP0_OUT      MCHP_PINMUX(c, 10, 0x3a0, 13, periph)
/* pc10_qeiqeb0g5_in */
#define PC10_QEIQEB0G5_IN      MCHP_PINMUX(c, 10, 0x188, 12, periph)
/* pc10_qspics_out */
#define PC10_QSPICS_OUT        MCHP_PINMUX(c, 10, 0x3a0, 12, periph)
/* pc10_scom1p3_out */
#define PC10_SCOM1P3_OUT       MCHP_PINMUX(c, 10, 0x3a0, 2, periph)
/* pc10_scom2p0_out */
#define PC10_SCOM2P0_OUT       MCHP_PINMUX(c, 10, 0x3a0, 3, periph)
/* pc10_tc8wo1g5_in */
#define PC10_TC8WO1G5_IN       MCHP_PINMUX(c, 10, 0x158, 12, periph)
/* pc10_tc8wo1_out */
#define PC10_TC8WO1_OUT        MCHP_PINMUX(c, 10, 0x3a0, 10, periph)
/* pc10_tc9wo1g5_in */
#define PC10_TC9WO1G5_IN       MCHP_PINMUX(c, 10, 0x168, 12, periph)
/* pc10_tc9wo1_out */
#define PC10_TC9WO1_OUT        MCHP_PINMUX(c, 10, 0x3a0, 11, periph)
/* pc10_tcc0wo1_out */
#define PC10_TCC0WO1_OUT       MCHP_PINMUX(c, 10, 0x3a0, 6, periph)
/* pc10_tcc0wo2_out */
#define PC10_TCC0WO2_OUT       MCHP_PINMUX(c, 10, 0x3a0, 5, periph)
/* pc10_tcc0wo4_out */
#define PC10_TCC0WO4_OUT       MCHP_PINMUX(c, 10, 0x3a0, 4, periph)
/* pc10_tcc1wo1_out */
#define PC10_TCC1WO1_OUT       MCHP_PINMUX(c, 10, 0x3a0, 9, periph)
/* pc10_tcc1wo2_out */
#define PC10_TCC1WO2_OUT       MCHP_PINMUX(c, 10, 0x3a0, 8, periph)
/* pc10_tcc1wo4_out */
#define PC10_TCC1WO4_OUT       MCHP_PINMUX(c, 10, 0x3a0, 7, periph)
/* pc10_tstbus3_out */
#define PC10_TSTBUS3_OUT       MCHP_PINMUX(c, 10, 0x3a0, 15, periph)
/* pc10_tstbus7_out */
#define PC10_TSTBUS7_OUT       MCHP_PINMUX(c, 10, 0x3a0, 16, periph)
/* pc10_tstbus11_out */
#define PC10_TSTBUS11_OUT      MCHP_PINMUX(c, 10, 0x3a0, 17, periph)
/* pc11_cclo0_out */
#define PC11_CCLO0_OUT         MCHP_PINMUX(c, 11, 0x3a4, 1, periph)
/* pc11_gmac_tsucomp_out */
#define PC11_GMAC_TSUCOMP_OUT  MCHP_PINMUX(c, 11, 0x3a4, 14, periph)
/* pc11_qeiccmp0_out */
#define PC11_QEICCMP0_OUT      MCHP_PINMUX(c, 11, 0x3a4, 13, periph)
/* pc11_qeiqeb0g5_in */
#define PC11_QEIQEB0G5_IN      MCHP_PINMUX(c, 11, 0x188, 13, periph)
/* pc11_qspics_out */
#define PC11_QSPICS_OUT        MCHP_PINMUX(c, 11, 0x3a4, 12, periph)
/* pc11_scom1p3_out */
#define PC11_SCOM1P3_OUT       MCHP_PINMUX(c, 11, 0x3a4, 2, periph)
/* pc11_scom2p0_out */
#define PC11_SCOM2P0_OUT       MCHP_PINMUX(c, 11, 0x3a4, 3, periph)
/* pc11_tc8wo1g5_in */
#define PC11_TC8WO1G5_IN       MCHP_PINMUX(c, 11, 0x158, 13, periph)
/* pc11_tc8wo1_out */
#define PC11_TC8WO1_OUT        MCHP_PINMUX(c, 11, 0x3a4, 10, periph)
/* pc11_tc9wo1g5_in */
#define PC11_TC9WO1G5_IN       MCHP_PINMUX(c, 11, 0x168, 13, periph)
/* pc11_tc9wo1_out */
#define PC11_TC9WO1_OUT        MCHP_PINMUX(c, 11, 0x3a4, 11, periph)
/* pc11_tcc0wo1_out */
#define PC11_TCC0WO1_OUT       MCHP_PINMUX(c, 11, 0x3a4, 6, periph)
/* pc11_tcc0wo2_out */
#define PC11_TCC0WO2_OUT       MCHP_PINMUX(c, 11, 0x3a4, 5, periph)
/* pc11_tcc0wo4_out */
#define PC11_TCC0WO4_OUT       MCHP_PINMUX(c, 11, 0x3a4, 4, periph)
/* pc11_tcc1wo1_out */
#define PC11_TCC1WO1_OUT       MCHP_PINMUX(c, 11, 0x3a4, 9, periph)
/* pc11_tcc1wo2_out */
#define PC11_TCC1WO2_OUT       MCHP_PINMUX(c, 11, 0x3a4, 8, periph)
/* pc11_tcc1wo4_out */
#define PC11_TCC1WO4_OUT       MCHP_PINMUX(c, 11, 0x3a4, 7, periph)
/* pc11_tstbus3_out */
#define PC11_TSTBUS3_OUT       MCHP_PINMUX(c, 11, 0x3a4, 15, periph)
/* pc11_tstbus7_out */
#define PC11_TSTBUS7_OUT       MCHP_PINMUX(c, 11, 0x3a4, 16, periph)
/* pc11_tstbus11_out */
#define PC11_TSTBUS11_OUT      MCHP_PINMUX(c, 11, 0x3a4, 17, periph)
/* pd0_cclo0_out */
#define PD0_CCLO0_OUT          MCHP_PINMUX(d, 0, 0x3b8, 1, periph)
/* pd0_gmac_tsucomp_out */
#define PD0_GMAC_TSUCOMP_OUT   MCHP_PINMUX(d, 0, 0x3b8, 14, periph)
/* pd0_qeiccmp0_out */
#define PD0_QEICCMP0_OUT       MCHP_PINMUX(d, 0, 0x3b8, 13, periph)
/* pd0_qeiqeb0g5_in */
#define PD0_QEIQEB0G5_IN       MCHP_PINMUX(d, 0, 0x188, 17, periph)
/* pd0_qspics_out */
#define PD0_QSPICS_OUT         MCHP_PINMUX(d, 0, 0x3b8, 12, periph)
/* pd0_scom1p3_out */
#define PD0_SCOM1P3_OUT        MCHP_PINMUX(d, 0, 0x3b8, 2, periph)
/* pd0_scom2p0_out */
#define PD0_SCOM2P0_OUT        MCHP_PINMUX(d, 0, 0x3b8, 3, periph)
/* pd0_tc8wo1g5_in */
#define PD0_TC8WO1G5_IN        MCHP_PINMUX(d, 0, 0x158, 17, periph)
/* pd0_tc8wo1_out */
#define PD0_TC8WO1_OUT         MCHP_PINMUX(d, 0, 0x3b8, 10, periph)
/* pd0_tc9wo1g5_in */
#define PD0_TC9WO1G5_IN        MCHP_PINMUX(d, 0, 0x168, 17, periph)
/* pd0_tc9wo1_out */
#define PD0_TC9WO1_OUT         MCHP_PINMUX(d, 0, 0x3b8, 11, periph)
/* pd0_tcc0wo1_out */
#define PD0_TCC0WO1_OUT        MCHP_PINMUX(d, 0, 0x3b8, 6, periph)
/* pd0_tcc0wo2_out */
#define PD0_TCC0WO2_OUT        MCHP_PINMUX(d, 0, 0x3b8, 5, periph)
/* pd0_tcc0wo4_out */
#define PD0_TCC0WO4_OUT        MCHP_PINMUX(d, 0, 0x3b8, 4, periph)
/* pd0_tcc1wo1_out */
#define PD0_TCC1WO1_OUT        MCHP_PINMUX(d, 0, 0x3b8, 9, periph)
/* pd0_tcc1wo2_out */
#define PD0_TCC1WO2_OUT        MCHP_PINMUX(d, 0, 0x3b8, 8, periph)
/* pd0_tcc1wo4_out */
#define PD0_TCC1WO4_OUT        MCHP_PINMUX(d, 0, 0x3b8, 7, periph)
/* pd0_tstbus3_out */
#define PD0_TSTBUS3_OUT        MCHP_PINMUX(d, 0, 0x3b8, 15, periph)
/* pd0_tstbus7_out */
#define PD0_TSTBUS7_OUT        MCHP_PINMUX(d, 0, 0x3b8, 16, periph)
/* pd0_tstbus11_out */
#define PD0_TSTBUS11_OUT       MCHP_PINMUX(d, 0, 0x3b8, 17, periph)
/* pd1_cclo0_out */
#define PD1_CCLO0_OUT          MCHP_PINMUX(d, 1, 0x3bc, 1, periph)
/* pd1_gmac_tsucomp_out */
#define PD1_GMAC_TSUCOMP_OUT   MCHP_PINMUX(d, 1, 0x3bc, 14, periph)
/* pd1_qeiccmp0_out */
#define PD1_QEICCMP0_OUT       MCHP_PINMUX(d, 1, 0x3bc, 13, periph)
/* pd1_qeiqeb0g5_in */
#define PD1_QEIQEB0G5_IN       MCHP_PINMUX(d, 1, 0x188, 18, periph)
/* pd1_qspics_out */
#define PD1_QSPICS_OUT         MCHP_PINMUX(d, 1, 0x3bc, 12, periph)
/* pd1_scom1p3_out */
#define PD1_SCOM1P3_OUT        MCHP_PINMUX(d, 1, 0x3bc, 2, periph)
/* pd1_scom2p0_out */
#define PD1_SCOM2P0_OUT        MCHP_PINMUX(d, 1, 0x3bc, 3, periph)
/* pd1_tc8wo1g5_in */
#define PD1_TC8WO1G5_IN        MCHP_PINMUX(d, 1, 0x158, 18, periph)
/* pd1_tc8wo1_out */
#define PD1_TC8WO1_OUT         MCHP_PINMUX(d, 1, 0x3bc, 10, periph)
/* pd1_tc9wo1g5_in */
#define PD1_TC9WO1G5_IN        MCHP_PINMUX(d, 1, 0x168, 18, periph)
/* pd1_tc9wo1_out */
#define PD1_TC9WO1_OUT         MCHP_PINMUX(d, 1, 0x3bc, 11, periph)
/* pd1_tcc0wo1_out */
#define PD1_TCC0WO1_OUT        MCHP_PINMUX(d, 1, 0x3bc, 6, periph)
/* pd1_tcc0wo2_out */
#define PD1_TCC0WO2_OUT        MCHP_PINMUX(d, 1, 0x3bc, 5, periph)
/* pd1_tcc0wo4_out */
#define PD1_TCC0WO4_OUT        MCHP_PINMUX(d, 1, 0x3bc, 4, periph)
/* pd1_tcc1wo1_out */
#define PD1_TCC1WO1_OUT        MCHP_PINMUX(d, 1, 0x3bc, 9, periph)
/* pd1_tcc1wo2_out */
#define PD1_TCC1WO2_OUT        MCHP_PINMUX(d, 1, 0x3bc, 8, periph)
/* pd1_tcc1wo4_out */
#define PD1_TCC1WO4_OUT        MCHP_PINMUX(d, 1, 0x3bc, 7, periph)
/* pd1_tstbus3_out */
#define PD1_TSTBUS3_OUT        MCHP_PINMUX(d, 1, 0x3bc, 15, periph)
/* pd1_tstbus7_out */
#define PD1_TSTBUS7_OUT        MCHP_PINMUX(d, 1, 0x3bc, 16, periph)
/* pd1_tstbus11_out */
#define PD1_TSTBUS11_OUT       MCHP_PINMUX(d, 1, 0x3bc, 17, periph)
/* pd2_ac_cmp0_out */
#define PD2_AC_CMP0_OUT        MCHP_PINMUX(d, 2, 0x3c0, 40, periph)
/* pd2_ac_cmptrdy_out */
#define PD2_AC_CMPTRDY_OUT     MCHP_PINMUX(d, 2, 0x3c0, 41, periph)
/* pd2_can1rx_in */
#define PD2_CAN1RX_IN          MCHP_PINMUX(d, 2, 0x190, 8, periph)
/* pd2_cclin2_in */
#define PD2_CCLIN2_IN          MCHP_PINMUX(d, 2, 0xbc, 8, periph)
/* pd2_cclin5_in */
#define PD2_CCLIN5_IN          MCHP_PINMUX(d, 2, 0xc8, 8, periph)
/* pd2_cclo0_out */
#define PD2_CCLO0_OUT          MCHP_PINMUX(d, 2, 0x3c0, 1, periph)
/* pd2_extint2_in */
#define PD2_EXTINT2_IN         MCHP_PINMUX(d, 2, 0x8, 8, periph)
/* pd2_fectrl4_out */
#define PD2_FECTRL4_OUT        MCHP_PINMUX(d, 2, 0x3c0, 42, periph)
/* pd2_gmac_tsucomp_out */
#define PD2_GMAC_TSUCOMP_OUT   MCHP_PINMUX(d, 2, 0x3c4, 14, periph)
/* pd2_qd0_out */
#define PD2_QD0_OUT            MCHP_PINMUX(d, 2, 0x3c0, 36, periph)
/* pd2_qd1_out */
#define PD2_QD1_OUT            MCHP_PINMUX(d, 2, 0x3c0, 35, periph)
/* pd2_qd3_in */
#define PD2_QD3_IN             MCHP_PINMUX(d, 2, 0xac, 8, periph)
/* pd2_qd3_out */
#define PD2_QD3_OUT            MCHP_PINMUX(d, 2, 0x3c0, 37, periph)
/* pd2_qeiccmp0_out */
#define PD2_QEICCMP0_OUT       MCHP_PINMUX(d, 2, 0x3c4, 13, periph)
/* pd2_qeiindx0g3_in */
#define PD2_QEIINDX0G3_IN      MCHP_PINMUX(d, 2, 0x178, 8, periph)
/* pd2_qeiqea0g3_in */
#define PD2_QEIQEA0G3_IN       MCHP_PINMUX(d, 2, 0x17c, 8, periph)
/* pd2_qeiqeb0g5_in */
#define PD2_QEIQEB0G5_IN       MCHP_PINMUX(d, 2, 0x188, 10, periph)
/* pd2_qspics_out */
#define PD2_QSPICS_OUT         MCHP_PINMUX(d, 2, 0x3c0, 34, periph)
/* pd2_scom0p0_out */
#define PD2_SCOM0P0_OUT        MCHP_PINMUX(d, 2, 0x3c0, 2, periph)
/* pd2_scom0p3_out */
#define PD2_SCOM0P3_OUT        MCHP_PINMUX(d, 2, 0x3c0, 3, periph)
/* pd2_scom1p0_in */
#define PD2_SCOM1P0_IN         MCHP_PINMUX(d, 2, 0x50, 8, periph)
/* pd2_scom1p0_out */
#define PD2_SCOM1P0_OUT        MCHP_PINMUX(d, 2, 0x3c0, 5, periph)
/* pd2_scom1p2_out */
#define PD2_SCOM1P2_OUT        MCHP_PINMUX(d, 2, 0x3c0, 4, periph)
/* pd2_scom1p3_out */
#define PD2_SCOM1P3_OUT        MCHP_PINMUX(d, 2, 0x3c0, 6, periph)
/* pd2_scom2p0_out */
#define PD2_SCOM2P0_OUT        MCHP_PINMUX(d, 2, 0x3c0, 7, periph)
/* pd2_scom2p3_out */
#define PD2_SCOM2P3_OUT        MCHP_PINMUX(d, 2, 0x3c0, 8, periph)
/* pd2_scom3p0_in */
#define PD2_SCOM3P0_IN         MCHP_PINMUX(d, 2, 0x70, 8, periph)
/* pd2_scom3p0_out */
#define PD2_SCOM3P0_OUT        MCHP_PINMUX(d, 2, 0x3c0, 10, periph)
/* pd2_scom3p2_out */
#define PD2_SCOM3P2_OUT        MCHP_PINMUX(d, 2, 0x3c0, 9, periph)
/* pd2_scom3p3_out */
#define PD2_SCOM3P3_OUT        MCHP_PINMUX(d, 2, 0x3c0, 11, periph)
/* pd2_scom4p0_out */
#define PD2_SCOM4P0_OUT        MCHP_PINMUX(d, 2, 0x3c0, 12, periph)
/* pd2_scom4p3_out */
#define PD2_SCOM4P3_OUT        MCHP_PINMUX(d, 2, 0x3c0, 13, periph)
/* pd2_scom5p0_in */
#define PD2_SCOM5P0_IN         MCHP_PINMUX(d, 2, 0x90, 8, periph)
/* pd2_scom5p0_out */
#define PD2_SCOM5P0_OUT        MCHP_PINMUX(d, 2, 0x3c0, 15, periph)
/* pd2_scom5p2_out */
#define PD2_SCOM5P2_OUT        MCHP_PINMUX(d, 2, 0x3c0, 14, periph)
/* pd2_scom5p3_out */
#define PD2_SCOM5P3_OUT        MCHP_PINMUX(d, 2, 0x3c0, 16, periph)
/* pd2_tc0wo0_out */
#define PD2_TC0WO0_OUT         MCHP_PINMUX(d, 2, 0x3c0, 24, periph)
/* pd2_tc0wo1g3_in */
#define PD2_TC0WO1G3_IN        MCHP_PINMUX(d, 2, 0xd4, 8, periph)
/* pd2_tc1wo0_out */
#define PD2_TC1WO0_OUT         MCHP_PINMUX(d, 2, 0x3c0, 25, periph)
/* pd2_tc2wo0g3_in */
#define PD2_TC2WO0G3_IN        MCHP_PINMUX(d, 2, 0xf0, 8, periph)
/* pd2_tc2wo0_out */
#define PD2_TC2WO0_OUT         MCHP_PINMUX(d, 2, 0x3c0, 26, periph)
/* pd2_tc3wo0g3_in */
#define PD2_TC3WO0G3_IN        MCHP_PINMUX(d, 2, 0x100, 8, periph)
/* pd2_tc3wo0_out */
#define PD2_TC3WO0_OUT         MCHP_PINMUX(d, 2, 0x3c0, 27, periph)
/* pd2_tc4wo0g3_in */
#define PD2_TC4WO0G3_IN        MCHP_PINMUX(d, 2, 0x110, 8, periph)
/* pd2_tc4wo0_out */
#define PD2_TC4WO0_OUT         MCHP_PINMUX(d, 2, 0x3c0, 28, periph)
/* pd2_tc5wo0g3_in */
#define PD2_TC5WO0G3_IN        MCHP_PINMUX(d, 2, 0x120, 8, periph)
/* pd2_tc5wo0_out */
#define PD2_TC5WO0_OUT         MCHP_PINMUX(d, 2, 0x3c0, 29, periph)
/* pd2_tc6wo0g3_in */
#define PD2_TC6WO0G3_IN        MCHP_PINMUX(d, 2, 0x130, 8, periph)
/* pd2_tc6wo0_out */
#define PD2_TC6WO0_OUT         MCHP_PINMUX(d, 2, 0x3c0, 30, periph)
/* pd2_tc7wo0g3_in */
#define PD2_TC7WO0G3_IN        MCHP_PINMUX(d, 2, 0x140, 8, periph)
/* pd2_tc7wo0_out */
#define PD2_TC7WO0_OUT         MCHP_PINMUX(d, 2, 0x3c0, 31, periph)
/* pd2_tc8wo0g3_in */
#define PD2_TC8WO0G3_IN        MCHP_PINMUX(d, 2, 0x150, 8, periph)
/* pd2_tc8wo0_out */
#define PD2_TC8WO0_OUT         MCHP_PINMUX(d, 2, 0x3c0, 32, periph)
/* pd2_tc8wo1g5_in */
#define PD2_TC8WO1G5_IN        MCHP_PINMUX(d, 2, 0x158, 10, periph)
/* pd2_tc8wo1_out */
#define PD2_TC8WO1_OUT         MCHP_PINMUX(d, 2, 0x3c4, 10, periph)
/* pd2_tc9wo1g3_in */
#define PD2_TC9WO1G3_IN        MCHP_PINMUX(d, 2, 0x164, 8, periph)
/* pd2_tc9wo1g5_in */
#define PD2_TC9WO1G5_IN        MCHP_PINMUX(d, 2, 0x168, 10, periph)
/* pd2_tc9wo1_out */
#define PD2_TC9WO1_OUT         MCHP_PINMUX(d, 2, 0x3c0, 33, periph)
/* pd2_tcc0wo0_out */
#define PD2_TCC0WO0_OUT        MCHP_PINMUX(d, 2, 0x3c0, 18, periph)
/* pd2_tcc0wo1_out */
#define PD2_TCC0WO1_OUT        MCHP_PINMUX(d, 2, 0x3c4, 6, periph)
/* pd2_tcc0wo2_out */
#define PD2_TCC0WO2_OUT        MCHP_PINMUX(d, 2, 0x3c0, 17, periph)
/* pd2_tcc0wo4_out */
#define PD2_TCC0WO4_OUT        MCHP_PINMUX(d, 2, 0x3c0, 19, periph)
/* pd2_tcc1wo0_out */
#define PD2_TCC1WO0_OUT        MCHP_PINMUX(d, 2, 0x3c0, 21, periph)
/* pd2_tcc1wo1_out */
#define PD2_TCC1WO1_OUT        MCHP_PINMUX(d, 2, 0x3c4, 9, periph)
/* pd2_tcc1wo2_out */
#define PD2_TCC1WO2_OUT        MCHP_PINMUX(d, 2, 0x3c0, 20, periph)
/* pd2_tcc1wo4_out */
#define PD2_TCC1WO4_OUT        MCHP_PINMUX(d, 2, 0x3c0, 22, periph)
/* pd2_tcc2wo0_out */
#define PD2_TCC2WO0_OUT        MCHP_PINMUX(d, 2, 0x3c0, 23, periph)
/* pd2_tstbus1_out */
#define PD2_TSTBUS1_OUT        MCHP_PINMUX(d, 2, 0x3c0, 38, periph)
/* pd2_tstbus3_out */
#define PD2_TSTBUS3_OUT        MCHP_PINMUX(d, 2, 0x3c4, 15, periph)
/* pd2_tstbus7_out */
#define PD2_TSTBUS7_OUT        MCHP_PINMUX(d, 2, 0x3c4, 16, periph)
/* pd2_tstbus10_out */
#define PD2_TSTBUS10_OUT       MCHP_PINMUX(d, 2, 0x3c0, 39, periph)
/* pd2_tstbus11_out */
#define PD2_TSTBUS11_OUT       MCHP_PINMUX(d, 2, 0x3c4, 17, periph)
/* pd3_accmpten_in */
#define PD3_ACCMPTEN_IN        MCHP_PINMUX(d, 3, 0x18c, 13, periph)
/* pd3_ac_cmp1_out */
#define PD3_AC_CMP1_OUT        MCHP_PINMUX(d, 3, 0x3cc, 36, periph)
/* pd3_ac_cmptout_out */
#define PD3_AC_CMPTOUT_OUT     MCHP_PINMUX(d, 3, 0x3cc, 37, periph)
/* pd3_can1_tx_out */
#define PD3_CAN1_TX_OUT        MCHP_PINMUX(d, 3, 0x3cc, 38, periph)
/* pd3_cclin0_in */
#define PD3_CCLIN0_IN          MCHP_PINMUX(d, 3, 0xb4, 13, periph)
/* pd3_cclin3_in */
#define PD3_CCLIN3_IN          MCHP_PINMUX(d, 3, 0xc0, 13, periph)
/* pd3_cclo1_out */
#define PD3_CCLO1_OUT          MCHP_PINMUX(d, 3, 0x3cc, 1, periph)
/* pd3_coexwlanact_in */
#define PD3_COEXWLANACT_IN     MCHP_PINMUX(d, 3, 0x194, 6, periph)
/* pd3_coex_bt_state_out */
#define PD3_COEX_BT_STATE_OUT  MCHP_PINMUX(d, 3, 0x3c8, 37, periph)
/* pd3_extint0_in */
#define PD3_EXTINT0_IN         MCHP_PINMUX(d, 3, 0x0, 13, periph)
/* pd3_extint3_in */
#define PD3_EXTINT3_IN         MCHP_PINMUX(d, 3, 0xc, 6, periph)
/* pd3_fectrl1_out */
#define PD3_FECTRL1_OUT        MCHP_PINMUX(d, 3, 0x3c8, 35, periph)
/* pd3_fectrl2_out */
#define PD3_FECTRL2_OUT        MCHP_PINMUX(d, 3, 0x3c8, 36, periph)
/* pd3_fectrl3_out */
#define PD3_FECTRL3_OUT        MCHP_PINMUX(d, 3, 0x3cc, 39, periph)
/* pd3_fectrl5_out */
#define PD3_FECTRL5_OUT        MCHP_PINMUX(d, 3, 0x3cc, 40, periph)
/* pd3_nmi_in */
#define PD3_NMI_IN             MCHP_PINMUX(d, 3, 0x3c, 6, periph)
/* pd3_qd0_in */
#define PD3_QD0_IN             MCHP_PINMUX(d, 3, 0xa0, 6, periph)
/* pd3_qd0_out */
#define PD3_QD0_OUT            MCHP_PINMUX(d, 3, 0x3cc, 33, periph)
/* pd3_qd1_in */
#define PD3_QD1_IN             MCHP_PINMUX(d, 3, 0xa4, 13, periph)
/* pd3_qd1_out */
#define PD3_QD1_OUT            MCHP_PINMUX(d, 3, 0x3c8, 30, periph)
/* pd3_qd2_out */
#define PD3_QD2_OUT            MCHP_PINMUX(d, 3, 0x3c8, 29, periph)
/* pd3_qd3_out */
#define PD3_QD3_OUT            MCHP_PINMUX(d, 3, 0x3c8, 28, periph)
/* pd3_qeiccmp0_out */
#define PD3_QEICCMP0_OUT       MCHP_PINMUX(d, 3, 0x3c8, 31, periph)
/* pd3_qeihome0g1_in */
#define PD3_QEIHOME0G1_IN      MCHP_PINMUX(d, 3, 0x16c, 13, periph)
/* pd3_qeiqea0g4_in */
#define PD3_QEIQEA0G4_IN       MCHP_PINMUX(d, 3, 0x180, 6, periph)
/* pd3_qeiqeb0g4_in */
