zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62132-pinctrl.h
#define PE1_TCC0WO5_OUT        MCHP_PINMUX(e, 1, 0x414, 18, periph)
/* pe1_tcc1wo1_out */
#define PE1_TCC1WO1_OUT        MCHP_PINMUX(e, 1, 0x414, 20, periph)
/* pe1_tcc1wo3_out */
#define PE1_TCC1WO3_OUT        MCHP_PINMUX(e, 1, 0x414, 22, periph)
/* pe1_tcc1wo5_out */
#define PE1_TCC1WO5_OUT        MCHP_PINMUX(e, 1, 0x414, 21, periph)
/* pe1_tcc2wo1_out */
#define PE1_TCC2WO1_OUT        MCHP_PINMUX(e, 1, 0x414, 23, periph)
/* pe1_tstbus2_out */
#define PE1_TSTBUS2_OUT        MCHP_PINMUX(e, 1, 0x418, 34, periph)
/* pe1_tstbus5_out */
#define PE1_TSTBUS5_OUT        MCHP_PINMUX(e, 1, 0x414, 38, periph)
/* pe1_tstbus6_out */
#define PE1_TSTBUS6_OUT        MCHP_PINMUX(e, 1, 0x418, 35, periph)
/* pe1_tstbus9_out */
#define PE1_TSTBUS9_OUT        MCHP_PINMUX(e, 1, 0x414, 39, periph)
/* pe2_ac_cmp0_out */
#define PE2_AC_CMP0_OUT        MCHP_PINMUX(e, 2, 0x41c, 40, periph)
/* pe2_ac_cmptrdy_out */
#define PE2_AC_CMPTRDY_OUT     MCHP_PINMUX(e, 2, 0x41c, 41, periph)
/* pe2_can1rx_in */
#define PE2_CAN1RX_IN          MCHP_PINMUX(e, 2, 0x190, 9, periph)
/* pe2_cclin2_in */
#define PE2_CCLIN2_IN          MCHP_PINMUX(e, 2, 0xbc, 9, periph)
/* pe2_cclin5_in */
#define PE2_CCLIN5_IN          MCHP_PINMUX(e, 2, 0xc8, 9, periph)
/* pe2_cclo0_out */
#define PE2_CCLO0_OUT          MCHP_PINMUX(e, 2, 0x41c, 1, periph)
/* pe2_extint2_in */
#define PE2_EXTINT2_IN         MCHP_PINMUX(e, 2, 0x8, 9, periph)
/* pe2_fectrl4_out */
#define PE2_FECTRL4_OUT        MCHP_PINMUX(e, 2, 0x41c, 42, periph)
/* pe2_gmac_tsucomp_out */
#define PE2_GMAC_TSUCOMP_OUT   MCHP_PINMUX(e, 2, 0x420, 14, periph)
/* pe2_qd0_out */
#define PE2_QD0_OUT            MCHP_PINMUX(e, 2, 0x41c, 36, periph)
/* pe2_qd1_out */
#define PE2_QD1_OUT            MCHP_PINMUX(e, 2, 0x41c, 35, periph)
/* pe2_qd3_in */
#define PE2_QD3_IN             MCHP_PINMUX(e, 2, 0xac, 9, periph)
/* pe2_qd3_out */
#define PE2_QD3_OUT            MCHP_PINMUX(e, 2, 0x41c, 37, periph)
/* pe2_qeiccmp0_out */
#define PE2_QEICCMP0_OUT       MCHP_PINMUX(e, 2, 0x420, 13, periph)
/* pe2_qeiindx0g3_in */
#define PE2_QEIINDX0G3_IN      MCHP_PINMUX(e, 2, 0x178, 9, periph)
/* pe2_qeiqea0g3_in */
#define PE2_QEIQEA0G3_IN       MCHP_PINMUX(e, 2, 0x17c, 9, periph)
/* pe2_qeiqeb0g5_in */
#define PE2_QEIQEB0G5_IN       MCHP_PINMUX(e, 2, 0x188, 11, periph)
/* pe2_qspics_out */
#define PE2_QSPICS_OUT         MCHP_PINMUX(e, 2, 0x41c, 34, periph)
/* pe2_scom0p0_out */
#define PE2_SCOM0P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 2, periph)
/* pe2_scom0p3_out */
#define PE2_SCOM0P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 3, periph)
/* pe2_scom1p0_in */
#define PE2_SCOM1P0_IN         MCHP_PINMUX(e, 2, 0x50, 9, periph)
/* pe2_scom1p0_out */
#define PE2_SCOM1P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 5, periph)
/* pe2_scom1p2_out */
#define PE2_SCOM1P2_OUT        MCHP_PINMUX(e, 2, 0x41c, 4, periph)
/* pe2_scom1p3_out */
#define PE2_SCOM1P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 6, periph)
/* pe2_scom2p0_out */
#define PE2_SCOM2P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 7, periph)
/* pe2_scom2p3_out */
#define PE2_SCOM2P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 8, periph)
/* pe2_scom3p0_in */
#define PE2_SCOM3P0_IN         MCHP_PINMUX(e, 2, 0x70, 9, periph)
/* pe2_scom3p0_out */
#define PE2_SCOM3P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 10, periph)
/* pe2_scom3p2_out */
#define PE2_SCOM3P2_OUT        MCHP_PINMUX(e, 2, 0x41c, 9, periph)
/* pe2_scom3p3_out */
#define PE2_SCOM3P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 11, periph)
/* pe2_scom4p0_out */
#define PE2_SCOM4P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 12, periph)
/* pe2_scom4p3_out */
#define PE2_SCOM4P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 13, periph)
/* pe2_scom5p0_in */
#define PE2_SCOM5P0_IN         MCHP_PINMUX(e, 2, 0x90, 9, periph)
/* pe2_scom5p0_out */
#define PE2_SCOM5P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 15, periph)
/* pe2_scom5p2_out */
#define PE2_SCOM5P2_OUT        MCHP_PINMUX(e, 2, 0x41c, 14, periph)
/* pe2_scom5p3_out */
#define PE2_SCOM5P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 16, periph)
/* pe2_tc0wo0_out */
#define PE2_TC0WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 24, periph)
/* pe2_tc0wo1g3_in */
#define PE2_TC0WO1G3_IN        MCHP_PINMUX(e, 2, 0xd4, 9, periph)
/* pe2_tc1wo0_out */
#define PE2_TC1WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 25, periph)
/* pe2_tc2wo0g3_in */
#define PE2_TC2WO0G3_IN        MCHP_PINMUX(e, 2, 0xf0, 9, periph)
/* pe2_tc2wo0_out */
#define PE2_TC2WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 26, periph)
/* pe2_tc3wo0g3_in */
#define PE2_TC3WO0G3_IN        MCHP_PINMUX(e, 2, 0x100, 9, periph)
/* pe2_tc3wo0_out */
#define PE2_TC3WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 27, periph)
/* pe2_tc4wo0g3_in */
#define PE2_TC4WO0G3_IN        MCHP_PINMUX(e, 2, 0x110, 9, periph)
/* pe2_tc4wo0_out */
#define PE2_TC4WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 28, periph)
/* pe2_tc5wo0g3_in */
#define PE2_TC5WO0G3_IN        MCHP_PINMUX(e, 2, 0x120, 9, periph)
/* pe2_tc5wo0_out */
#define PE2_TC5WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 29, periph)
/* pe2_tc6wo0g3_in */
#define PE2_TC6WO0G3_IN        MCHP_PINMUX(e, 2, 0x130, 9, periph)
/* pe2_tc6wo0_out */
#define PE2_TC6WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 30, periph)
/* pe2_tc7wo0g3_in */
#define PE2_TC7WO0G3_IN        MCHP_PINMUX(e, 2, 0x140, 9, periph)
/* pe2_tc7wo0_out */
#define PE2_TC7WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 31, periph)
/* pe2_tc8wo0g3_in */
#define PE2_TC8WO0G3_IN        MCHP_PINMUX(e, 2, 0x150, 9, periph)
/* pe2_tc8wo0_out */
#define PE2_TC8WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 32, periph)
/* pe2_tc8wo1g5_in */
#define PE2_TC8WO1G5_IN        MCHP_PINMUX(e, 2, 0x158, 11, periph)
/* pe2_tc8wo1_out */
#define PE2_TC8WO1_OUT         MCHP_PINMUX(e, 2, 0x420, 10, periph)
/* pe2_tc9wo1g3_in */
#define PE2_TC9WO1G3_IN        MCHP_PINMUX(e, 2, 0x164, 9, periph)
/* pe2_tc9wo1g5_in */
#define PE2_TC9WO1G5_IN        MCHP_PINMUX(e, 2, 0x168, 11, periph)
/* pe2_tc9wo1_out */
#define PE2_TC9WO1_OUT         MCHP_PINMUX(e, 2, 0x41c, 33, periph)
/* pe2_tcc0wo0_out */
#define PE2_TCC0WO0_OUT        MCHP_PINMUX(e, 2, 0x41c, 18, periph)
/* pe2_tcc0wo1_out */
#define PE2_TCC0WO1_OUT        MCHP_PINMUX(e, 2, 0x420, 6, periph)
/* pe2_tcc0wo2_out */
#define PE2_TCC0WO2_OUT        MCHP_PINMUX(e, 2, 0x41c, 17, periph)
/* pe2_tcc0wo4_out */
#define PE2_TCC0WO4_OUT        MCHP_PINMUX(e, 2, 0x41c, 19, periph)
/* pe2_tcc1wo0_out */
#define PE2_TCC1WO0_OUT        MCHP_PINMUX(e, 2, 0x41c, 21, periph)
/* pe2_tcc1wo1_out */
#define PE2_TCC1WO1_OUT        MCHP_PINMUX(e, 2, 0x420, 9, periph)
/* pe2_tcc1wo2_out */
#define PE2_TCC1WO2_OUT        MCHP_PINMUX(e, 2, 0x41c, 20, periph)
/* pe2_tcc1wo4_out */
#define PE2_TCC1WO4_OUT        MCHP_PINMUX(e, 2, 0x41c, 22, periph)
/* pe2_tcc2wo0_out */
#define PE2_TCC2WO0_OUT        MCHP_PINMUX(e, 2, 0x41c, 23, periph)
/* pe2_tstbus1_out */
#define PE2_TSTBUS1_OUT        MCHP_PINMUX(e, 2, 0x41c, 38, periph)
/* pe2_tstbus3_out */
#define PE2_TSTBUS3_OUT        MCHP_PINMUX(e, 2, 0x420, 15, periph)
/* pe2_tstbus7_out */
#define PE2_TSTBUS7_OUT        MCHP_PINMUX(e, 2, 0x420, 16, periph)
/* pe2_tstbus10_out */
#define PE2_TSTBUS10_OUT       MCHP_PINMUX(e, 2, 0x41c, 39, periph)
/* pe2_tstbus11_out */
#define PE2_TSTBUS11_OUT       MCHP_PINMUX(e, 2, 0x420, 17, periph)
/* pe3_ac_cmp1_out */
#define PE3_AC_CMP1_OUT        MCHP_PINMUX(e, 3, 0x424, 36, periph)
/* pe3_ac_cmptout_out */
#define PE3_AC_CMPTOUT_OUT     MCHP_PINMUX(e, 3, 0x424, 37, periph)
/* pe3_can1_tx_out */
#define PE3_CAN1_TX_OUT        MCHP_PINMUX(e, 3, 0x424, 38, periph)
/* pe3_cclo1_out */
#define PE3_CCLO1_OUT          MCHP_PINMUX(e, 3, 0x424, 1, periph)
/* pe3_coexwlanact_in */
#define PE3_COEXWLANACT_IN     MCHP_PINMUX(e, 3, 0x194, 7, periph)
/* pe3_extint3_in */
#define PE3_EXTINT3_IN         MCHP_PINMUX(e, 3, 0xc, 7, periph)
/* pe3_fectrl3_out */
#define PE3_FECTRL3_OUT        MCHP_PINMUX(e, 3, 0x424, 39, periph)
/* pe3_fectrl5_out */
#define PE3_FECTRL5_OUT        MCHP_PINMUX(e, 3, 0x424, 40, periph)
/* pe3_nmi_in */
#define PE3_NMI_IN             MCHP_PINMUX(e, 3, 0x3c, 7, periph)
/* pe3_qd0_in */
#define PE3_QD0_IN             MCHP_PINMUX(e, 3, 0xa0, 7, periph)
/* pe3_qd0_out */
#define PE3_QD0_OUT            MCHP_PINMUX(e, 3, 0x424, 33, periph)
/* pe3_qd1_out */
#define PE3_QD1_OUT            MCHP_PINMUX(e, 3, 0x424, 32, periph)
/* pe3_qd2_out */
#define PE3_QD2_OUT            MCHP_PINMUX(e, 3, 0x424, 31, periph)
/* pe3_qeiqea0g4_in */
#define PE3_QEIQEA0G4_IN       MCHP_PINMUX(e, 3, 0x180, 7, periph)
/* pe3_qeiqeb0g4_in */
#define PE3_QEIQEB0G4_IN       MCHP_PINMUX(e, 3, 0x184, 7, periph)
/* pe3_qspics_out */
#define PE3_QSPICS_OUT         MCHP_PINMUX(e, 3, 0x424, 30, periph)
/* pe3_scom0p0_out */
#define PE3_SCOM0P0_OUT        MCHP_PINMUX(e, 3, 0x424, 3, periph)
/* pe3_scom0p2_in */
#define PE3_SCOM0P2_IN         MCHP_PINMUX(e, 3, 0x48, 7, periph)
/* pe3_scom0p2_out */
#define PE3_SCOM0P2_OUT        MCHP_PINMUX(e, 3, 0x424, 2, periph)
/* pe3_scom1p0_out */
#define PE3_SCOM1P0_OUT        MCHP_PINMUX(e, 3, 0x424, 5, periph)
/* pe3_scom1p3_out */
#define PE3_SCOM1P3_OUT        MCHP_PINMUX(e, 3, 0x424, 4, periph)
/* pe3_scom2p0_out */
#define PE3_SCOM2P0_OUT        MCHP_PINMUX(e, 3, 0x424, 7, periph)
/* pe3_scom2p2_in */
#define PE3_SCOM2P2_IN         MCHP_PINMUX(e, 3, 0x68, 7, periph)
/* pe3_scom2p2_out */
#define PE3_SCOM2P2_OUT        MCHP_PINMUX(e, 3, 0x424, 6, periph)
/* pe3_scom3p0_out */
#define PE3_SCOM3P0_OUT        MCHP_PINMUX(e, 3, 0x424, 9, periph)
/* pe3_scom3p3_out */
#define PE3_SCOM3P3_OUT        MCHP_PINMUX(e, 3, 0x424, 8, periph)
/* pe3_scom4p0_out */
#define PE3_SCOM4P0_OUT        MCHP_PINMUX(e, 3, 0x424, 11, periph)
/* pe3_scom4p2_in */
#define PE3_SCOM4P2_IN         MCHP_PINMUX(e, 3, 0x88, 7, periph)
/* pe3_scom4p2_out */
#define PE3_SCOM4P2_OUT        MCHP_PINMUX(e, 3, 0x424, 10, periph)
/* pe3_scom5p0_out */
#define PE3_SCOM5P0_OUT        MCHP_PINMUX(e, 3, 0x424, 13, periph)
/* pe3_scom5p3_out */
#define PE3_SCOM5P3_OUT        MCHP_PINMUX(e, 3, 0x424, 12, periph)
/* pe3_tc0wo0_out */
#define PE3_TC0WO0_OUT         MCHP_PINMUX(e, 3, 0x424, 21, periph)
/* pe3_tc0wo1g4_in */
#define PE3_TC0WO1G4_IN        MCHP_PINMUX(e, 3, 0xd8, 7, periph)
/* pe3_tc1wo1_out */
#define PE3_TC1WO1_OUT         MCHP_PINMUX(e, 3, 0x424, 22, periph)
/* pe3_tc2wo1g4_in */
#define PE3_TC2WO1G4_IN        MCHP_PINMUX(e, 3, 0xf8, 7, periph)
/* pe3_tc2wo1_out */
#define PE3_TC2WO1_OUT         MCHP_PINMUX(e, 3, 0x424, 23, periph)
/* pe3_tc3wo1g4_in */
#define PE3_TC3WO1G4_IN        MCHP_PINMUX(e, 3, 0x108, 7, periph)
/* pe3_tc3wo1_out */
#define PE3_TC3WO1_OUT         MCHP_PINMUX(e, 3, 0x424, 24, periph)
/* pe3_tc4wo1g4_in */
#define PE3_TC4WO1G4_IN        MCHP_PINMUX(e, 3, 0x118, 7, periph)
/* pe3_tc4wo1_out */
#define PE3_TC4WO1_OUT         MCHP_PINMUX(e, 3, 0x424, 25, periph)
/* pe3_tc5wo1g4_in */
#define PE3_TC5WO1G4_IN        MCHP_PINMUX(e, 3, 0x128, 7, periph)
/* pe3_tc5wo1_out */
#define PE3_TC5WO1_OUT         MCHP_PINMUX(e, 3, 0x424, 26, periph)
/* pe3_tc6wo1g4_in */
#define PE3_TC6WO1G4_IN        MCHP_PINMUX(e, 3, 0x138, 7, periph)
/* pe3_tc6wo1_out */
#define PE3_TC6WO1_OUT         MCHP_PINMUX(e, 3, 0x424, 27, periph)
/* pe3_tc7wo1g4_in */
#define PE3_TC7WO1G4_IN        MCHP_PINMUX(e, 3, 0x148, 7, periph)
/* pe3_tc7wo1_out */
#define PE3_TC7WO1_OUT         MCHP_PINMUX(e, 3, 0x424, 28, periph)
/* pe3_tc9wo0g4_in */
#define PE3_TC9WO0G4_IN        MCHP_PINMUX(e, 3, 0x160, 7, periph)
/* pe3_tc9wo0_out */
#define PE3_TC9WO0_OUT         MCHP_PINMUX(e, 3, 0x424, 29, periph)
/* pe3_tcc0wo1_out */
#define PE3_TCC0WO1_OUT        MCHP_PINMUX(e, 3, 0x424, 15, periph)
/* pe3_tcc0wo3_out */
#define PE3_TCC0WO3_OUT        MCHP_PINMUX(e, 3, 0x424, 14, periph)
/* pe3_tcc0wo5_out */
#define PE3_TCC0WO5_OUT        MCHP_PINMUX(e, 3, 0x424, 16, periph)
/* pe3_tcc1wo1_out */
#define PE3_TCC1WO1_OUT        MCHP_PINMUX(e, 3, 0x424, 18, periph)
/* pe3_tcc1wo3_out */
#define PE3_TCC1WO3_OUT        MCHP_PINMUX(e, 3, 0x424, 17, periph)
/* pe3_tcc1wo5_out */
#define PE3_TCC1WO5_OUT        MCHP_PINMUX(e, 3, 0x424, 19, periph)
/* pe3_tcc2wo1_out */
#define PE3_TCC2WO1_OUT        MCHP_PINMUX(e, 3, 0x424, 20, periph)
/* pe3_tstbus2_out */
#define PE3_TSTBUS2_OUT        MCHP_PINMUX(e, 3, 0x424, 34, periph)
/* pe3_tstbus6_out */
#define PE3_TSTBUS6_OUT        MCHP_PINMUX(e, 3, 0x424, 35, periph)
/* pe4_accmpten_in */
#define PE4_ACCMPTEN_IN        MCHP_PINMUX(e, 4, 0x18c, 14, periph)
/* pe4_cclin0_in */
#define PE4_CCLIN0_IN          MCHP_PINMUX(e, 4, 0xb4, 14, periph)
/* pe4_cclin3_in */
#define PE4_CCLIN3_IN          MCHP_PINMUX(e, 4, 0xc0, 14, periph)
/* pe4_cclo0_out */
#define PE4_CCLO0_OUT          MCHP_PINMUX(e, 4, 0x42c, 1, periph)
/* pe4_coex_bt_state_out */
#define PE4_COEX_BT_STATE_OUT  MCHP_PINMUX(e, 4, 0x428, 37, periph)
/* pe4_extint0_in */
#define PE4_EXTINT0_IN         MCHP_PINMUX(e, 4, 0x0, 14, periph)
/* pe4_fectrl1_out */
#define PE4_FECTRL1_OUT        MCHP_PINMUX(e, 4, 0x428, 35, periph)
/* pe4_fectrl2_out */
#define PE4_FECTRL2_OUT        MCHP_PINMUX(e, 4, 0x428, 36, periph)
/* pe4_gmac_tsucomp_out */
#define PE4_GMAC_TSUCOMP_OUT   MCHP_PINMUX(e, 4, 0x42c, 14, periph)
/* pe4_qd1_in */
#define PE4_QD1_IN             MCHP_PINMUX(e, 4, 0xa4, 14, periph)
/* pe4_qd1_out */
#define PE4_QD1_OUT            MCHP_PINMUX(e, 4, 0x428, 30, periph)
/* pe4_qd2_out */
#define PE4_QD2_OUT            MCHP_PINMUX(e, 4, 0x428, 29, periph)
/* pe4_qd3_out */
#define PE4_QD3_OUT            MCHP_PINMUX(e, 4, 0x428, 28, periph)
/* pe4_qeiccmp0_out */
#define PE4_QEICCMP0_OUT       MCHP_PINMUX(e, 4, 0x428, 31, periph)
/* pe4_qeihome0g1_in */
#define PE4_QEIHOME0G1_IN      MCHP_PINMUX(e, 4, 0x16c, 14, periph)
/* pe4_qeiqeb0g5_in */
#define PE4_QEIQEB0G5_IN       MCHP_PINMUX(e, 4, 0x188, 6, periph)
/* pe4_qspics_out */
#define PE4_QSPICS_OUT         MCHP_PINMUX(e, 4, 0x428, 27, periph)
/* pe4_scom0p2_out */
#define PE4_SCOM0P2_OUT        MCHP_PINMUX(e, 4, 0x428, 2, periph)
/* pe4_scom0p3_in */
#define PE4_SCOM0P3_IN         MCHP_PINMUX(e, 4, 0x4c, 14, periph)
/* pe4_scom0p3_out */
#define PE4_SCOM0P3_OUT        MCHP_PINMUX(e, 4, 0x428, 1, periph)
/* pe4_scom1p0_out */
#define PE4_SCOM1P0_OUT        MCHP_PINMUX(e, 4, 0x428, 3, periph)
/* pe4_scom1p2_in */
#define PE4_SCOM1P2_IN         MCHP_PINMUX(e, 4, 0x58, 14, periph)
/* pe4_scom1p2_out */
#define PE4_SCOM1P2_OUT        MCHP_PINMUX(e, 4, 0x428, 4, periph)
/* pe4_scom1p3_out */
#define PE4_SCOM1P3_OUT        MCHP_PINMUX(e, 4, 0x42c, 2, periph)
/* pe4_scom2p0_out */
#define PE4_SCOM2P0_OUT        MCHP_PINMUX(e, 4, 0x42c, 3, periph)
/* pe4_scom2p2_out */
#define PE4_SCOM2P2_OUT        MCHP_PINMUX(e, 4, 0x428, 6, periph)
/* pe4_scom2p3_in */
#define PE4_SCOM2P3_IN         MCHP_PINMUX(e, 4, 0x6c, 14, periph)
/* pe4_scom2p3_out */
#define PE4_SCOM2P3_OUT        MCHP_PINMUX(e, 4, 0x428, 5, periph)
/* pe4_scom3p0_out */
#define PE4_SCOM3P0_OUT        MCHP_PINMUX(e, 4, 0x428, 7, periph)
/* pe4_scom3p2_in */
#define PE4_SCOM3P2_IN         MCHP_PINMUX(e, 4, 0x78, 14, periph)
/* pe4_scom3p2_out */
#define PE4_SCOM3P2_OUT        MCHP_PINMUX(e, 4, 0x428, 8, periph)
/* pe4_scom4p2_out */
#define PE4_SCOM4P2_OUT        MCHP_PINMUX(e, 4, 0x428, 10, periph)
/* pe4_scom4p3_in */
#define PE4_SCOM4P3_IN         MCHP_PINMUX(e, 4, 0x8c, 14, periph)
/* pe4_scom4p3_out */
#define PE4_SCOM4P3_OUT        MCHP_PINMUX(e, 4, 0x428, 9, periph)
/* pe4_scom5p0_out */
#define PE4_SCOM5P0_OUT        MCHP_PINMUX(e, 4, 0x428, 11, periph)
/* pe4_scom5p2_in */
#define PE4_SCOM5P2_IN         MCHP_PINMUX(e, 4, 0x98, 14, periph)
/* pe4_scom5p2_out */
#define PE4_SCOM5P2_OUT        MCHP_PINMUX(e, 4, 0x428, 12, periph)
/* pe4_tc0wo0g1_in */
#define PE4_TC0WO0G1_IN        MCHP_PINMUX(e, 4, 0xcc, 14, periph)
/* pe4_tc0wo1_out */
#define PE4_TC0WO1_OUT         MCHP_PINMUX(e, 4, 0x428, 18, periph)
/* pe4_tc1wo0g1_in */
#define PE4_TC1WO0G1_IN        MCHP_PINMUX(e, 4, 0xdc, 14, periph)
/* pe4_tc1wo0_out */
#define PE4_TC1WO0_OUT         MCHP_PINMUX(e, 4, 0x428, 19, periph)
/* pe4_tc2wo0g1_in */
#define PE4_TC2WO0G1_IN        MCHP_PINMUX(e, 4, 0xec, 14, periph)
/* pe4_tc2wo0_out */
#define PE4_TC2WO0_OUT         MCHP_PINMUX(e, 4, 0x428, 20, periph)
/* pe4_tc3wo0g1_in */
#define PE4_TC3WO0G1_IN        MCHP_PINMUX(e, 4, 0xfc, 14, periph)
/* pe4_tc3wo0_out */
#define PE4_TC3WO0_OUT         MCHP_PINMUX(e, 4, 0x428, 21, periph)
/* pe4_tc4wo0g1_in */
#define PE4_TC4WO0G1_IN        MCHP_PINMUX(e, 4, 0x10c, 14, periph)
/* pe4_tc4wo0_out */
#define PE4_TC4WO0_OUT         MCHP_PINMUX(e, 4, 0x428, 22, periph)
/* pe4_tc5wo0g1_in */
#define PE4_TC5WO0G1_IN        MCHP_PINMUX(e, 4, 0x11c, 14, periph)
/* pe4_tc5wo0_out */
#define PE4_TC5WO0_OUT         MCHP_PINMUX(e, 4, 0x428, 23, periph)
/* pe4_tc6wo0g1_in */
#define PE4_TC6WO0G1_IN        MCHP_PINMUX(e, 4, 0x12c, 14, periph)
/* pe4_tc6wo0_out */
#define PE4_TC6WO0_OUT         MCHP_PINMUX(e, 4, 0x428, 24, periph)
/* pe4_tc7wo0g1_in */
#define PE4_TC7WO0G1_IN        MCHP_PINMUX(e, 4, 0x13c, 14, periph)
/* pe4_tc7wo0_out */
#define PE4_TC7WO0_OUT         MCHP_PINMUX(e, 4, 0x428, 25, periph)
/* pe4_tc8wo0g1_in */
#define PE4_TC8WO0G1_IN        MCHP_PINMUX(e, 4, 0x14c, 14, periph)
/* pe4_tc8wo0_out */
#define PE4_TC8WO0_OUT         MCHP_PINMUX(e, 4, 0x428, 26, periph)
/* pe4_tc8wo1g5_in */
#define PE4_TC8WO1G5_IN        MCHP_PINMUX(e, 4, 0x158, 6, periph)
/* pe4_tc8wo1_out */
#define PE4_TC8WO1_OUT         MCHP_PINMUX(e, 4, 0x42c, 10, periph)
/* pe4_tc9wo1g5_in */
#define PE4_TC9WO1G5_IN        MCHP_PINMUX(e, 4, 0x168, 6, periph)
/* pe4_tc9wo1_out */
#define PE4_TC9WO1_OUT         MCHP_PINMUX(e, 4, 0x42c, 11, periph)
/* pe4_tcc0wo0_out */
#define PE4_TCC0WO0_OUT        MCHP_PINMUX(e, 4, 0x428, 13, periph)
/* pe4_tcc0wo1_out */
#define PE4_TCC0WO1_OUT        MCHP_PINMUX(e, 4, 0x42c, 6, periph)
/* pe4_tcc0wo2_out */
#define PE4_TCC0WO2_OUT        MCHP_PINMUX(e, 4, 0x42c, 5, periph)
/* pe4_tcc0wo4_out */
#define PE4_TCC0WO4_OUT        MCHP_PINMUX(e, 4, 0x428, 14, periph)
/* pe4_tcc1wo0_out */
#define PE4_TCC1WO0_OUT        MCHP_PINMUX(e, 4, 0x428, 15, periph)
/* pe4_tcc1wo1_out */
#define PE4_TCC1WO1_OUT        MCHP_PINMUX(e, 4, 0x42c, 9, periph)
/* pe4_tcc1wo2_out */
#define PE4_TCC1WO2_OUT        MCHP_PINMUX(e, 4, 0x42c, 8, periph)
/* pe4_tcc1wo4_out */
#define PE4_TCC1WO4_OUT        MCHP_PINMUX(e, 4, 0x428, 16, periph)
/* pe4_tcc2wo0_out */
#define PE4_TCC2WO0_OUT        MCHP_PINMUX(e, 4, 0x428, 17, periph)
/* pe4_tstbus0_out */
#define PE4_TSTBUS0_OUT        MCHP_PINMUX(e, 4, 0x428, 32, periph)
/* pe4_tstbus3_out */
#define PE4_TSTBUS3_OUT        MCHP_PINMUX(e, 4, 0x42c, 15, periph)
/* pe4_tstbus4_out */
#define PE4_TSTBUS4_OUT        MCHP_PINMUX(e, 4, 0x428, 33, periph)
/* pe4_tstbus7_out */
#define PE4_TSTBUS7_OUT        MCHP_PINMUX(e, 4, 0x42c, 16, periph)
/* pe4_tstbus8_out */
#define PE4_TSTBUS8_OUT        MCHP_PINMUX(e, 4, 0x428, 34, periph)
/* pe4_tstbus11_out */
#define PE4_TSTBUS11_OUT       MCHP_PINMUX(e, 4, 0x42c, 17, periph)
/* pe5_qspi_sck_out */
#define PE5_QSPI_SCK_OUT       MCHP_PINMUX(e, 5, 0x430, 7, periph)
/* pe5_refi_in */
#define PE5_REFI_IN            MCHP_PINMUX(e, 5, 0xb0, 5, periph)
/* pe5_refo1_out */
#define PE5_REFO1_OUT          MCHP_PINMUX(e, 5, 0x430, 8, periph)
/* pe5_refo2_out */
#define PE5_REFO2_OUT          MCHP_PINMUX(e, 5, 0x430, 9, periph)
/* pe5_refo3_out */
#define PE5_REFO3_OUT          MCHP_PINMUX(e, 5, 0x430, 10, periph)
/* pe5_refo4_out */
#define PE5_REFO4_OUT          MCHP_PINMUX(e, 5, 0x430, 11, periph)
/* pe5_scom0p1_in */
#define PE5_SCOM0P1_IN         MCHP_PINMUX(e, 5, 0x44, 5, periph)
/* pe5_scom0p1_out */
#define PE5_SCOM0P1_OUT        MCHP_PINMUX(e, 5, 0x430, 1, periph)
/* pe5_scom1p1_in */
#define PE5_SCOM1P1_IN         MCHP_PINMUX(e, 5, 0x54, 5, periph)
/* pe5_scom1p1_out */
#define PE5_SCOM1P1_OUT        MCHP_PINMUX(e, 5, 0x430, 2, periph)
/* pe5_scom2p1_in */
#define PE5_SCOM2P1_IN         MCHP_PINMUX(e, 5, 0x64, 5, periph)
/* pe5_scom2p1_out */
#define PE5_SCOM2P1_OUT        MCHP_PINMUX(e, 5, 0x430, 3, periph)
/* pe5_scom3p1_in */
#define PE5_SCOM3P1_IN         MCHP_PINMUX(e, 5, 0x74, 5, periph)
/* pe5_scom3p1_out */
#define PE5_SCOM3P1_OUT        MCHP_PINMUX(e, 5, 0x430, 4, periph)
/* pe5_scom4p1_in */
#define PE5_SCOM4P1_IN         MCHP_PINMUX(e, 5, 0x84, 5, periph)
/* pe5_scom4p1_out */
#define PE5_SCOM4P1_OUT        MCHP_PINMUX(e, 5, 0x430, 5, periph)
/* pe5_scom5p1_in */
#define PE5_SCOM5P1_IN         MCHP_PINMUX(e, 5, 0x94, 5, periph)
/* pe5_scom5p1_out */
#define PE5_SCOM5P1_OUT        MCHP_PINMUX(e, 5, 0x430, 6, periph)
/* pe6_accmpten_in */
#define PE6_ACCMPTEN_IN        MCHP_PINMUX(e, 6, 0x18c, 10, periph)
/* pe6_cclin0_in */
#define PE6_CCLIN0_IN          MCHP_PINMUX(e, 6, 0xb4, 10, periph)
/* pe6_cclin1_in */
#define PE6_CCLIN1_IN          MCHP_PINMUX(e, 6, 0xb8, 14, periph)
/* pe6_cclin3_in */
#define PE6_CCLIN3_IN          MCHP_PINMUX(e, 6, 0xc0, 10, periph)
/* pe6_cclin4_in */
#define PE6_CCLIN4_IN          MCHP_PINMUX(e, 6, 0xc4, 14, periph)
/* pe6_cclo1_out */
#define PE6_CCLO1_OUT          MCHP_PINMUX(e, 6, 0x438, 1, periph)
/* pe6_coex_bt_state_out */
#define PE6_COEX_BT_STATE_OUT  MCHP_PINMUX(e, 6, 0x434, 37, periph)
/* pe6_coex_rf_act_out */
#define PE6_COEX_RF_ACT_OUT    MCHP_PINMUX(e, 6, 0x438, 41, periph)
/* pe6_extint0_in */
#define PE6_EXTINT0_IN         MCHP_PINMUX(e, 6, 0x0, 10, periph)
/* pe6_extint1_in */
#define PE6_EXTINT1_IN         MCHP_PINMUX(e, 6, 0x4, 14, periph)
/* pe6_fectrl0_out */
#define PE6_FECTRL0_OUT        MCHP_PINMUX(e, 6, 0x438, 40, periph)
/* pe6_fectrl1_out */
#define PE6_FECTRL1_OUT        MCHP_PINMUX(e, 6, 0x434, 35, periph)
/* pe6_fectrl2_out */
#define PE6_FECTRL2_OUT        MCHP_PINMUX(e, 6, 0x434, 36, periph)
/* pe6_qd0_out */
#define PE6_QD0_OUT            MCHP_PINMUX(e, 6, 0x438, 35, periph)
/* pe6_qd1_in */
#define PE6_QD1_IN             MCHP_PINMUX(e, 6, 0xa4, 10, periph)
/* pe6_qd1_out */
#define PE6_QD1_OUT            MCHP_PINMUX(e, 6, 0x434, 30, periph)
/* pe6_qd2_in */
#define PE6_QD2_IN             MCHP_PINMUX(e, 6, 0xa8, 14, periph)
/* pe6_qd2_out */
#define PE6_QD2_OUT            MCHP_PINMUX(e, 6, 0x434, 29, periph)
/* pe6_qd3_out */
#define PE6_QD3_OUT            MCHP_PINMUX(e, 6, 0x434, 28, periph)
/* pe6_qeiccmp0_out */
#define PE6_QEICCMP0_OUT       MCHP_PINMUX(e, 6, 0x434, 31, periph)
/* pe6_qeihome0g1_in */
#define PE6_QEIHOME0G1_IN      MCHP_PINMUX(e, 6, 0x16c, 10, periph)
/* pe6_qeihome0g2_in */
#define PE6_QEIHOME0G2_IN      MCHP_PINMUX(e, 6, 0x170, 14, periph)
/* pe6_qeiindx0g2_in */
#define PE6_QEIINDX0G2_IN      MCHP_PINMUX(e, 6, 0x174, 14, periph)
/* pe6_qspics_out */
#define PE6_QSPICS_OUT         MCHP_PINMUX(e, 6, 0x434, 27, periph)
/* pe6_scom0p0_in */
#define PE6_SCOM0P0_IN         MCHP_PINMUX(e, 6, 0x40, 14, periph)
/* pe6_scom0p0_out */
#define PE6_SCOM0P0_OUT        MCHP_PINMUX(e, 6, 0x438, 2, periph)
/* pe6_scom0p2_out */
#define PE6_SCOM0P2_OUT        MCHP_PINMUX(e, 6, 0x434, 2, periph)
/* pe6_scom0p3_in */
#define PE6_SCOM0P3_IN         MCHP_PINMUX(e, 6, 0x4c, 10, periph)
/* pe6_scom0p3_out */
#define PE6_SCOM0P3_OUT        MCHP_PINMUX(e, 6, 0x434, 1, periph)
/* pe6_scom1p0_out */
#define PE6_SCOM1P0_OUT        MCHP_PINMUX(e, 6, 0x434, 3, periph)
/* pe6_scom1p2_in */
#define PE6_SCOM1P2_IN         MCHP_PINMUX(e, 6, 0x58, 10, periph)
/* pe6_scom1p2_out */
#define PE6_SCOM1P2_OUT        MCHP_PINMUX(e, 6, 0x434, 4, periph)
/* pe6_scom1p3_in */
#define PE6_SCOM1P3_IN         MCHP_PINMUX(e, 6, 0x5c, 14, periph)
/* pe6_scom1p3_out */
#define PE6_SCOM1P3_OUT        MCHP_PINMUX(e, 6, 0x438, 5, periph)
/* pe6_scom2p0_in */
#define PE6_SCOM2P0_IN         MCHP_PINMUX(e, 6, 0x60, 14, periph)
/* pe6_scom2p0_out */
#define PE6_SCOM2P0_OUT        MCHP_PINMUX(e, 6, 0x438, 7, periph)
/* pe6_scom2p2_out */
#define PE6_SCOM2P2_OUT        MCHP_PINMUX(e, 6, 0x434, 6, periph)
/* pe6_scom2p3_in */
#define PE6_SCOM2P3_IN         MCHP_PINMUX(e, 6, 0x6c, 10, periph)
/* pe6_scom2p3_out */
#define PE6_SCOM2P3_OUT        MCHP_PINMUX(e, 6, 0x434, 5, periph)
/* pe6_scom3p0_out */
#define PE6_SCOM3P0_OUT        MCHP_PINMUX(e, 6, 0x434, 7, periph)
