zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62132-pinctrl.h
/* pe6_scom3p2_in */
#define PE6_SCOM3P2_IN         MCHP_PINMUX(e, 6, 0x78, 10, periph)
/* pe6_scom3p2_out */
#define PE6_SCOM3P2_OUT        MCHP_PINMUX(e, 6, 0x434, 8, periph)
/* pe6_scom3p3_in */
#define PE6_SCOM3P3_IN         MCHP_PINMUX(e, 6, 0x7c, 14, periph)
/* pe6_scom3p3_out */
#define PE6_SCOM3P3_OUT        MCHP_PINMUX(e, 6, 0x438, 10, periph)
/* pe6_scom4p0_in */
#define PE6_SCOM4P0_IN         MCHP_PINMUX(e, 6, 0x80, 14, periph)
/* pe6_scom4p0_out */
#define PE6_SCOM4P0_OUT        MCHP_PINMUX(e, 6, 0x438, 12, periph)
/* pe6_scom4p2_out */
#define PE6_SCOM4P2_OUT        MCHP_PINMUX(e, 6, 0x434, 10, periph)
/* pe6_scom4p3_in */
#define PE6_SCOM4P3_IN         MCHP_PINMUX(e, 6, 0x8c, 10, periph)
/* pe6_scom4p3_out */
#define PE6_SCOM4P3_OUT        MCHP_PINMUX(e, 6, 0x434, 9, periph)
/* pe6_scom5p0_out */
#define PE6_SCOM5P0_OUT        MCHP_PINMUX(e, 6, 0x434, 11, periph)
/* pe6_scom5p2_in */
#define PE6_SCOM5P2_IN         MCHP_PINMUX(e, 6, 0x98, 10, periph)
/* pe6_scom5p2_out */
#define PE6_SCOM5P2_OUT        MCHP_PINMUX(e, 6, 0x434, 12, periph)
/* pe6_scom5p3_in */
#define PE6_SCOM5P3_IN         MCHP_PINMUX(e, 6, 0x9c, 14, periph)
/* pe6_scom5p3_out */
#define PE6_SCOM5P3_OUT        MCHP_PINMUX(e, 6, 0x438, 15, periph)
/* pe6_tc0wo0g1_in */
#define PE6_TC0WO0G1_IN        MCHP_PINMUX(e, 6, 0xcc, 10, periph)
/* pe6_tc0wo0g2_in */
#define PE6_TC0WO0G2_IN        MCHP_PINMUX(e, 6, 0xd0, 14, periph)
/* pe6_tc0wo1_out */
#define PE6_TC0WO1_OUT         MCHP_PINMUX(e, 6, 0x434, 18, periph)
/* pe6_tc1wo0g1_in */
#define PE6_TC1WO0G1_IN        MCHP_PINMUX(e, 6, 0xdc, 10, periph)
/* pe6_tc1wo0_out */
#define PE6_TC1WO0_OUT         MCHP_PINMUX(e, 6, 0x434, 19, periph)
/* pe6_tc1wo1g2_in */
#define PE6_TC1WO1G2_IN        MCHP_PINMUX(e, 6, 0xe4, 14, periph)
/* pe6_tc1wo1_out */
#define PE6_TC1WO1_OUT         MCHP_PINMUX(e, 6, 0x438, 25, periph)
/* pe6_tc2wo0g1_in */
#define PE6_TC2WO0G1_IN        MCHP_PINMUX(e, 6, 0xec, 10, periph)
/* pe6_tc2wo0_out */
#define PE6_TC2WO0_OUT         MCHP_PINMUX(e, 6, 0x434, 20, periph)
/* pe6_tc2wo1g2_in */
#define PE6_TC2WO1G2_IN        MCHP_PINMUX(e, 6, 0xf4, 14, periph)
/* pe6_tc2wo1_out */
#define PE6_TC2WO1_OUT         MCHP_PINMUX(e, 6, 0x438, 26, periph)
/* pe6_tc3wo0g1_in */
#define PE6_TC3WO0G1_IN        MCHP_PINMUX(e, 6, 0xfc, 10, periph)
/* pe6_tc3wo0_out */
#define PE6_TC3WO0_OUT         MCHP_PINMUX(e, 6, 0x434, 21, periph)
/* pe6_tc3wo1g2_in */
#define PE6_TC3WO1G2_IN        MCHP_PINMUX(e, 6, 0x104, 14, periph)
/* pe6_tc3wo1_out */
#define PE6_TC3WO1_OUT         MCHP_PINMUX(e, 6, 0x438, 27, periph)
/* pe6_tc4wo0g1_in */
#define PE6_TC4WO0G1_IN        MCHP_PINMUX(e, 6, 0x10c, 10, periph)
/* pe6_tc4wo0_out */
#define PE6_TC4WO0_OUT         MCHP_PINMUX(e, 6, 0x434, 22, periph)
/* pe6_tc4wo1g2_in */
#define PE6_TC4WO1G2_IN        MCHP_PINMUX(e, 6, 0x114, 14, periph)
/* pe6_tc4wo1_out */
#define PE6_TC4WO1_OUT         MCHP_PINMUX(e, 6, 0x438, 28, periph)
/* pe6_tc5wo0g1_in */
#define PE6_TC5WO0G1_IN        MCHP_PINMUX(e, 6, 0x11c, 10, periph)
/* pe6_tc5wo0_out */
#define PE6_TC5WO0_OUT         MCHP_PINMUX(e, 6, 0x434, 23, periph)
/* pe6_tc5wo1g2_in */
#define PE6_TC5WO1G2_IN        MCHP_PINMUX(e, 6, 0x124, 14, periph)
/* pe6_tc5wo1_out */
#define PE6_TC5WO1_OUT         MCHP_PINMUX(e, 6, 0x438, 29, periph)
/* pe6_tc6wo0g1_in */
#define PE6_TC6WO0G1_IN        MCHP_PINMUX(e, 6, 0x12c, 10, periph)
/* pe6_tc6wo0_out */
#define PE6_TC6WO0_OUT         MCHP_PINMUX(e, 6, 0x434, 24, periph)
/* pe6_tc6wo1g2_in */
#define PE6_TC6WO1G2_IN        MCHP_PINMUX(e, 6, 0x134, 14, periph)
/* pe6_tc6wo1_out */
#define PE6_TC6WO1_OUT         MCHP_PINMUX(e, 6, 0x438, 30, periph)
/* pe6_tc7wo0g1_in */
#define PE6_TC7WO0G1_IN        MCHP_PINMUX(e, 6, 0x13c, 10, periph)
/* pe6_tc7wo0_out */
#define PE6_TC7WO0_OUT         MCHP_PINMUX(e, 6, 0x434, 25, periph)
/* pe6_tc7wo1g2_in */
#define PE6_TC7WO1G2_IN        MCHP_PINMUX(e, 6, 0x144, 14, periph)
/* pe6_tc7wo1_out */
#define PE6_TC7WO1_OUT         MCHP_PINMUX(e, 6, 0x438, 31, periph)
/* pe6_tc8wo0g1_in */
#define PE6_TC8WO0G1_IN        MCHP_PINMUX(e, 6, 0x14c, 10, periph)
/* pe6_tc8wo0_out */
#define PE6_TC8WO0_OUT         MCHP_PINMUX(e, 6, 0x434, 26, periph)
/* pe6_tc8wo1g2_in */
#define PE6_TC8WO1G2_IN        MCHP_PINMUX(e, 6, 0x154, 14, periph)
/* pe6_tc8wo1_out */
#define PE6_TC8WO1_OUT         MCHP_PINMUX(e, 6, 0x438, 32, periph)
/* pe6_tc9wo0g2_in */
#define PE6_TC9WO0G2_IN        MCHP_PINMUX(e, 6, 0x15c, 14, periph)
/* pe6_tc9wo0_out */
#define PE6_TC9WO0_OUT         MCHP_PINMUX(e, 6, 0x438, 33, periph)
/* pe6_tcc0wo0_out */
#define PE6_TCC0WO0_OUT        MCHP_PINMUX(e, 6, 0x434, 13, periph)
/* pe6_tcc0wo1_out */
#define PE6_TCC0WO1_OUT        MCHP_PINMUX(e, 6, 0x438, 17, periph)
/* pe6_tcc0wo3_out */
#define PE6_TCC0WO3_OUT        MCHP_PINMUX(e, 6, 0x438, 19, periph)
/* pe6_tcc0wo4_out */
#define PE6_TCC0WO4_OUT        MCHP_PINMUX(e, 6, 0x434, 14, periph)
/* pe6_tcc0wo5_out */
#define PE6_TCC0WO5_OUT        MCHP_PINMUX(e, 6, 0x438, 18, periph)
/* pe6_tcc1wo0_out */
#define PE6_TCC1WO0_OUT        MCHP_PINMUX(e, 6, 0x434, 15, periph)
/* pe6_tcc1wo1_out */
#define PE6_TCC1WO1_OUT        MCHP_PINMUX(e, 6, 0x438, 20, periph)
/* pe6_tcc1wo3_out */
#define PE6_TCC1WO3_OUT        MCHP_PINMUX(e, 6, 0x438, 22, periph)
/* pe6_tcc1wo4_out */
#define PE6_TCC1WO4_OUT        MCHP_PINMUX(e, 6, 0x434, 16, periph)
/* pe6_tcc1wo5_out */
#define PE6_TCC1WO5_OUT        MCHP_PINMUX(e, 6, 0x438, 21, periph)
/* pe6_tcc2wo0_out */
#define PE6_TCC2WO0_OUT        MCHP_PINMUX(e, 6, 0x434, 17, periph)
/* pe6_tcc2wo1_out */
#define PE6_TCC2WO1_OUT        MCHP_PINMUX(e, 6, 0x438, 23, periph)
/* pe6_tstbus0_out */
#define PE6_TSTBUS0_OUT        MCHP_PINMUX(e, 6, 0x434, 32, periph)
/* pe6_tstbus4_out */
#define PE6_TSTBUS4_OUT        MCHP_PINMUX(e, 6, 0x434, 33, periph)
/* pe6_tstbus5_out */
#define PE6_TSTBUS5_OUT        MCHP_PINMUX(e, 6, 0x438, 38, periph)
/* pe6_tstbus8_out */
#define PE6_TSTBUS8_OUT        MCHP_PINMUX(e, 6, 0x434, 34, periph)
/* pe6_tstbus9_out */
#define PE6_TSTBUS9_OUT        MCHP_PINMUX(e, 6, 0x438, 39, periph)

#endif /* MICROCHIP_PIC32CX2051BZ62132_PINCTRL_H_ */
